{
  "title": "Strategies for Shen",
  "statisticshen": "Statistic",
  "formula_dano": "Damage Reduction (%) = (Resistance / (Resistance + 100)) * 100",
  "formuladescricao": "So, like in some other games, there's a softcap at 200 and a hardcap at 350. That's the range you want to stay in; anything beyond that is a waste, as HP will be more valuable.",
  "formuladescricao2": "Remember, if the enemy team misses and makes a team made entirely of a single damage type, then feel free to do anything different when hitting the hardcap, as it will be a waste of status ",
  "header": {
    "title": "Welcome to Strategies for Shen",
    "subtitle": "Welcome to the definitive guide for mastering Shen, the Eye of Twilight. If you're looking to transcend the tank role and become a true force on the Rift, you've come to the right place. Here, we'll explore the champion's nuances, revealing advanced gameplay strategies, ideal builds, and the right mindset to protect your allies, split pressure across the map, and impact global teamfights. Get ready to elevate your Shen mastery to a new level."
  },
  "Pros": {
    "1": "Global Teleport",
    "2": "Strong laning phase",
    "3": "Fluid blade mechanics",
    "4": "Teaches map-awareness",
    "5": "High skill ceiling",
    "6": "Dual-wielding Ninja"
  },
  "Cons": {
    "1": "Limited Wave Clear",
    "2": "Weak Against Long-Range Champions",
    "3": "Difficult to Land CC",
    "4": "Teaches map-awareness",
    "5": "Low area damage",
    "6": "It's not one of Riot's favorites."
  },
  "summary": {
    "title": "Summary",
    "statistics": "Statistics",
    "basic": "Basic",
    "Abilities": "Abilities and Statistics",
    "Mechanics": "Mechanics"
  },
  "navbar": {
    "title": "Strategies for Shen",
    "language": "Language:"
  },
  "ShenSkills": {
    "KiBarrier": "Ki Barrier",
    "TwilightAssault": "Twilight Assault",
    "SpiritRefuge": "Spirit's Refuge",
    "ShandowDash": "Shadow Dash",
    "StandUnited": "Stand United"
  },
  "KiBarrier": {
    "title": "Ki Barrier",
    "Innate": "Innate:",
    "descricao1": "After completing an ability's effects, Shen grants himself a shield for 47 - 120 (based on level) (+ 13% bonus health) for 2.5 seconds. If Shen affects at least one other  champion with an ability, Ki Barrier's cooldown is reduced by 4 - 8 (based on level) seconds.",
    "descricao2": "Shen manifests a Spirit Blade that he can control wit Twilight Assault and Spirit's Refuge.",
    "detalhes": "<p>The Spirit Blade spawns with Shen, teleports closer to him if he gets too far away, and instantly blinks to him if he uses any global blink, Teleport, Recall, or Stand United. It will also dissappear if Shen dies and reappear upon respawning.</p> <p>Enemies see an arrow pointing from Shen to the location of his Spirit Blade even if it is not visible.</p> <p>Twilight Assault will grant the shield if the Spirit Blade reaches Shen. If it is stopped, no shield is granted. It will grant the cooldown reduction upon hitting an enemy champion.</p> <p>Spirit's Refuge will grant the shield and/or the cooldown reduction after the protective zone disappears. It does not need to block attacks to trigger the cooldown reduction, just touch an ally champion at any point of the duration.</p> <p>Shadow Dash will grant the shield when the dash ends. It will grant the cooldown reduction upon hitting an enemy champion. If the dash is An icon representing the keyword Interrupt interrupted, the shield will instead be received the moment the crowd control source is applied, before damage calculation (if any).</p> <p>Stand United will give the shield and/or the cooldown reduction upon completing the channel.</p>"
  },
  "TwilightAssault": {
    "title": "Twilight Assault",
    "descricao1": "Active: Shen recalls his Spirit Blade to his location. Enemy champions hit are slowed for the next 2 seconds while moving away from Shen.<br><br>Once it arrives, Shen empowers his next 3 basic attacks within 8 seconds to gain 75 bonus range and deal bonus magic damage. Against structures, only the flat damage portion is applied.<br><br>If the Spirit Blade hits at least one enemy champion during the travel, the attacks are further enhanced to deal increased bonus magic damage and additionally grant Shen 50% bonus attack speed.<br><br>Empowered attacks against monsters deal 100% bonus damage, but their total damage is capped.",
    "descricao2": "<p>Slow: 25 / 30 / 35 / 40 / 45%</p> <p>Bonus Magic Damage: 10 - 40 (based on level) (+ 2 / 2.5 / 3 / 3.5 / 4% (+ 1.5% per 100 AP) of target's maximum health)</p> <p>Total Magic Damage: 30 - 120 (based on level) (+ 6 / 7.5 / 9 / 10.5 / 12% (+ 4.5% per 100 AP) of target's maximum health)</p> <p>Increased Bonus Damage: 10 - 40 (based on level) (+ 5 / 5.5 / 6 / 6.5 / 7% (+ 2% per 100 AP) of target's maximum health)</p> <p>Total Increased Damage: 30 - 120 (based on level) (+ 15 / 16.5 / 18 / 19.5 / 21% (+ 6% per 100 AP) of target's maximum health)</p> <p>Maximum Monster Damage: 120 / 140 / 160 / 180 / 200</p>",
    "detalhes": "The Spirit Blade will stop in place upon colliding with Wind Wall or Unbreakable or Rebuttal or Blade Whirl. If this occurs, Shen will not receive the empowered attacks.</p><p>When it is called, the Spirit Blade also checks for units which's gameplay radius it overlaps which (equal to a An icon representing the keyword Edge range 0 radius check) before flying off, allowing it to hit enemies whose center is behind the missile origin.</p><p>The empowered attack will not trigger against wards.</p>",
    "interacao0": "Items like Jak'Sho, The Protean, Unending Despair, and Eclipse. And the runes Electrocute, Phase Rush, Approach Velocity, Font of Life, and Cheap Shot apply their effects when the spirit sword is recalled. In cases where you need to follow the rune and item rules, like Electrocute, which requires 3 attacks, the recall counts as 1 near-hit."
  },
  "SpiritRefuge": {
    "title": "Twilight Assault",
    "descricao0": "Active: Shen primes his Spirit Blade, creating an area around it. After 2 seconds, or when Shen or an allied champion enters the area, the Spirit Blade generates a protective zone for 1.75 seconds blocking all non- turret basic attacks that hit Shen or allied champions in the area.",
    "detalhes": "<p>Spirit's Refuge's protective zone can be moved while active if Shen uses Twilight Assault.</p><p>Spirit's Refuge cannot be ranked up at Level 1.</p><p>Spirit's Refuge will also block damage from all abilities that us basic damage Lunge, Mystic Shot, Steel Tempest, Mortal Steel</p><p>Allied clones are also considered champions for this ability.</p> "
  },
  "ShandowDash": {
    "title": "Shandow Dash",
    "descricao1": "Passive: Dealing damage with Twilight Assault or Shadow Dash restores 30 / 40 / 50 (based on level) energy.</p> <p> Active: Shen  dashes to the target location, dealing physical damage to enemy  champions and  monsters he passes through and taunting them for 1.5 seconds.</p> <p> Twilight Assault and Spirit's Refuge can be cast during the dash.",
    "detalhes": "Casting Flash during Shadow Dash will end the dash prematurely, but the end-of-dash collision check will hit enemies at the blink's location still. <p>This still cannot affect the same enemy more than once.</p> <p> The energy restore from Shadow Dash may only occur once. </p>"
  },
  "StandUnited": {
    "title": "Stand United",
    "descricao1": "Active: Shen focuses his will, channeling for 3 seconds and granting the target allied champion a shield for 5 seconds at the time of cast, increased by 0% - 60% (based on target's missing health). <p> Upon completing the channel, Shen and his Spirit Blade  blink to the target ally's location, placed between them and the nearest enemy champion. Shen also destroys any projectiles targeting him at the time of completion. </p>",
    "detalhes": "Stand United can target allies via the mini map or on their portraits or by using the F2 - F5 keys none of this can be done if Shen is affected by nearsight or his target is  untargetable <p> Shen will turn to face towards his target ally at the start of the channel. If the target is stealthed, enemies could, in theory, use this to estimate their location. </p> <p> Shen will channel so long as his target is alive (even if the granted shield is broken). If his target dies, the channel is canceled and Stand United goes on full cooldown. </p> <p> Interrupting Stand United's channel will not remove the shield prematurely. </p> <p> The target's screen will glow purple to telegraph that Shen has targeted them with Stand United. </p> <p> It will change back when the channel ends. </p> <p> Shen finds the nearest visible enemy champion within 2000 range from the ally or the nearest invisible champion within 600 range to place himself 175 units from his ally towards that enemy. </p> <p> Stand United has a forgiveness radius of 100 units. </p>",
    "interacao0": "You can use it as a target through the icon above the map.",
    "interacao01": "It will work as if you use it directly on it. In chaotic fights, this is the simplest way to avoid missing your target.",
    "interacao02": "The Zeke's Convergence item works at the end, when you are teleported or interrupted the item is automatically activated, in a way the item works."
  },
  "Mechanics": {
    "title": "Mechanics by xPetu",
    "title1": "Trading Pattern",
    "title2": "The Extended Trade",
    "title3": "The Grasp Chop",
    "title4": "The Towercrash Taunt",
    "title5": "E-Flash",
    "title6": "Q-Flash",
    "title7": "Triple-Q Leash",
    "title8": "Q-W Protecting",
    "descricao1": "In academia, it is possible to analyse a person's capabilities through a tool box metaphor. Let's take me for example: Every time I take a course at my university and learn about a new branch of mathematics, I'm adding a new mathematical tool to my existing mathematical tool box. I'm then able to combine and use the available tools in my mathematical tool box to solve different problems. In League of Legends we can take a similar approach. The usage of the trading tools available to you comprises your trading pattern in the laning phase. After reading this section, you will have acquired three (3) new tools to your trading tool box on Shen. By combining and using these newly-obtained trading tools in game, your Shen gameplay will ascend to another level.",
    "descricao2": "This is an extremely powerful trading tool that can be applied notably well in most melee matchups. To set the Extended Trade up, you need to use Twilight Assault to drag your Spirit Blade to an offensive position before the trade. In general, we consider the Spirit Blade to be in an offensive position when it is deep on the enemy's side of the lane. A defensive Spirit Blade position means that your Spirit Blade is close to your tower or behind you in general. When playing aggressively, always looks for opportunities to drag your Spirit Blade to an offensive position.",
    "descricao21": "To perform the Extended trade, start off by simply using Q to pull the Spirit Blade through your opponent. Now you want to wait for a couple of seconds to let your Q cool down. The 3 empowered Q stacks last for 8 seconds, so you're in no hurry. If the enemy does not respect you, you can simply walk up and start attacking him. After 3 basic attacks, you should position yourself inside of the enemy champion's model to guarantee a second drag-through with your Q. You are almost guaranteed to win the trade if you manage to get all 6 empowered basic attacks off. You can use your E to close the initial gap, to chase for a kill or to disengage after your Qs, depending on the matchup and how the enemy plays it. You should use your W to block the enemy's retaliation attempts during the trade. This trading tool is at its best during the early stages of the laning phase (levels 2-5). Naturally, there is room for variation, i.e. the Extended Trade can be performed from a defensive Spirit Blade position or with any number of initial Q stacks. Always try to adapt the tools to fit the situation presented to you.",
    "descricao3": "In contrast to the aforementioned Extended Trade, that requires some set-up and commitment, the Grasp Chop is a trading tool that can be used from almost all positions and it's very noncommittal by definition. The Grasp Chop is simply one Q-AA with a Grasp of Undying proc. When performed correctly from an offensive Spirit Blade position, the Grasp Chop will trigger the following runes Grasp of the Undying (stay in combat with minions) Shield Bash (activate your Passive with Q) and Cheap Shot (drag-through Q slows). Now that's a lot of damage coming from one (1) basic attack! Performing the Grasp Chop consistently will create a health-advantage for you, which will inevitably lead to kill opportunities with the Extended Trade. The secret behind the success of the Grasp Chop is Ki Barrier. There is no way for the opponent to win short trades versus a perfect grasp-chopping Shen, because you are always shielded when going in for the short trade.",
    "descricao4": "This trading tool is the most situational out of the three. It requires you to have a slow-pushing minion wave that crashes into the enemy tower. To perform the Towercrash Taunt, start by walking up to the opponent under tower and dragging your blade through him thus activating your passive shield. Instead of attacking the enemy champion, simply start attacking his tower. Our goal is to stay in combat to prime Grasp of the Undying. The enemy will most likely attack you and that's the moment you strike: Attack him once with an Empowered Q-AA and then E backwards through him, away from the tower. If done correctly, you will be out of tower range before taking a tower shot.",
    "descricao5": "The Taunt-Flash. This is Shen's most well-known mechanical trick and an iconic part of his kit. To perform the E-Flash, cast Shadow Dash and use  Flash before the dash ends. It's a very simple combo but it can be used in endlessly creative ways. To maximize the range and the area covered by your Shadow Dash's hitbox, you should cast E at maximum range and Flash right before the dash completes. However, maximizing range is not the only correct usage of the Taunt-Flash. You can perform an instant E-Flash by casting Flash immediately after your E. This can be used to catch enemies off-guard from close range and it's especially useful versus a Champion like Fiora, who's always looking to parry your E. I recommend practicing Taunt-Flashing in the Practice Tool before doing it in game. Just play around with the combo by placing multiple Target Dummies and trying to hit them all in creative ways.",
    "descricao6": "A less well-known mechanic, but an equally important one, is the Q-Flash. This trick was first documented by me in 2017 but it has still remained shadows to this day and is outshone by the popular Taunt-Flash. Shen's damage output is greatly increased if you enhance your Q-AAs by pulling your Spirit Blade through an enemy. Getting or not getting the drag-through is often the deciding factor in finishing an enemy off. Pulling the Spirit Blade through an enemy also reduces the cooldown of your  Ki Barrier and can thus, in combination with another ability, save you from otherwise lethal damage. Q-Flashing is the fastest and most reliable method of guaranteeing the drag-through. To perform the Q-Flash, cast Twilight Assault and Flash on top of the enemy champion before the Spirit Blade reaches your location. If you Flash too late, the Spirit Blade will stay at the initial cast point of your Flash. When mastered, this technique will prove valuable in every game you play as Shen.",
    "descricao7": "Shen has one the best Level 1 jungle leashes in the game because of the damage on  Twilight Assault. Most Shen players simply use Q at 1:29 while leashing and then hit 3 Q-AAs on the monster. This is wrong. First, we discovered the Double-Q Leash. To perform the Double-Q Leash, use your first Q at 1:25 and use Q again when you've used the first 3 Q-AAs. The principle is the same as in the Extended Trade. Now, a hasty inference might lead you to think that this is the best possible leash you can give. You would be wrong. Shending Help was the first to document the optimal leashing technique on Shen, the Triple-Q Leash. The Triple-Q Leash adds a Passive shield into the leash and thus supersedes the Double-Q Leash. We manipulate Ki Barrier's cooldown by using Q before the first damaging Q at 1:25. To perform the Triple-Q Leash, use the first Q at 1:17, the second Q at 1:25 and the third Q at 1:34 (after 3 Q-AAs). Use your Passive shield to tank 1 or 2 hits for your Jungler. By doing this correctly, you make your Jungler very happy and arrive to lane in time for the first minion death.",
    "descricao8": "Most Shen players default to using on themselves as if they were playing Jax and using his Counter Strike. During the laning phase, this is correct because you are in fact alone in the top lane. However, when it comes to teamfights and skirmishes, Shen's W should be used to protect your teammates. Spirit's Refuge is an incredibly powerful ability when used correctly. Giving an ADC a two-second immunity to basic attacks can mean the difference between winning and losing a teamfight. The easiest way to apply Spirit's Refuge on a carry is by simply standing next to them, using Q to pull the Spirit Blade there and then using W. In addition to this basic method, there is an advanced way of blocking basic attacks on your teammates. Advanced Q-W Protecting, as I like to call it, is probably the hardest Shen mechanic to perform correctly. It's a situational technique that requires your ally to be standing between you and your Spirit Blade. If you press Q and W at the same time, your Spirit Blade will be primed while moving towards you. When primed, it will activate if it passes through an ally champion, meaning it can also block basic attacks while traveling. An activated, moving Spirit's Refuge will also have a larger instantaneous area of effect than a stationary Spirit's Refuge. This is caused by the check frequency of Spirit's Refuge. The details of this interaction are omitted here for now as they are outside the scope of this guide. See the video below for an example of Q-W Protecting and the larger area of effect."
  },
  "skins": {
    "original": "<h2> <p> Original </p> </h2> Among the secretive, Ionian warriors known as the Kinkou, Shen serves as their leader, the Eye of Twilight. He longs to remain free from the confusion of emotion, prejudice, and ego, and walks the unseen path of dispassionate judgment between the spirit realm and the physical world. Tasked with enforcing the equilibrium between them, Shen wields blades of steel and arcane energy against any who would threaten it.",
    "frozen": "<h2> <p> Frozen </p> </h2> Enduring the bitter cold, Shen roams the ice caps with his twin blades, hunting the terrifying demon hidden deep underneath.",
    "YellowJacket": "<h2> <p> Yellow Jacket </p> </h2>",
    "Surgeon": "<h2> <p> Surgeon </p> </h2> Rest assured, anesthesia won't be part of the operation.",
    "BloodMoon": "<h2> <p> Blood Moon </p> </h2> The most indomitable disciple, in mind and body, Shen's loyalty to the Blood Moon cult can never be shaken. He serves as the personal bodyguard of the group's most important figures, executing interlopers with a cool dispassion, suggesting part of his humanity has already been consumed.",
    "WarlordSkin": "<h2> <p> Warlord </p> </h2>",
    "tpa": "<h2> <p> TPA </p> </h2> Honoring Stanley's winning performance as Shen during the 2012 World Championship.",
    "Pulsefire": "<h2> <p> Pulsefire </p> </h2> Over the millennia, Shen has been called many names: warlord, trespasser, conqueror. Even so, his mission to build an army for the ages seems never-ending. Seeking only the smartest and the strongest to join his ranks, he remains untroubled by emotion, casting his timeless gaze over those with hidden potential.",
    "Infernal": "<h2> <p> Infernal </p> </h2> An Infernal warrior risen from the raging depths of the underworld, Shen appears on battlefields in the blink of an eye, shielding his fellow titans from even the most well-organized resistance.",
    "PsyOps": "<h2> <p> PsyOps </p> </h2> A psychic soldier and field lieutenant within PsyOps, Shen's power is connected to a phantom child that follows him wherever he goes -- granting him insight into the middens between the living and the dead. Where the boy came from only High Command knows, and they aren't talking.",
    "Shockblade": "<h2> <p> Shockblade </p> </h2> Once half of an elite operative duo for the Shockblade order, Shen stepped away from combat after he made a mistake that nearly cost the life of his partner, Zed. Now Shen mentors young shinobi training to join their ranks – but his new charge may inspire him to take up his sword and join the fight once more.",
    "AshenGuardian": "<h2> <p> Ashen Guardian </p> </h2> A devotee of the principles of his now slain leader, Shen still walks the castle grounds, wielding his master's blade alongside his own. Perhaps some small part of him recognizes, with each blow to his armor from travelers seeking ancient riches, that his guard is senseless. But life must have meaning. Even life as endless as this.",
    "ThreeHonors": "<h2> <p> Three Honors </p> </h2> Shen is the last surviving founder of the Order of Solace. He shuttered every temple when the world fell into apathy and carelessness, disappearing into obscurity until Malzahar revived the Order. Now returned from the shadows, Shen serves as its most senior teacher, a stoic leader of integrity and grace that all can rely on."
  },
  "MapAwareness": {
    "title0": "Map Awareness by xPetu",
    "title": "Map Awareness",
    "title1": "Wave Management",
    "title2": "Cast Timing",
    "title3": "Split-pushing",
    "title4": "Current Objective",
    "title5": "Mirroring Pressure",
    "title6": "Vision",
    "title7": "Stand United",
    "fingers": "As Shen, you need to be aware of what is happening on the map. Firstly, you need to look at the minimap constantly, atleast once every 5 seconds. This is a general tip and is not specific to Shen. It will improve your gameplay on any champion. The second important thing is to move your camera around the map. The minimap gives a whole lot of information, but not everything. To see enemy resource bars, minion health and abilities being used you have to look around the map. There are no excuses to keeping your camera centered on your champion all the time. You need to know what everyone on your team is doing, who is in danger and who is safe. This is vital to your ultimate because you're giving yourself more time to think and make the best decisions. You can either click the map to look around or use the F-keys to view your teammates. I've personally rebound my F-keys to Space for Jungle, V for Mid, C for ADC and X for support. This allows me to quickly check on every teammate with just my thumb while keeping the rest of my fingers on QWER.",
    "WaveManagement": "The state of minion waves has a profound impact on the net present value of Shen's ultimate. It's rarely a good idea to use  Stand United if there is a giant minion wave about to crash into your tower. In the best-case scenario, you would have pushed your minion wave to enemy tower prior to ulting, thus minimizing the amount of minions lost during your absence. Having  Teleport to get back to lane is also ideal. In reality, there are situations where you will have to ult and the wave will not be in a perfect state. But we can minimize our losses by planning ahead. If you can read the state of the game and predict what is likely to happen in the next few minutes, you can setup the minion waves accordingly. Proactive ultimates are great, because they can (by definition) be executed while your wave is pushed up.",
    "CastTiming": " Stand United's shield scales with the target's missing health percentage, maxing out at 60% missing health. The rune Revitalize just so happens to increase shielding on targets below 40% of their maximum health, meaning that the theoretically optimal time to cast your ultimate is when the target ally falls below 40% health. This is good to remember. However, this does not mean that you should only ever cast your ultimate on low-health allies. When timing your ultimate, the deciding factor should be the actions of enemy champions. You want to ult at the moment when the opponent commits to your target ally. Using Stand United is similar to fishing: You don't want to ult too early and scare away the fish, but you also don't want to ult too late when to bait has already been eaten.",
    "Split-pushing": "After the laning phase you'll want to begin split-pushing. Shen excels at split-pushing because he has two ways of joining his team: Teleport and Stand United. Unlike what most people think, the main objective of split-pushing as Shen is NOT to take towers, it is to draw pressure away from your team. Before we start split-pushing, we need either Teleport or Stand United to be off-cooldown, so that we can join our team if needed. Now, I'll briefly explain the three core principles of split-pushing. Mastering these principles will exponentially improve your Shen gameplay and inevitably, your rank as well.",
    "CurrentObjective": "You need to acknowledge what the current objective is and start pushing the opposite side of the map. If it's a neutral objective like Baron, you split-push bot lane. If your team is grouping to take bot Inhibitor, you split-push top lane. You're trying to force the enemies to commit members of their team away from the current objective, so your team either gets the objective uncontested or wins an advantageous team fight. Understanding your team's current objective and eventually win condition is one of the most important skills in League.",
    "MirroringPressure": "We've all seen it happen, a fed toplaner starts split-pushing, dies in a 1v3 and complains that their team doesn't do anything. That toplaner lacks the concept of mirroring pressure. As a split-pusher it is essential to know when your team has pressure and when they don't. When 4 members of your team are sieging a tower, they have pressure and you can mirror that by applying pressure on the opposite side of the map, forcing the enemy into a lose-lose situation. When your team is recalling or just randomly scattered across the jungle, they don't have pressure, meaning you shouldn't try to apply pressure either. If you die when your team has no pressure, the enemy doesn't lose anything. In general, the more aggressive your team is, the more aggressive you can be.",
    "Vision": "As Shen, the worst thing you can do is die in a sidelane for free. Because when you're dead, you can't ult. And when you can't ult, your team is going to int. To prevent this from happening, you'll want to get ward coverage around your lane. Always buy 1 or 2 Control Wards when split-pushing. THIS IS EXTREMELY IMPORTANT. If you don't have space for a Control Ward, sell your Doran's Shield. Use your Stealth Ward and Control Ward to create a line of vision in the jungle. You don't want to extend beyond this line of vision unless you have knowledge of the enemies' positions. Just remember that dying is the last thing you want to do. If hitting the tower puts you at a risk, don't hit it.",
    "StandUnited": "This section will cover the principles of efficient ultimate usage as Shen.  Stand United is a game-changing ability, thus also having a monumental cooldown. Knowing when to ult and when not to, is a major key to climbing the Solo Queue ranks with Shen. An important distinction to make is the difference between reactive and proactive ultimates. Reactive ultimates are performed to counter the enemy's action and to turn the tide of a fight by (usually) ulting a carry in danger. Proactive ultimates are done in collaboration with an engaging ally to pick a fight on our terms, i.e. ulting a stealthed Kha'Zix to assasinate the enemy backline or ulting Jarvan IV that then E-Q's into the enemy team."
  },
  "Glossary": {
    "title": "Glossary",
    "S": "<strong>S:</strong> Items that are very good.",
    "A": "<strong>A:</strong> Items that are good.",
    "B": "<strong>B:</strong> Items that depend on the composition of the other team.",
    "C": "<strong>C:</strong> Fully situational items",
    "D": "<strong>D:</strong> Items that are not normally made because they are bad for Shen",
    "F": "<strong>F:</strong> Items that do not work",
    "???": "<strong>???:</strong> Items I have no idea about and haven't found anything about",
    "descricao0": "Kinkou Jitte and Twilight's Edge are only there because of the name, since both make reference in some way to the Kinkou Order and Shen, which is the eye of twilight. <p>Some items are wrong on purpose, find out which ones.</p>"
  },
  "matchupstop": {
    "title": "Shen matchups guide by Shending Help",
    "descricao0": "This matchup guide is generally focusing on how to play the <b> early laning phase </b> in each specific matchup. In most matchups you can get a lead one way or another, and then it’s just about correctly driving your lead home and snowball your lane and then transitioning your personal lead to other lanes. Basically all top lane champs outscale you eventually, especially in sidelane, and the difficulty levels are only describing how difficult it is to get yourself that initial lead. <p> <b> Lvl 1 Pushing mindsets (When to push and not to): </b> When the lane starts you should <b> always </b> (if the matchup allows it) try to get the lane <b> slow-pushing </b> towards the enemy. The main way of doing this isn’t to hit the minions a lot, but instead to place the blade up the lane and be ready to punish the enemies HP bar the first time he tries to hit a minion. Keep taking good trades and the enemy will lose access to your wave which lets you get lvl 2 first. You should use this to taunt forwards the moment you hit lvl 2 every game. I’ve noted which matchups you should always be able to get the lvl 1 push in your favor by adding a <b> “Push lvl 1”</b> below their name. When you’re playing against a champ without this notation, that doesn’t mean you can’t try to get the push. If the enemy is not playing optimally and you manage to push without taking too much dmg in return, that’s great (Tip: Try to get to lane earlier than the opponent and hit wave 3-5 times with normal autos before he even shows up). Then you can even in those matchups still lvl 2 all-in and be happy, but be ready to give up on the slow-push idea if the enemy punishes you. </p> <p> <b> Teleport vs Ignite: </b> The times where I take ignite are matchups I feel confident in when it comes to winning early trades and therefore also having full control over the wave. If you ever lose (or even go even) during the first couple of waves of the lane when taking Ignite, you'll get stuck in lane a long time without being able to force a natural recall timing. I've listed below in every matchup whether I take ignite or TP, but if you know that you generally struggle in a specific matchup that I don't, then feel free to take TP even though I list Ignite as my recommended rune (or the other way around if you always win a match I've listed as hard). ",
    "free": {
      "Zac": "Get the slowpush lvl 1, trade hard whenever he comes close, dont’ let him farm at all. Lvl 2 all-in. Punish him constantly. And once you’ve taken him to half, do NOT let him heal up again with his passive. Keep the pressure up and step on his blobs. The only way you lose this lane is if you die to a gank, so remember to ward and respect the enemy jgl when he’s topside. Once you’ve crushed a Zac in lane they tend to just perma roam and hope it works out. In those cases (if it’s before lvl 8) you should just freeze so their team misses wave after wave of gold+XP and spamping your team to be careful and that Zac’s roaming. Even if they die once or twice, it’s still fine, and if they don’t, enemy team is doomed.",
      "Zed": "If some autofilled mid laner dare pick Zed into your Shen, make sure he never does it again. Only let him farm with Q, looking to punish him every time he steps up to auto in order to CS. You hardwin trades lvl 1-5 even if he hits everything, but he probably won’t if you’re decent at sidestepping his Q’s or staying behind your creeps."
    },
    "veryeasy": {
      "Diana": "Try to get a slow push early to hit lvl 2/3 spikes first. If she uses Q or W to contest the push you can freely trade, and if she doesn’t you will be able to hit lvl 2 before her and can instantly taunt in (same on lvl 3 spike). If you’re considering at which time to start the trade, the time where she just used her 3rd passive Emp auto on creeps is a good time (or if she uses Q to farm). Also, remember to place the blade up the lane since she has no strength to stop you.",
      "Hecarim": "As long as you don’t get into very extended trades where he gets to use his stacked up Q (and conq) over and over you should win all trades in this matchup. Do either very short or decently short trades (by placing blade up and lane and saving taunt) until he’s around half hp, then you can taunt in aggressively and get the dragthrough.",
      "Kaynwithoutsmite": "He’s a weak laner, just do what you do in all melee matchups. Get slowpush, place your blade up the lane. Punish him with dragthroughs when he walks up to CS and go for the lvl 2 all-in. ",
      "Lissandra": "Either start E and trade aggressively every time it’s up, or Q-start and contest her push and use the middle bush in between hits on the minions unless she wards it. The key thing is to hit lvl 2 first and look for lvl 2 insta-taunt. You win trades hard lvl 2-5 every time you land a taunt, so as long as you don't get pushed in, this matchup should be easy.",
      "Malphite": "Malph’s trading patterns are very predictable, just play the standard way of placing your blade and using dragthrough anytime he comes close to hit your CS. Make sure you don’t go for the all-in while he’s still healthy, since his atk speed-reduction + his W dmg is strong if he can stand his ground and fight you (but it’s mostly fine to taunt in and hit 3 times and get out). If you have a good blade, you need to make sure to get a good value dragthrough trade with it, so don’t ruin it by Q’ing to just block a Malph Q in those cases. If your blade is already bad though, then it’s fine.",
      "Maokai": "Position your blade, make 1-2 emp. Q auto’s and apply your grasp whenever it’s up, and back out, and repeat. You’re simply so much stronger all early levels than he is, abuse it to the max with short trades. The only thing you should be careful about is taking longer trades inside a minion wave, since he can lock you down for a long time with W + Q, while healing himself up with the passive. So keep short trading him down for every CS he goes for until he’s low enough for you to all-in him. A normal trading pattern will look something like : 1) place blade. 2) wait for Q+passive CD. 3) Use dragthrough and get 1 hit in and then get knocked back by his Q. 4) Wait for a couple seconds, then taunt him, hit him with your 2 leftover Q’s, and then Q again and keep hitting while positioning yourself behind him so he can’t Q you as a disengage.",
      "Nasus": "Nasus is the single weakest top lane matchup in the early few levels. Combined with how strong shen is early on you shouldn’t let him take (or hit) ANY cs for free (except with his E from range). Position your blade up the lane constantly while dragging it through him and trade every time he goes for a last hit. He should be forced to last hit only with his E if you play it correctly. Because he’s so weak, you can even let it push towards you early unlike other matchups and set up an early freeze, but if you end up pushing (which it will often do automatically if you force trades) then it’s possible to use the “Towercrash taunt” very effectively against nasus to poke him down under tower while not taking much dmg back. Aim towards snowballing hard, to the point where you’re lvl 7 to his lvl 4 if you play every earlygame step right, and completely stop him from scaling.<br>The most common mistake in this matchup is to hit minions early lvls for no reason. You want to have the largest time window possible to force trades onto Nasus before your wave crashed into enemy tower where he can safely scale. So never hit enemy minions except lasthits at the very last moment before they die. And also make sure you don’t take aggro from a new incoming enemy minion wave before it has fully aggro’d onto your minions.<br>For his E: Remember that it’s an AOE spell that will also hit minions that are close to you, so actively think about if you want him to dmg them to make it push into you (if you’re in a position to freeze), or if you want to stand away from them to not let him push (if you’re not strong/healthy enough to freeze right then) <br>For after he’s lvl 6: Keep placing the blade aggro to trade with Emp Q’s, but make sure to never taunt in since he can R and kill you with wither. If you save taunt until he’s killable then his all-inthreat is much lower.",
      "Pyke": "Position the blade and force trades with your shield + emp Q’s when he walks up to cs. Make sure to keep the trades short and sweet, and don’t go chasing after him into his wave to get all 3 Emp Q’s off, that will make you take more dmg than you want in return, which will suck extra hard when he heals up in bushes after the trades. If you play it correctly you shouldn’t lose much of your own HP in exchange for his, so him healing some of it is fine. Contest the push by forcing him off and make sure you hit lvl 2 and 3 before him and exploit that. Just be wary of jungle ganks since pyke has great setup. For trades when Pyke is lvl 2+, remember you can’t max range taunt in, since he’ll react with E, so either start trades with a dragthrough (after having placed the blade up), or taunt when you’re close enough that you’re sure he can’t react with his E.",
      "Skarner": "Place blade, trade with dragthrough lvl 1 and end the trade before he gets to use his 3rd Q auto on you from melee range (the rockthrow is fine, but from melee it hurts). Secure the slowpush, and do not overpush to the point where you’ll move the trading area too close to his tower too quickly, since that’s where his E becomes a threat lvl 2+. If you are close to the enemy tower, make sure to respect his E-flash, and stay away from walls while crashing the wave asap to get out of that spot. Apart from his E-flash into tower, his short trades are way worse than yours, so keep abusing him early and expand your lead normally.",
      "Swain": "He’s slow, immobile and squishy. Try to find him before minions spawn (1:05-1:20 optimally) and all-in him with E-start. If you can’t find him, you can either lane normally with Q and tank some auto’s to contest for lvl 2 with Q and use bushes in between, or start E anyway and play aggro, both can work. Go for the lvl 2 all-in if possible. After you’re both lvl2+ you can still look for taunts, but try to time them to when he stands still to use his E on you, so you get behind him and he doesn’t have any CC to prolong the trade after your 3 Emp Q’s when you disengage. Keep trading actively and don’t let him scale to 6 for free. He’s also very gankable.",
      "Sylas": "Place blade lvl 1. Most Sylas’ start E lvl 1, so just stay behind your minions while trading with extra ranged Emp Q’s, and force him to dash in and take full minion aggro from your wave if he wants to hit you with the chain. Just stick to HP-efficient trades and replace blade like normal, and go for lvl 2 all-in after you hit lvl 2 first. Only taunt in once he’s heavily chunked or you’re up a level. The most common mistake is to overpush for no good reason, since then he can farm under tower and scale freely. Keep him in lane by slowpushing as slow as you can and take good trades.",
      "Wukong": "The only time you need to be slightly respectful is lvl 1 because of his passive and atk speed steroid on E. You can still short trade with the extra range try to get lvl 2 first for the all-in but it’s not absolutely necessary. You win super hard lvl 2-5 using Emp Q’s + W Early + keep E ready for disengage (but use it aggressively if you’re up a lot of HP or a lvl or Wu wastes abilities on wave). You have a huge kill threat in this lane if you play trades well."
    },
    "Moderatelyeasy": {
      "Akali": "Place blade lvl 1, then trade with Emp Q if she tries to auto any CS. Try to get the passive to block her first Q if you can, but it’s not necessary to win. You should be able to either hit the taunt lvl 2 zone her from a bit of XP before the 3rd minion wave arrives. Lvl3+, remember that her W has a 2s longer CD than your E, so if you force it in a trade, try to position to taunt the instant it comes up for a hard-winning trade. Try to move in ways to bait out her E and sidestep it if you can, then trade aggro while it’s on CD. Respect the lvl 6 all-in if you don’t already have a big lead by that point.",
      "Ambessa": "Place blade and play for prio lvl 1. Since she’ll always dash away after your first Emp Q, there’s no point in chasing for 2 Emp Q’s right away like you would vs other melee champs. But instead get 1 off, then save the last 2 to stop her from hitting your wave (and if she still does, be ready to punish her for it). Then when Q is up again, replace the blade and repeat. For how to taunt in this matchup, it’s really important to not signal the exact moment you’re going to throw it out, since she’ll be able to dash away and trade back into you. But if you stay at the max of the taunt range for a longer period of time, and then backstep right before taunting, she won’t be able to predict it. And even if she has good reactions, there’s always a delay before her dash goes off after she uses an ability, so she’ll be able to get the Q off, but not the dash, and you can take a good short trade and back off. Be sure to use the 2 first Emp Q’s instantly while she’s taunted, to then just walk away as she gets out of the CC since you don’t wanna use the last Emp Q into her shield (which she will almost for sure be spamming as she gets out of the taunt CC). Keep taking short trades like this over and over until she’s too low to fight back, then commit for the kill.",
      "Camille": "VS Camille you need to trade in a specific way. First you have to make her use both her boneplating + her passive by trading 1 auto for 1 auto (preferably while placing your blade up the lane at the same time). Then while those defensive tools of hers are down you can simply taunt + dragthrough, and you’ll crush every trade if you have everything up. Then repeat (remember to never trade into boneplating or camille passive!). Also if she ever uses E to a wall to trade aggressively, then press Q+W preemptively so her first autos get blocked while you're stunned by her E. Never stand close enough to her and the wall so you're not able to react with Q+W in time. ",
      "ChoGath": "Respect him when he presses E (for his 3 spike autos), apart from that, don’t respect him at all. Go for the lvl 2 all-in. Once you’ve chunked him, you need to keep him low. If he gets to auto on minions freely he’ll be fine, but if he’s zoned away and can only farm with his Q, the healing won’t be too bad. After you’ve hit a taunt on him, sidestep the moment the taunt ends and he’ll miss his Q almost guaranteed, because every Cho will be spamming his Q button during the time he’s taunted.",
      "Mundo": "If he walks up to creeps to last hit you should be able to force winning trades early on from behind your melee minions with your extra range lvl 1, thus avoiding his Q’s. When he’s 2+, also be careful of his E when your minion is low. If he constantly stays back and farms with Q, then be an evil mastermind and bodyblock the cannons and some melee minions with your passive shield whenever it’s up until he grows angry and walks up to last hit after all (and you force trades again).",
      "Garen": "Place the blade before the lane starts. The most important trade is the first one, if you use your extra range and kite well if he tries to start E and trade into you, you should win the trade and then be able to replace the blade before his E is back up, and play for lvl 2 first and taunt in. If he starts Q the trade gets even easier since your passive can block the dmg. <br> Throughout the lane, position the blade up constantly, try to force short trades where you W (or passive shield) his Q dmg and auto him a few times with your Emp. Q’s. Then after using your 3 Emp Q’s you can Taunt out through him while he’s still in his E (or just stay in the fight for the kill if he’s low enough). Then replace the blade / wait for CDs. Repeat until he gets low and force him out of lane or kill him.",
      "Jax": "You need to punish Jax super hard early on to keep him from scaling. Similarly to the irelia matchup, a key thing is to force trades before his passive stacks up. Place the blade, then just drag the Q through him and start hitting him, and the moment he presses E you want to stand inside him and taunt backwards so he doesn’t get the stun off on you. When his E is now CD you can keep trading. That way he gets 0 value out of his E which is his core trading tool. Use W early in the trade. For the lvl 1, it’s about forcing out his E without taking too much dmg for it by running away and making him chase you for the stun, and then take back wavecontrol once his E is on CD since you have a shorter Q CD.",
      "Kayle": "Place the blade, and threaten trades lvl 1 if she walks up to CS. If you can block his Q with passive and trade at the same time it’s optimal, but don’t waste your blade position to block it unless you’re in a position to trade as well. Look for the standard all-in lvl 2. This is a very straightforward matchup. If you apply the standard concepts about how to trade vs melees and how to hold the slowpush and later if needed punish the low kayle under tower, then you should be able to create a big enough advantage to where you can freeze after the first reset. If you have an advantage you can still win trades after lv 6, but pretty much never after lv 11.",
      "Kled": "Contest the push lvl 1. The whole early laning phase you wanna try to bait out his Q (mounted) and dodge it. If you do dodge it you’ll have a window where you can freely win trades with your empowered Q’s. If you get hit, you just walk backwards to deny the second activation and it’s not too bad. You’ll win short trades with your Q’s and W’s while saving your Taunt for disengage if he dashes at you. But NEVER go for an all-in vs him unless you’ve already dismounted him twice or he’s low enough that you’re 100% sure you can kill him before he remounts.",
      "KSante": "Place blade lvl 1. Trade with the dragthrough when he tries to touch your wave. Don’t be scared to eat a Q here or there if you see a chance for a good short-trade, but also try to bait out Q’s whenever possible and use the pressure of the CD to keep control over the wave (without going ham for no reason). Take 1-2 good short trades lvl 1 (while replacing the blade in between) to set up for the lvl 2 all-in the moment you hit it. <br> For his W, try to bait it out whenever possible since he has to pick 1 single direction, and once you see it used, move completely to the side based on where you see him pointing towards (use his shield as the visual indicator). You only need to poke him down with a couple good short trades before you can start looking for aggressive taunts (even if you’re the same lvl). It’s often even fine to taunt him when he has his empowered Q loaded up, since most K’sante’s won’t expect you to go aggro during that window, letting you find an amazing start to the trade, and then once your taunt duration is up, step to the side since he’ll likely be spamming Q when getting out of the taunt CC.",
      "Lillia": "Her only real strength is her speed, and her speed is most useful when you’re actively chasing her while trading. If you just place your blade, and wait for her to walk into you to trade (OR to lasthit) and then get a guaranteed dragthrough then her speed is not as valuable. Make sure to only trade into her until the moment she starts getting out of range, and then you save your leftover Q’s that you didn’t get off, and potentially taunt her aggressively when they’re about to time out (if you’re confident you’ll hit). But if you don’t see any free taunt, then just replace the blade again and repeat this slow process over and over.",
      "Mordekaiser": "Place blade before lane. Then punish him the moment he tries to touch your wave, it’s fine to let him Q you once as long as it’s not isolated and you block it with your passive, then hit him 2 times and back out (don’t chase him into his wave and let him long-trade you). If you end up having a leftover Q, don’t hit minions with it but save it to pressure him away from the wave or hit him in the face if he’s trying to push (+75 range OP). Then just replace your blade up behind enemy melee creeps and hit him with maybe 1 grasp proc (but don’t let him extend the trade since your Q’s won’t be empowered). Then do 1 last trade before lvl 2 once your Q is up again (with passive). And then he’ll be low enough for you to kill at lvl 2 if he’s disrespecting. If he’s respecting and letting you get 2 first, the the #1 priority is to not overpush. Try to get the lvl 2 all-in, but ONLY hit minions the last moment as they’re about to die and not earlier. Because if you keep the push going VERY slowly, he’ll be forced to either walk up into bad trades and possibly die, or to give up lasthit after lasthit after lasthit. The slower the push, the more he’ll miss. But once it’s already hardpushing (your wave is like 4+ more minions), just crash it ASAP and punish him under tower if he’s low or recall if he’s not. Then punish him by taunting in if you’re ahead in items/lvls once you get back to lane, with the idea of eventually zoning him off the wave and freezing. <br> Mechanical tip for trades: Try to bait out his Q by going barely into his max range and going out as many times as possible during lane, and if you ever taunt in and he has E available, he’ll usually be spam-clicking it for when the taunt duration ends. Juke with this in mind and you’ll often make him miss it and CRUSH the trade.",
      "Nocturne": "Place blade lvl 1. Start trade from right behind your minion with dragthrough the moment he tries to hit any of your minions lvl 1, then kite back after 1-2 Emp Q’s. Important to not let him have an extended trade unless he’s taking your full wave’s aggro and you’re not taking any aggro (because you’ve kited back). Then replace blade in an open area (to the side if necessary, but up there), and trade once more with dragthrough+passive before lvl 2 comes around. Then lvl 2 all-in if you get it first, or just play trades slower by replacing blade and using it (saving taunt for disengage) if you didn’t end up getting lvl 2 first. Keep trading this way throughout the lane, and only taunt in if you’re sure you win the all-in (if he’s low or you’re up a lvl and you’re too close for him to reliably react with his spell shield to your taunt). Use your W early on in the trades, and keep him from healing up too much with his passive by trading often (but short). ",
      "Ornn": "Place blade. Punish with dragthrough-trade (2-3 Emp Q’s) if he tries to touch the wave (to push or to lasthit) then drop aggro. It’s important not to overpush, and take a sizable chunk of his HP (for not much of your own) every time you decide to trade since trading means you’ll take minion aggro and push faster automatically. Get the lvl 2 all-in, and if he respects it and you’re not pushing too hard yet, try to see if you can zone some XP from him while he’s still lvl 1 (assuming the 2nd wave has already properly aggro’d onto your wave, since you dont wanna take its aggro).<br>Try to sidestep his Q’s, and if he has W, either sidestep it, or have W ready to block the brittle hit after it hits you. If he’s lvl 3+ and throws out a Q, always consider if he has an angle to E-knockup trade you, and respect it by standing a little bit away from the pillar if so. Only taunt in lvl 6+ if you have a solid reason why he can’t all-in you with R (like he’s low, or you’re getting a gank, or you’re mega-ahead).",
      "Poppy": "Place the blade before lane. Don’t ruin your blade to Q her passive unless you’re close enough to her to be confident you can get minimum 1 emp on her for it. Then keep replacing the blade and trading on her with Emp Q’s every time she tries to normal-auto your wave (you can’t stop her from getting some lasthits with her passive once in a while). If she’s giving up prio, then just make sure you’ll hit lvl 2 slightly before her, and go for the taunt the moment you hit 2 first. If you’re both lvl 2, it can still be fine to taunt in as long as you’re confident she won’t have W and react in time (if you stand close to her she can’t). Same logic for all your later lane-taunts too, don’t be scared to throw it out if you’re close to her, you don’t have to wait for her to waste her W. Don’t stand close to walls when she has E, and try to constantly bait out her Q’s and trade when they’re on CD. ",
      "Qiyana": "Place blade, take short Emp Q trades if she tries to hit minions, and be ready to rush forwards when you’re about to hit lvl 2 first. For when she’s lvl2+, remember that if you taunt her from max range, she’ll be able to go invis before the taunt hits and then she’s locked out of Auto’ing (in invis!) during your taunt, which screws your whole trade pattern. So only taunt when you’re close enough for her not to react and you should win it. Be careful of standing close to walls lvl 6+.",
      "Singled": "Place blade and stop him from getting to proxy lvl 1. Then punish him with Emp Q’s if he tries to poison the wave, and secure the push. Keep slowpushing (don’t hardpush) him in and chunking him until he’s dead. Snowball normally, but keep extra attention on not missing the FIRST good recall you get, so you don’t let him get tempo on you, clear a wave and start proxying while you’re on your way to lane. If you do this, it’s a good matchup, but if he ever gets into a proxy position and your jungler isnt around to bail you out, it’s a terrible one.",
      "Sion": "Place blade lvl 1. Sion’s often start in lane bush and charge their Q on your first 3 melee minions, don’t let him hit you with it too from fog. If he starts W; just get the dragthrough to apply your passive and start hitting him. If he doesn’t get the pop-dmg because you kill the shield that’s good for your wave control. Then replace the blade, and play for short trades when Q/passive back up. Try to bait out his Q’s throughout the lane and sidestep them. If you do, there's a way longer CD than if you cancel them with your taunt. But if you end up in a position where you can’t run out of it, then it’s better to taunt forwards to cancel it, and insta run back and respect after 2 Emp Q’s (before he gets it back). Make sure you kill him in a position where you have a way out and don’t die to his passive. <br> This is true in any matchup, but especially for Sion, DO NOT take even-ish trades and set up a kill where you’re gonna escape with super low HP after the kill if he has TP. Then it’s a worth death for him since you’ll be stuck in lane with low HP forever and he freescales, or you take a terrible back which results in the same. It’s better to let him live for an extra minute while staying healthy yourself, and then getting a kill later on where you’re healthy enough to keep laning after he TPs back.",
      "Viktor": "Try to find him around 1:05-1:25 in some toplane bush and start E if you do find him and chunk him. If you don’t find him, start Q and try to push the wave and deny his Q-auto poke with your passive. Use bushes to drop in and out of vision between hitting minions. If you’re about to get lvl 2 first, place yourself in range to go for the taunt the moment you hit lvl 2. But even when you’re the same lvls (2-5) you can win trades as long as you land the taunt, and don’t stand to get stunned in his W. He’s also an easy gank. Take approach Velocity in runes if you wanna have even more 1v1 kill pressure.",
      "Volibear": "Trade lvl 1 with Emp Q’s while keeping track of how close he is to having his passive fully stacked. If he takes 3 Emp Q’s to the face without trading back since he’s trying to stack up his passive on the wave, then you can temporarily give him the push in exchange for that HP. If he tries to trade back on you, you should still win out on the trade (not as hard) while also being able to fight for lvl 2 first. If you get 2 first, then go for the taunt once you hit it. Lv 3+ you can easily win short trades using Emp Q’s + block his Q with your W and save your taunt for disengage if it’s needed.",
      "Yasuo": "Place the blade and use your range to atk him with 1-2 Emp Q’s when he goes for a lasthit and try to get lvl 2 first for the all-in. Once you hit lvl 3, you can start winning slightly longer (but not full all-ins) trades using your W to deny dmg until you’ve used all 3 Emp Qs while keeping your E for disengage if need be. Once he gets low and you wanna finish him off but he’s dashing around everywhere, a tip to hit your taunt is to look at which minion is the obvious “dash-target”, and once he starts that E you can just instantly taunt the spot he’s gonna arrive at.",
      "Yone": "Slowpush lvl 1. Start a trade onto him if he uses Q to CS before it’s up again. Another option is to first place the blade behind him, and then use the dragthrough the moment you walk up to let him Q you. Then you can block his dmg with your passive + trade back well. All-in lvl 2 if you manage to get 2 first. The only Yone Q’s in this matchup you can’t allow to hit are the 3rd Q’s, so learn how long the exact reach is and stay out of it when it’s up. After lvl 3 you can just taunt him every time his 3rd Q is used up, use W and atk him 3 times with Emp Q’s and then disengage (he will poke you a bit on the way out but not enough to make the trade worth for him). Repeat this process until you can commit for a kill.",
      "Yorick": "Place the blade up and get the slowpush. Make sure you don’t push too hard if Yorick is playing far back, since he just wants to farm under tower and you wanna force trades. Punish him aggressively anytime he tries to walk up, he’s only allowed to farm with his ranged ability. Try to get in range to taunt the moment you reach lvl 2. If you manage to take him pretty low but not quite kill him by the time your push crashes into tower, then remember that Yorick is one of the easiest champs to do the “Towercrash taunt” to (where you walk up, get the dragthrough, then Auto once and insta taunt outside of tower and then turn back for 1 last Emp Q. He’ll also take minion dmg.). He’s an easy gank if your jungler comes."
    },
    "Okay": {
      "Cassio": "Start E and unless she’s deep in her own wave, taunt her for an extended trade. Then when she’s lower, you should have decent access to the wave to force lvl 2 first and look for all-in. For trades past lvl 2, look to bait out her Q’s by stepping barely in range and then out, and walk up and look to see if you can taunt while it’s on CD. Remember lvl3+ that if you land a taunt, she’s gonna mostly be spamming W when she gets out of the CC, so move away the moment the taunt ends to not get stuck. She’s an easy gank, so ping your jungler you got flash ready if he’s close and it looks promising",
      "Gragas": "You should be able to simply force trades in this matchup at every early lvl (1-5). Since he can interrupt your taunt with his E, you want to just trade with Q's until he uses it, or if you're close enough you know he won't be able to react to the taunt. One special thing to keep in mind is that if he E's you past lvl 3, then try to instantly press Q-W, to deny his W auto  while you're CC'd, and then keep kiting/trading him. When he gets to lost chapter the lane goes from easy to instantly hard, so you need to play early confident but also not overaggressive, since one bad death makes it impossible to trade into him for the rest of the game.",
      "Gwen": "Place blade. During lvl 1 you want to trade her once before she’s closing in on 4 stacks. As long as you time your passive well and her Q isn’t the empowered one, you’re fine taking the full thing with your passive and attack her 2-3 times with Emp Q’s. Then replace blade and attack maybe once while doing it. If she starts E instead of Q, still trade aggro, but be sure to start off the trade from 75 range and kite backwards so she won’t get a full all-in without taking too much minion dmg. In general, try to start trades if she isn’t stacked up by taunting in, and if she’s fully stacked, try to bait it out, or try to time the taunt through her to dodge the full dmg. You want to start trades consistently on your terms, or she’s going to eventually poke you down when you try to CS. After 6 when she has R, never taunt in unless she’s low enough for you to oneshot during the taunt, but you can still take short trades and taunt backwards if you’re kind of close to your tower.",
      "Illaoi": "Trade Lvl 1 with emp Q’s, then get the slowpush and look for lvl 2 all-in. When she gets her E ability, make sure to hide behind your wave and start trades through minions while she’s farming. You win trades early as long as you’re the one pushing her in, but if you get pushed under your tower there’s no way to win trades unless you literally dodge every single E which is unrealistic. Aim to kill her lvl 3 and create a freeze after your first recall.",
      "Irelia": "Place your blade up the lane lvl 1 and be ready to punish with a dragthrough if she ever Q’s a low minion of yours. With the passive stacked up she can just chop you down and kill you, but if you constantly make sure to punish once she starts stacking it, it will cost her too much of her HP to get to that fully stacked point. Lvl 2 all-in as always. If you play the first 2 levels correctly it then shouldn’t matter even if you fail to dodge one of her stuns, since she won’t be able to all in you from it anyway through your XP lead (you’re either lvl 3 already or soon to be). Remember that her E is kinda clunky and hard to hit if you move back and forth in random patterns. If you ever dodge an E, be ready to punish. Be careful of her Lvl 6 insta-all-in, so keep track of how the XP situation between you two should be when you’re both lvl 5.",
      "Jayce": "Start Q lvl 1 and see how he plays it. Auto attack the enemy wave as much as he allows you to. If he isn’t ready to punish you, you can get the push before he realizes what’s happening, and then you can keep it up by sneaking in more autos on minions while he’s busy trying to recover the push. Then you go for the lvl 2 all-in taunt once you hit 2. If Jayce is ready to stop you from hitting wave lvl 1, then just conserve HP, don’t miss XP and get whatever CS you feel you can while staying near full health. Then look for taunts when you’re either both lvl 2 or lvl 3 (lvl 3 you win hard if you land it, lvl 2 you should still win, but not as hard). Make sure to constantly use your minions as a wall to his Q or Q-E in lane, and often stay on the edge of your taunt range to not telegraph it to him when you’re actually gonna throw it out. After having landed a taunt, remember he’s soon gonna use the hammer knock-back, so if you’re MUCH healthier and he can’t kill you even in an all-in, kite and position yourself between him and his tower so he can’t disengage with it. And if he’s healthy enough to where you don’t wanna extend the trade more, kite towards your own tower so he’ll knock you to safety if he uses it. He’s also very vulnerable to ganks.",
      "Karma": "If you find her around 1:00-1:30 not close to minions, start E and go for a long trade. If you can’t find an early taunt, start Q instead and contest the push while trying to dodge her Q dmg. You wanna avoid being pushed under tower. It’s possible to taunt Karma for some empowered Autos, but she will trade back heavily onto you when you run away. But even if it feels futile when she keeps healing up, it’s worth it to take even trades so you’re both kinda low around the same HP, because then your all-in will be able to insta-burst her with a taunt-flash before she gets to heal up once she gets low enough. If you’re losing early trades, then try to conserve HP for an R at lvl 6.",
      "Kaynwithsmite": "The scariest version of Kayn top is the one that goes full cheese mode and takes smite to screw with your jungler 24/7. Then you just gotta realize which times you can follow based on reading your wavestates. If it’s slow pushing away from you when he roams, you gotta fix your wave before following. If it’s slow pushing towards you, you usually have a window to follow as long as you get back to top in time to catch the wave before tower kills it.",
      "LeeSin": "lvl 1 is a bit scary with his E slow + passive + Conq, so never let him extend the trade lvl 1. Try to get the slowpush still, while only taking 1 auto trades using your extra range. Lvl 3 is when you start winning the short trades really hard if you get a dragthrough and use W early (saving E to taunt out), but lvl 2 is do-able too. Never taunt forward unless you got lvl advantage (or he’s already low). Stay behind your minions during trades as much as possible to deny him free Q’s. Be patient but not scared, if you overforce it will backfire, but you also want to grow your lead lvls 3-5.",
      "Lucian": "You can try to sneak a lvl 2 first by hitting minions lvl 1, but if he’s appropriately aggressive, then just sit back (using bushes) and let him push while conserving HP. Never miss any XP and keep yourself 80%hp or more. Then we can trade by taunting in at lvl 3+ if he ever dashes forward to poke. Avoid getting close to him every time his double-shot is available. He’ll only have really scary dmg if he uses his E to chase after you, but that’s also when you have your chance to land a free taunt. If he never E’s onto you, then just farm and deny poke with passive + W when necessary. He’s also extremely gankable, and if he ever dies to 1 gank he’ll die to the next 2 ganks too.",
      "Renekton": "Place the blade lvl 1. Don’t let him stack up rage for free when he comes into lane, and start punishing him with Emp Q’s, you should win trades decently hard lvl 1. Then replace blade and wait CDs, and try to get 1 more trade in before he gets 2. Because of his OP waveclear with Q, you might not get him low quickly enough to take back the push in order to hit lvl 2 first. If that’s the case, then respect him lvl 2 so he can’t all-in you during that window. If you’re both lvl 2 and he’s lower then try to get the dragthrough best you can WITHOUT E’ing, so you can disengage (or chase him down if it’s clear he’s dying) after you’ve gotten your 3 Emp Q’s off. <br> For trades later on (when you’re both lvl 3+), don’t try to save your W for a “perfect moment” later in the trade, that will just often lead to you getting stunned on accident in the start of the trade. Instead just use it the first thing you do (without overlapping it with passive) and disengage before he gets to even use his W. Keep the trades short this way until he’s killable.",
      "Rengar": "Since he sits in the bush except when he lasthits a minion or jumps on you, your only window to take good trades is when you know he’s gonna jump for a lasthit. Until then just position on the side of the lane towards the river (away from the bushes), and then stand just out of range of the bush but close enough to your dying minion to use the dragthrough once he jumps out. Start by hitting him with at least 2 Emp Qs and then backing off out of his range if he tries to get back into the bush. Be wary of him when he has full or close to full ferocity stacks, and trade more when his bar is low or empty. Lvl 3+ you wanna deny his Q’s with your W and taunt out (through him if possible) if he tries to extend the trade. Once he’s much lower than you, you can just taunt in for the kill (especially if you have ignite).",
      "Riven": "Place the blade lvl 1 before lane. Then when minions arrive, you do wanna try to dragthrough and hit her once she tries to get the push, but be ready to kite backwards instantly after hitting her from 75 extra range, so she has to use 1-2 Q’s to catch up, and not be able to deal Max dmg with auto’s weaved in (your position when you start this first trade is key, stand right behind your melees, not infront of them, or she’ll be way more scary). If you force her to trade inside your wave like this, then she doesn’t have the dmg to 100 to 0 you, so she’ll be forced to disengage while the trade still favors you. This trading pattern is true throughout the lane later as well. Kite back after 1 emp Q and only once she’s poked down a bit you can think about taunting in aggressively (often in the situation when she’s poked AND you have 1-2 leftover Emp Q’s in order to do a 4-5 Emp Q in a row trade). Use W early in trades so if she presses her W you’ll be protected, so she can’t find a good short trade and E out.<br> Never taunt forward unless you have a good reason why it won’t backfire on you in an extended trade after your Q’s are gone.",
      "Rumble": "Place the blade lvl 1 before lane. If he starts Q, once he uses it use your dragthrough and walk into him and start hitting. If he keeps hitting you with his entire Q he’s gonna lose since you have passive to block some of it, and more dmg in a short trade, while if he turns away his Q dmg on you is reduced. If he starts E, then hide behind your minions, and let him lasthit whatever he wants with his E’s, but be ready to punish him with a dragthrough the moment he tries to hit or lasthit your minions with a normal auto. Fight for lvl 2 this way by either trading his HP down and eventually forcing him off the wave, or by just threatening him off the wave to the point where you get lvl 2 automatically. Be ready to all-in the moment you hit lvl 2, and once it becomes clear it’s already slowpushing into the rumble, then don’t overpush, since you wanna maximize your trade window before your wave crashes into his tower. Only taunt in aggressively if you have a lvl lead or rumble is already way lower than you. Don’t underestimate his overheat-dmg, so be very respectful unless you have W ready or can oneshot him before it starts popping off.",
      "Smolder": "Try to find him around 1:05-1:25 in a toplane bush, if you do, start E and take an extended trade until he’s low. If you find this trade, you can easily control the wave to hit lvl 2 first when he doesn’t have his Flap-Flap ability yet and kill him. If you don’t find the lvl 1 cheese in a bush, start Q and try to match the push best you can while blocking his poke with passive and going in and out of bushes a lot. If he over-focuses on poking you, you can get lvl 2 first to taunt in (even if you’re slightly poked by that point you still crush if he’s still lvl 1). If he focuses on matching the push without poking you just keep pushing as much as you can and look for taunts when you’re confident you’ll hit them lvl 2-3. If you take the Approach Velocity rune it’s okay to miss the taunt since you place the blade far up in prep for the approach-speedup for the next Q. If you’re close to him when you apply the Approach velocity speedup, then you can hit the taunt when he’s mid Flap, but it’s also fine to force out his Flap-Flap with the approach, to then move back and forth and look for a taunt when it’s on CD.",
      "TahmKench": "This matchup is all based around you trying to poke him with Emp Q’s using your extra range while staying right behind your melee minions so he can’t Q you back. Poke him a little at a time, and look to replace your blade, and don’t chase after him for all 3 Emp Q’s. If you only give him limited amounts of chances to press Q on you, then it’s also easier to sidestep them. Every time you dodge a Q that gives you full freedom to replace your blade position for the next trade. When he gets 2 stacks on you, make sure you don’t prolong the trade unless you’re 100% sure you can hide behind your minions so he can’t Q you with full stacks for the stun. Taunt in only once he’s getting to 50-60% HP from short trades (or you have a lvl adv)",
      "Trundle": "Place the blade and take short trades using your extra range without letting him extend it into an all-in lvl 1 (kite backwards between autos if he tries to chase you into your wave). If you manage to win some early trades, then try to zone him away from the wave so you can get lvl 2 first and go for the classic all-in. The way Trundle trades is very distinct and easy to predict and play around. He's gonna start with Q'ing you, so just make sure you either block it with your passive shield or your W. Never taunt in first unless you’re up a lvl or the HP difference is big enough so that you know you can easily kill him if he tries to fight. Post 6 we keep sticking to the short trade pattern, and remember that unless he’s in literal oneshot-able HP, his R healing will make him win the fight if you taunt forward.",
      "Vayne": "Try to find her in toplane bushes pre-minions around 1:05-1:25 and start E and fight her if you do. If you can’t find her early and she walks to lane protecting her wave, then you can either: <br>-play it the safe way and start Q and take whatever CS you can without losing much HP (focus on getting all XP and staying 80%+ until lvl 3). <br>-Start E anyway and try to hit a taunt and kite into bushes after hitting her 2-3 times <br>Then post lvl 3, try to find taunt angles using good mindgames and movement. If you don’t make it obvious when you’re trying to taunt in, then it’s actually quite hard for Vayne’s to properly reach with E to cancel your taunt. And if they E you away after the taunt duration is over, you’ve gotten enough dmg to make it worth it, and you can just disengage (or if she’s low and you’re healthy, just stay between her and her tower so she’s still in danger even if she E’s). A lot of vayne’s will use their Q’s all the time to poke better, which opens them up to more taunts. If you’re playing vs a vayne who’s always staying at safe range with Q still up, then just conserve HP, and her poke won’t be super scary. She’s also super squishy to ganks."
    },
    "Hard": {
      "Aatrox": "Place blade lvl 1, then trade with Emp Q if she tries to auto any CS. Try to get the passive to block her first Q if you can, but it’s not necessary to win. You should be able to either hit the taunt lvl 2 zone her from a bit of XP before the 3rd minion wave arrives. Lvl3+, remember that her W has a 2s longer CD than your E, so if you force it in a trade, try to position to taunt the instant it comes up for a hard-winning trade. Try to move in ways to bait out her E and sidestep it if you can, then trade aggro while it’s on CD. Respect the lvl 6 all-in if you don’t already have a big lead by that point.",
      "Fiora": "Base your movement on where the current Vital is on you. Your best way to start a trade is to be able to get a dragthrough at the same time she dashes in for a vital and block her dmg with your passive that will proc, and then trade back with at least 1, hopefully 2 Emp Q’s (use your leftover Q’s if the opportunity comes up). The 2 times you can use taunt aggressively in this matchup is if Fiora has used her W already OR she’s close enough to you that you’re confident she won't be able to react with her W in time. I recommend playing this matchup aggressively and limit test taunting in even when she has Q up, to learn when Fioras are able to react or not. If you don’t make it obvious you’re looking for a taunt with your movements, you can often win the mindgame, which can be a gamebreaker.",
      "Gangplank": "GPs like hiding with a barrel in the lanebush at start of lane, so hover towards river if he’s not showing yet and start pushing. If he’s showing, try to get the push while figuring out if he has Q or E start. If he has Q start, try blocking his Q’s with your passive shield and push for lvl 2 first. If he has E start, try to trade aggressively to keep him from freely wave clearing. If you manage to get lvl 2 first, go in with taunt. Otherwise just block his Q’s with your passive or W, and keep your HP high. Lvl 3-5, if he’s sitting on a 1 hp barrel, try to land a taunt and hit the barrel first while he’s W’ing, then trade with W and then walk out. If you’re ever getting pushed in and feel like you can’t taunt in, then only let him Q you when your passive or W is up, and otherwise stand barely outside his Q range.",
      "Graves": "Graves is tanky for a ranged champ and his splash dmg makes it hard to control the wave. Use your passive and W to keep yourself topped off. He can generally not punish you too hard if your taunt is available, so only use taunt if you’re sure the trade is winning (because he wasted some key spells or he stepped into your full wave or you’re setting up for a gank). Basically play passive and wait for enemy mistakes.",
      "Heimerdinger": "You can’t contest the push nor taunt into his turrets, so just sit back and conserve your HP until either he walks away from all his towers (and you’re the same lvl), then we can taunt. The other option is to taunt him under your tower or wait for a gank. The only saving grace is that your W blocks his turret auto’s, which can be helpful to survive. The main thing to try to dodge is his E. If you’re forced to go close to him to farm under your tower or for some other reason, focus on predicting when he’ll try to stun you with E, and dodge it. If you manage this, his dmg isn’t that high. If you survive the lane until 6 without getting super low or having to use TP to lane (hard but can sometimes be do-able), then you have a free R to bot lane, where you can recall and TP back to lane after.",
      "Kennen": "If you find him in the window where he doesn’t have time to recall anymore (1:10-1:30) and he feels tauntable, start E and chunk him to half and wait for E again and play aggro. If you can’t find him, you *can* still start E and play to space better than him, but if you miss it you’re kinda screwed. You can also start Q, but then it’s very hard to win lane early, and you just accept being pushed in and keep your HP high. This matchup comes down to if you can catch Kennen unaware with your taunts or not, since if you’re predictable he can always use the movement speed from E to outrun the taunt. But if you ever get a taunt on him you hardwin the trade, especially since they will often press E right before being hit and put it on CD for when the taunt ends. If your jungler is topside, ping your flash is ready and be ready to go in with taunt-flash the moment your jungler is in range to follow-up. Kennen’s very squishy to ganks.",
      "Olaf": "Get early to lane to place the blade. Then if he doesn’t come to lane with his minions, start auto-attacking the melees the moment they arrive to clash with your wave. In most matchups, this would be overpushing, but vs stuff like Olaf who has a ton of both waveclear and lvl 1 all-in potential, it makes things easier. If he arrives in time to protect his minions, then instead stand behind your melees and try for a dragthrough-auto when he tries to hit your minions. But be SUPER ready to kite back after the first auto before he can start a favorable all-in on you. If he has to chase you into your full wave, and he’s already poked from your first auto, he will struggle to 1-shot you (especially if you’re running ignite). Also try to see if you can sidestep/predict his Q-throw, then it’s hardwinning. <br> Playing it this way is slightly risky, but if it works out and you get a chunk or 2 off of him for free, then you can secure lvl 2 first and crush the matchup from there. If you don’t feel confident in your movement you can also just give up push lvl 1-2 and get all XP and whatever farm you can while avoiding his all-in, and start trading lvl 3+ with dragthrough+W and saving E for disengage. The scariest thing in this matchup is if he gets to freeze the wave in front of his tower lvl 4+ and can all-in you any time you go for a minion. So value your HP VERY highly if there might be a lanestate like that in the near future, and ping your jungler to help you if there’s no other way. Don’t taunt forward in this matchup unless you’re absolutely sure you can oneshot him (or you’re basically at your tower), since his lifesteal/shield combo is crazy when he gets low and you’re out of spells.",
      "Quinn": "Try to survive and stay healthy best you can lvl 1-2, using your shield to farm. Lvl 3+ you can try to catch her off-guard with a taunt, and hope she doesn’t cancel it in time, if you do that’s a huge win trade-wise, and if she does react in time you usually get out just fine if you have passive+W and just run away (only be careful to do this on her side of the lane, since your tower is so far away in that case). And if she’s a player who aggressively uses E to poke instead of waiting for you to taunt, then of course punish her by taunting in while he’s E is on CD. If she keeps pushing you under tower, you can try to taunt-flash her when she’s in towerrange AND your tower is about to attack. If you then keep yourself positioned behind her, she’ll have to eventually flash into E to escape while being low (because if she E’s you she’ll fly into your tower). She’s also very vulnerable to ganks if you have flash up. She scales pretty poorly unless she manages to snowball herself. Remember to danger-ping your midlaner if she’s lvl 6+ and goes missing. She’s fast af.",
      "Teemo": "Try to see if you can find him lvl 1 before minions come at around 1:05-1:20 (hard since he’s probably invis somewhere but you can try). If you do, then start E and all-in him. If you don’t find him, then start Q and see if he’s late to lane. If he is, then permahit minions for an easier time getting lvl 2 first. If he starts in lane, you can’t do that, so just conserve HP and let him push you in, and wait for lvls. <br>The hard thing with trading into teemo is his low Q CD, since he might get 2 Q’s in a single all-in. So you can only taunt in when you’re either:<br>-Up a lvl<br>-Under tower<br>-He’s kind of close to bushes so you can kite in there afterwards and drop vision<br>-Getting a gank<br>-He’s using his Q to poke you<br>-He’s already chunked (to 60% HP or less)<br>If none of these things are true you’re just gonna lose even if you land the taunt, so just wait for ganks otherwise.",
      "Udyr": "Have a similar mindset as if you’re playing vs a Warwick top, in that you can win all short trades if you have your blade placed and your defensive abilities up, but you can never create and truly push an advantage unless the enemy makes a mistake, and you’re gonna have it backfire if you ever taunt in (unless you’re up a lvl).<br> For lvl 1, after having placed your blade, try to hit his wave 4-6 times as soon as it leaves his towerrange if he’s not there to punish it. If you’re allowed to do that, then you can take pretty aggro trades lvl 1 even if they turn out pretty even (which is usually bad), since you’ll have lvl 2 first. If he walks with the wave lvl 1, then just be ready to give up push and take really short trades without truly committing, since his snowstorm (R-R) will chase you down after you think the trade is over. Keep playing the first levels with super short trades only when you have passive/W to deny any kind of tradeback, since there’s no point taking trades to where you’re 60% and the Udyr is 20% since his healing is kinda crazy (and he’s amazing at barely staying alive through your kill-burst with his empowered W). He’s pretty gankable early if you take a few good short trades (without taunting in), so trade based on how close/far your jungler is more than in other matchups.",
      "Vladimir": "I AM HERE<br>Try to find him in the toplane bushes (river, tri, lane) around 1:05-1:25 and start E if you do and chunk him. If you manage that you can keep E’ing him on CD in the wave until he’s dead or forced to recall. If you don’t find him, start Q and match his push and try to get lvl 2 first while taking minimum poke using bushes/passive. If you do, taunt the moment you hit 2. Try to find chances to taunt throughout the lane where he doesn’t have his Q-bar fully stacked, and if he pools it, then try to abuse the 10 sec window where your E (18s CD) is back up but his pool (28s CD) isn’t.<br>Try to push with Q early on so it pushes slowly into him while blocking his Q’s with your passive shield. If you managed to push faster, then walk up to him right before you hit lvl 2 and instantly taunt in when you hit 2 for a trade. If he picks E lvl 2 keep punishing him. Once he has his pool it’s all about forcing him to use it by taunting in for a trade, and then using the long pool CD of 28 seconds to taunt in again once your taunt’s up again. Position the blade up the lane between the taunts, so you can get the initial slow with Q.",
      "Warwick": "Warwick top completely revolves around getting low and then baiting the enemy to all-in him and be surprised by how much he can heal. Therefore, just place your blade behind the enemy wave and look for dragthrough short trades and poke him down overtime. And then when you vs any other champ would taunt in for the kill, vs WW you just keep playing the same way you would if he had full HP UNTIL he’s low enough that you can 1-shot him inside the taunt, then just taunt-flash on top of him before he gets to heal anything. Remember to respect Barrier and count that into your calculations before you decide to flash in aggressively (if he has it). "
    },
    "VeryHard": {
      "Akshan": "In most ranged matchups you can start E and try to find them in a bush before minions arrive, don’t do this vs Akshan. His double auto attack is too strong early. Start Q and let him control the wave and push you in. Take whatever lasthits you can using passive/bushes to reduce his poke, but also be willing to give up a lot of lasthits in order to keep yourself healthy. Only taunt in when either: <br> -You’re getting a gank from your jungler <br> -Akshan E’d forwards and you’re still healthy <br> -You’re lvl 3+ and he’s close to or under your tower (so you can keep the trade short and get to safety) <br> Akshan is generally very reliant on getting early kills and snowballing, so keep mental up and remember your main goal is to survive and be ready to punish him when he gets impatient or screws up.",
      "Aurora": "-Dodging <br>-4 sec diff between your taunt / her W <br> -with D-shield/2nd wind you can regen up if you both get low <br> -lvl 1-2 stay safe, lvl 3+ trade if you’re not poked by then (or lvl 2 if you dodge a Q) <br> -Setup for ganks <br> -Small cast time for her E",
      "Kalista": "Lvl 1 Kalista is complete bullshit. If she’s playing in your face you might have to give even XP initially but try to get whatever XP you can while staying healthy. If you manage to keep up in XP and not get low, then lvl3+ you can win all-ins if you land the taunt. But if you’re behind in XP or low the only thing you can do is wait for your jungler. The main reason Kalista top isn’t picked a lot is because she dies to every gank and will be out of the game once she dies to 2+ ganks.",
      "Neeko": "I don’t really know how to deal with this matchup tbh. Her W and E are really good to deny you from taunting in for trades, and her poke is really strong. And she runs away from ganks with W super quick and roots the jungler with E. I think the best thing you can do it just to try your best to farm while staying as healthy as you can (gl) and hope she makes a mistake under tower and opens herself up for a taunt. If not, then just accept the lost lane and try to help other lanes out with R. If you do manage to hit a taunt while she’s pressing E, that’s the only window where it can be possible to win a trade, but if you miss the taunt you’ll get punished hard for it, so proceed with caution. <br><b>Outplays you can try:<b>  <br>-Start E lvl 1, and try to taunt into her the moment she stands still to use her Q/E. (optimally where she’s not inside her full wave so you can quickly drop aggro after 3-4 autos) <br>-During the whole lane, try to bait out E uses from her with aggro movement into sidesteps, and then use the time where it’s CD to fish for taunts.",
      "Sett": "Place the blade pre-lane, and also try to see if he’s not protecting his wave as it leaves the enemy tower range. If so, get the push lvl 1 by hitting it 4-5 times with normal auto’s (keep your Q). If you get the push you can look for trades like in any other melee matchup and eventually look for the lvl 2 all-in. If he starts in lane and you can’t get the push in your favor, then just accept him getting to push you in and take whatever CS you can and conserve your HP and play for Rs at lvl 6. His W has a very long CD early on, keep this in mind and abuse it if he ever wastes it. His passive not only helps him push but is really strong for trading if the trade gets extended, so make sure you either have a way to disengage or to be in a position to kill him at all times when going for trades."
    },
    "Challenging": {
      "Darius": "At the start of the game, place the blade up the lane without going close to any bushes, he might try to ghost+W all-in you, so don’t place it TOO far up. When the wave arrives, take a short trade when he hits your wave with emp Q, but focus on figuring out if he has W or Q start. If he starts Q, try to close in on him to deny the heal and auto 3 times and back out. His All-in potential is really weak lvl 1 with Q, so no need to be scared of that. If he starts W instead, his short trade is bad, but all-in strong, so don’t go up too far for the trade, but stay inside your wave when you start the short trade. If the first trade goes well HP-wise for you, try to contest for push. Otherwise, let him push and wait for lvl 3 while respecting him.Your #1 Priority in this matchup is to never get hit by his Edge-Q. Either make sure you’re out of range of his full Q or make sure to move close to him so he doesn’t get the heal part. Try to sneak the lvl 1 push in your favor, but if he doesn’t let you (as he should), then let him push you in and wait for lvl 3 while conserving HP. Always W his W. Look for good shorttrades, and once he’s 60% or below (and you’re healthier), wait for him to press Q, then taunt him so he doesn’t get the Heal part and dragthrough and all-in, you win it.",
      "Gnar": "Start E, and try to find him around 1 min or later, but before minions have arrived and try to hit a taunt and hit him a bunch. You win the all in and should be able to get him to 40% and then back off once he gets to his tower (always use bushes to keep him from chasing you, he only has 1 trinket). If he starts E lvl 1 and jumps the taunt it won’t punish you too hard, and your E has a few seconds lower CD than his E, so try to taunt the moment it’s back up if he lets you. If he doesn’t let you taunt him pre-minions, you can still look for it if he walks up to poke, but if not, just hit minions and try to contest for lvl 2 and see how he plays it. Later on, start fights either when his rage bar is low or optimally right when he turns from big to small. If you fight him while he’s in he’s in big form, try to bait out his W and sidestep it (most Gnars are gonna be spamming W if they’re taunted, so you can time a sidestep quite predictably), then you can trade more freely after that (unless he has R and you’re close to a wall).",
      "Pantheon": "This is one of the champs that are strong enough lvl 1 that you can’t get lvl 2 first unless he screws up somehow. But try to get it anyway by getting to lane early, place blade, and check if you’re allowed to hit the enemy wave when it comes in 3-5 times if he’s late to lane. If that’s the case you can play normally and trade dragthrough for some Q’s on you and then play for the lvl 2 all-in. If you’re not allowed to hit the wave for free, then just prioritize keeping your HP high, and let him have the push and respect his lvl 2 all-in. When you’re lvl 3 eventually, THEN you can look for short trades (potentially by taunting in if you’re close enough to your tower to disengage relatively quick). <br> Mechanic-wise: Assume he will be spamming E when he gets out of a taunt, so even predict that and run sideways when it ends to get around him (or away if that’s an option). Also if he’s looking to W you (while he doesnt have a lvl lead), then you can let it happen but press Q+W as he’s in the air (doable if you’re prepared for it). After lvl 6, it’s usually fine if he goes to roam with R if you have yours to respond, since your R is better and more adaptable in a fight.",
      "Ryze": "Sneak around and try to find him in a bush at 1:05-1:25, if you find him start E and all-in him, which should take him to 30-50% before he gets away to tower. If you don’t find him and he walks into lane with his wave, start Q instead and try to cheese the push by hitting a bunch if he’s not hitting you for every time you hit his minions. If he does, then be a little bit more conservative with your pushing and mainly use your passive to hit and stay healthy. At lvl 2 (preferably while he’s still lvl 1, but also okay if he’s lvl 2 as long as you’re close to full HP) just try to land a taunt on him and get the dragthrough, trade, and then run to drop aggro into a bush (if he wards it, just run to the next bush). Keep trying throughout the early lane (pre first recall) to land taunts and see if you can solokill him. If you get an early lead and a good first recall, then keep playing aggro and taunt in a lot (while warding for jungler), while if you didn’t get an early lead, then transition to playing to stay high HP and play for R’s unless your jungler is coming top.",
      "Tryndamere": "NOTE: Needs to be updated a bit, i'm honestly not sure how the lvl 1 goes since i haven't played the matchup enough since it got way harder Here you wanna abuse him every time where he’s not stacked up his rage-bar yet, starting level 1. Place your blade up the lane and pummel him with Emp Q’s when he goes for a CS abusing your superior range. Don’t let him start auto’ing you a bunch without even having to E, then he can ghost and chase you down lvl 1 since you have no taunt yet. So lvl 1 is the scariest part of this matchup. Lvl 2 it should be impossible to die to him since you got taunt for disengage if needed, just keep shorttrading (or go for all-in if he’s still lvl 1). Lvl 3-5 is where you win the shorttrades the hardest. Just position the blade, sit on your minions and trade with Emp. Q’s anytime he walks up to touch your minions and use your W early if he tries to hit you. If he tries to extend the trade by E’ing into you, then just deny him that with a disengaging taunt. He’ll lose trades so hard he can’t even close to heal back up. Once again, never taunt in first unless he’s in oneshot-able HP.",
      "Urgot": "Urgot’s lvl 1 is super scary, if he ever hits E onto you you’ll lose 60% of your HP or more, so just play defensively and get whatever CS you can. If Urgot plays passive lv 1 we can try to use that by sneaking in a couple of autos on minions and hitting lvl 2 first and taunting in, but if Urgot plays properly you have to let him push you in early while waiting for lvl 3. Urgot can’t really force onto you unless you make a mistake, but you also can’t really force any good trades unless you manage to dodge his E. One way of potentially winning trades is to hit a taunt + dragthrough, start hitting him, and then the moment your taunt is ending you sidestep preemptively. Most Urgots will be spamming their E while CC’d and your sidestep will dodge it since it has a quite considerable cast time. But if he wins the mind game it will backfire on you, so keep that in mind. (if you don’t wanna take any risks then just pick TP and farm safely until lvl 6) <br><b>ALTERNATIVE WAY OF PLAYING IT:</b> <br>Assume you’re the better player, and move with the idea of baiting out his E and dodging it, even from lvl 1. If you do dodge the first E, you can snowball pretty well from there. But if you do get it it’s pretty RIP, it's up to you how much confidence (or overconfidence?) you have, soldier"
    }
  },
  "about": {
    "text": "This is a simple single-page website."
  },
  "footer": {
    "copyright": "©"
  }
}