{
  "title": "Estratégias para o Shen",
  "statisticshen": "Estatísticas",
  "formula_dano": "Dano Reduzido (%) = (Resistência / (Resistência + 100)) * 100",
  "formuladescricao": "Então como em alguns outros jogos existe um softcap em 200 e o hardcap em 350. Esse é o intervalo que você que quer ficar, mais que isso é disperdicio. Pois o HP será mais valioso.",
  "formuladescricao2": "Lembre-se, caso o time inimigo errar e compor o time feito totalmente de um unico tipo de dano, então sinta-se livre para fazer qualquer coisa diferente ao atingir o hardcap, pois mas que ele será disperdicio de status",
  "header": {
    "title": "Welcome to Estratégias para o Shen",
    "subtitle": "Bem-vindo ao guia definitivo para dominar Shen, o Olho do Crepúsculo. Se você busca transcender o papel de tanque e se tornar uma verdadeira força no Rift, este é o seu lugar. Aqui, exploramos as nuances do campeão, revelando estratégias de jogo, builds ideais e a mentalidade correta para proteger seus aliados, dividir a pressão no mapa e impactar as lutas globais. Prepare-se para elevar sua maestria com Shen a um novo nível."
  },
  "Pros": {
    "1": "Teleporte Global",
    "2": "Fase de rotas forte",
    "3": "Mecânica de lâmina fluida",
    "4": "Ensina consciência de mapa",
    "5": "Teto de habilidade alto",
    "6": "Ninja que usa duas espadas"
  },
  "Cons": {
    "1": "Limpeza de onda limitada",
    "2": "Fraco contra campeões de longo alcance",
    "3": "Difícil de acertar controle de grupo",
    "4": "Ensina consciência de mapa",
    "5": "Dano em área baixo",
    "6": "Não é um dos favoritos da Riot."
  },
  "summary": {
    "title": "Sumário",
    "statistics": "Estatísticas",
    "basic": "Basico",
    "Abilities": "Habilidades e Estatísticas",
    "Mechanics": "Mecanicas"
  },
  "ShenSkills": {
    "KiBarrier": "Barreira de Ki",
    "TwilightAssault": "Ataque do Crepúsculo",
    "SpiritRefuge": "Refúgio do Espírito",
    "ShandowDash": "Investida das Sombras",
    "StandUnited": "Manter a União"
  },
  "KiBarrier": {
    "title": "Barreira de Ki",
    "Innate": "Inato:",
    "descricao1": "Após concluir os efeitos de uma habilidade, Shen concede a si mesmo um escudo por 47 - 120 (baseado no nível) (+ 13% de vida bônus) por 2.5 segundos. Se Shen atingir pelo menos um outro campeão com uma habilidade, o tempo de recarga de Barreira de Ki é reduzido em 4 - 8 segundos (baseado no nível).",
    "descricao2": "Shen manifesta uma Lâmina Espiritual que ele pode controlar com Ataque do Crepúsculo e Refúgio do Espírito.",
    "detalhes": "<p>A Lâmina Espiritual surge com Shen, se teletransporta para mais perto dele caso ele se afaste demais e instantaneamente se move para ele se ele usar qualquer teletransporte global, Teleporte, Retorno ou Manter a União. Ela também desaparecerá se Shen morrer e reaparecerá ao ressurgir.</p><p>Inimigos veem uma seta apontando de Shen para a localização de sua Lâmina Espiritual, mesmo que ela não esteja visível.</p><p>O Ataque do Crepúsculo concederá o escudo se a Lâmina Espiritual alcançar Shen. Se ela for parada, nenhum escudo é concedido. Ele concederá a redução de tempo de recarga ao atingir um campeão inimigo.</p><p>O Refúgio do Espírito concederá o escudo e/ou a redução de tempo de recarga depois que a zona protetora desaparecer. Não é preciso bloquear ataques para acionar a redução de tempo de recarga, apenas tocar um campeão aliado em qualquer ponto da duração.</p><p>A Investida das Sombras concederá o escudo quando a investida terminar. Ela concederá a redução de tempo de recarga ao atingir um campeão inimigo. Se a investida for um ícone representando o termo Interrompido, o escudo será recebido no momento em que a fonte de controle de grupo for aplicada, antes de qualquer cálculo de dano (se houver).</p><p>O Manter a União dará o escudo e/ou a redução de tempo de recarga ao completar o canal.</p>"
  },
  "TwilightAssault": {
    "title": "Twilight Assault",
    "descricao1": "Ativo: Shen invoca a sua Lâmina Espiritual de volta para a sua localização. Campeões inimigos atingidos são Lentos por 2 segundos enquanto se movem para longe de Shen.<br><br>Quando a lâmina chega, Shen fortalece os seus próximos 3 ataques básicos dentro de 8 segundos para ganharem 75 de alcance bônus e causarem dano mágico adicional. Contra estruturas, apenas a parte do dano base é aplicada.<br><br>Se a Lâmina Espiritual atingir pelo menos um campeão inimigo durante o trajeto, os ataques são aprimorados ainda mais para causarem dano mágico adicional aumentado e, de forma adicional, concederem a Shen 50% de Velocidade de Ataque bônus.<br><br>Ataques fortalecidos contra monstros causam 100% de dano bônus, mas o dano total é limitado.",
    "descricao2": "<p>Lentidão: 25 / 30 / 35 / 40 / 45%</p> <p>Dano Mágico Adicional: 10 - 40 (baseado no nível) (+ 2 / 2.5 / 3 / 3.5 / 4% (+ 1.5% por 100 de Poder de Habilidade) da vida máxima do alvo)</p> <p>Dano Mágico Total: 30 - 120 (baseado no nível) (+ 6 / 7.5 / 9 / 10.5 / 12% (+ 4.5% por 100 de Poder de Habilidade) da vida máxima do alvo)</p> <p>Dano Adicional Aumentado: 10 - 40 (baseado no nível) (+ 5 / 5.5 / 6 / 6.5 / 7% (+ 2% por 100 de Poder de Habilidade) da vida máxima do alvo)</p> <p>Dano Total Aumentado: 30 - 120 (baseado no nível) (+ 15 / 16.5 / 18 / 19.5 / 21% (+ 6% por 100 de Poder de Habilidade) da vida máxima do alvo)</p> <p>Dano Máximo em Monstros: 120 / 140 / 160 / 180 / 200</p>",
    "detalhes": "A Lâmina Espiritual irá parar no lugar ao colidir com o Muro de Vento ou o Inquebrável ou a Refutação ou o Giro da Lâmina. Se isso ocorrer, Shen não receberá os ataques fortalecidos.</p><p>Quando ela é invocada, a Lâmina Espiritual também verifica se o raio de jogo das unidades se sobrepõe ao seu (igual a uma verificação de raio de alcance 0), antes de partir, permitindo que ela atinja inimigos cujo centro está atrás da origem do projétil.</p><p>O ataque fortalecido não será ativado contra sentinelas.</p>",
    "interacao0": "Itens como: Jak'Sho, The Protean, Unending Despair e Eclipse. E as runas: Electrocute, Phase Rush, Approach Velocity, Font of Life e Cheap Shot aplicam seus efeitos quando o a espada espirutal é recalls. No caso precisando seguir como funciona as runas e itens, como o Electrocute que precisa de 3 ataque, o recall conta como 1 quaso acerte."
  },
  "SpiritRefuge": {
    "title": "Twilight Assault",
    "descricao0": "Ativo: Shen prepara sua Lâmina Espiritual, criando uma área ao redor dela. Após 2 segundos, ou quando Shen ou um campeão aliado entrarem na área, a Lâmina Espiritual gera uma zona protetora por 1.75 segundos, bloqueando todos os ataques básicos (exceto de torres) que atingirem Shen ou campeões aliados na área.",
    "detalhes": "<p>A zona protetora do Refúgio do Espírito pode ser movida enquanto ativa se Shen usar Ataque do Crepúsculo.</p><p>Refúgio do Espírito não pode ser aprimorado no Nível 1.</p><p>Refúgio do Espírito também bloqueará o dano de todas as habilidades que usam dano de ataque básico Investida, Disparo Místico, Tempestade de Aço, Ferro Mortal.</p><p>Clones aliados também são considerados campeões para esta habilidade.</p>"
  },
  "ShandowDash": {
    "title": "Shandow Dash",
    "descricao1": "<p>Passiva: Causar dano com Ataque do Crepúsculo ou Investida das Sombras restaura 30 / 40 / 50 (baseado no nível) de energia.</p> <p>Ativo: Shen avança para o local alvo, causando dano físico a campeões e monstros inimigos que ele atravessa e provocando-os por 1.5 segundos.</p> <p>Ataque do Crepúsculo e Refúgio do Espírito podem ser conjurados durante a investida.</p>",
    "detalhes": "Conjurar Flash durante a Investida das Sombras irá encerrar a investida prematuramente, mas a verificação de colisão do final da investida ainda atingirá os inimigos na localização do teleporte. <p>Isso ainda não pode afetar o mesmo inimigo mais de uma vez.</p> <p>A restauração de energia da Investida das Sombras pode ocorrer apenas uma vez.</p>"
  },
  "StandUnited": {
    "title": "Stand United",
    "descricao1": "Ativo: Shen concentra sua vontade, canalizando por 3 segundos e concedendo ao campeão aliado-alvo um escudo por 5 segundos no momento da conjuração, aumentado em 0% - 60% (com base na vida perdida do alvo). <p>Ao completar o canalização, Shen e sua Lâmina Espiritual se teletransportam para a localização do aliado-alvo, posicionando-se entre ele e o campeão inimigo mais próximo. Shen também destrói quaisquer projéteis que o estejam visando no momento da conclusão. </p>",
    "detalhes": "Manter a União pode ser usado em aliados via minimapa ou em seus retratos, ou usando as teclas F2 a F5. Nada disso pode ser feito se Shen for afetado por visão reduzida ou se o seu alvo estiver impossível de ser alvejado. <p>Shen se virará para encarar o aliado-alvo no início da canalização. Se o alvo estiver furtivo, os inimigos podem, em teoria, usar isso para estimar sua localização.</p> <p>Shen irá canalizar enquanto o seu alvo estiver vivo (mesmo se o escudo concedido for quebrado). Se o seu alvo morrer, a canalização é cancelada e Manter a União entra em tempo de recarga total.</p> <p>Interromper a canalização de Manter a União não removerá o escudo prematuramente.</p> <p>A tela do alvo brilhará em roxo para sinalizar que Shen o alvejou com Manter a União.</p> <p>Isso voltará ao normal quando a canalização terminar.</p> <p>Shen encontra o campeão inimigo visível mais próximo dentro de 2000 de alcance do aliado ou o campeão invisível mais próximo dentro de 600 de alcance para se posicionar a 175 unidades de seu aliado em direção a esse inimigo.</p> <p>Manter a União tem um raio de tolerância de 100 unidades.</p>",
    "interacao0": "Você pode usá-lo como alvo através do ícone acima do mapa.",
    "interacao01": "Funcionará como se você o usasse diretamente. Em lutas caóticas, esta é a maneira mais simples de evitar errar o alvo.",
    "interacao02": "O item Zeke's Convergence funciona ao final, quando você é teleportado ou interrompido o item é ativo automaticamente, de certa forma o item funciona."
  },
  "Mechanics": {
    "title": "Mecânicas por xPetu",
    "title1": "Padrão de Troca",
    "title2": "Troca Estendida",
    "title3": "Golpe de 'Grasp'",
    "title4": "O 'Provocar' da Torre",
    "title5": "E-Flash",
    "title6": "Q-Flash",
    "title7": "Triple-Q Leash",
    "title9": "Proteção com Q-W",
    "descricao1": "Na academia, é possível analisar as capacidades de uma pessoa através de uma metáfora de 'caixa de ferramentas'. Vamos pegar o meu caso como exemplo: toda vez que faço um curso na minha universidade e aprendo um novo ramo da matemática, estou adicionando uma nova ferramenta matemática à minha caixa de ferramentas matemática existente. Eu sou então capaz de combinar e usar as ferramentas disponíveis na minha caixa de ferramentas para resolver diferentes problemas. Em League of Legends, podemos adotar uma abordagem semelhante. O uso das ferramentas de troca de dano disponíveis para você compõe seu padrão de troca na fase de rotas. Depois de ler esta seção, você terá adquirido três (3) novas ferramentas para sua caixa de ferramentas de trocas com Shen. Ao combinar e usar essas ferramentas recém-obtidas no jogo, sua jogabilidade com o Shen subirá para outro nível.",
    "descricao2": "Esta é uma ferramenta de troca extremamente poderosa que pode ser aplicada notavelmente bem na maioria dos confrontos corpo a corpo. Para preparar a Troca Estendida, você precisa usar Ataque do Crepúsculo (Q) para arrastar sua Lâmina Espiritual para uma posição ofensiva antes da troca. Em geral, consideramos que a Lâmina Espiritual está em uma posição ofensiva quando está avançada no lado do inimigo na rota. Uma posição defensiva da Lâmina Espiritual significa que sua lâmina está perto de sua torre ou atrás de você em geral. Ao jogar de forma agressiva, sempre procure oportunidades para arrastar sua Lâmina Espiritual para uma posição ofensiva. Para realizar a Troca Estendida, comece simplesmente usando Q para puxar a Lâmina Espiritual através do seu oponente.",
    "descricao21": " Agora, você deve esperar por alguns segundos para deixar seu Q esfriar. As 3 cargas de Q fortalecidas duram 8 segundos, então você não precisa ter pressa. Se o inimigo não o respeitar, você pode simplesmente se aproximar e começar a atacá-lo. Após 3 ataques básicos, você deve se posicionar dentro do modelo do campeão inimigo para garantir um segundo arrasto com seu Q. Você quase certamente vencerá a troca se conseguir acertar todos os 6 ataques básicos fortalecidos. Você pode usar sua Corrida das Sombras (E) para diminuir a distância inicial, para perseguir para um abate ou para desengajar após seus Qs, dependendo do confronto e de como o inimigo joga. Você deve usar sua Barreira de Espírito (W) para bloquear as tentativas de retaliação do inimigo durante a troca. Esta ferramenta de troca está no seu melhor durante as fases iniciais da rota (níveis 2-5). Naturalmente, há espaço para variação, ou seja, a Troca Estendida pode ser realizada a partir de uma posição defensiva da Lâmina Espiritual ou com qualquer número de cargas iniciais de Q. Sempre tente adaptar as ferramentas para se adequar à situação apresentada a você.",
    "descricao3": "Em contraste com a Troca Estendida mencionada acima, que requer alguma preparação e comprometimento, o Golpe de 'Grasp' é uma ferramenta de troca que pode ser usada em quase todas as posições e é, por definição, muito menos arriscada. O Golpe de 'Grasp' é simplesmente um Q e um ataque básico que ativam a runa Aperto dos Mortos-Vivos. Quando realizado corretamente a partir de uma posição ofensiva da Lâmina Espiritual, o Golpe de 'Grasp' ativará as seguintes runas: Aperto dos Mortos-Vivos (permanecendo em combate com minions), Golpe de Escudo (ativando sua passiva com Q) e Golpe Baixo (o Q que desacelera o alvo). Isso é muito dano vindo de um (1) único ataque básico! Realizar o Golpe de 'Grasp' de forma consistente criará uma vantagem de vida para você, o que inevitavelmente levará a oportunidades de abate com a Troca Estendida. O segredo por trás do sucesso do Golpe de 'Grasp' é a Barreira de Ki. Não há como o oponente vencer trocas curtas contra um Shen que usa o 'Grasp-chop' perfeitamente, porque você sempre terá escudo ao entrar na troca curta.",
    "descricao4": "Esta ferramenta de troca é a mais situacional das três. Ela exige que você tenha uma rota de minions se acumulando, que está prestes a bater na torre inimiga. Para realizar o 'Provocar' da Torre, comece caminhando em direção ao oponente sob a torre e arrastando sua lâmina através dele, ativando assim seu escudo passivo. Em vez de atacar o campeão inimigo, simplesmente comece a atacar a torre dele. Nosso objetivo é permanecer em combate para preparar a runa Aperto dos Mortos-Vivos. O inimigo provavelmente irá atacá-lo e é nesse momento que você ataca: Acerte-o uma vez com um Q-ataque básico fortalecido e, em seguida, use E para recuar, passando através dele e se afastando da torre. Se feito corretamente, você estará fora do alcance da torre antes de levar um ataque dela.",
    "descricao5": "O 'Provocar'-Flash. Este é o truque mecânico mais conhecido de Shen e uma parte icônica de seu kit. Para realizar o E-Flash, use a Corrida das Sombras (E) e use o Flash antes que a corrida termine. É um combo muito simples, mas pode ser usado de maneiras infinitamente criativas. Para maximizar o alcance e a área coberta pela 'hitbox' de sua Corrida das Sombras, você deve usar E no alcance máximo e Flashar logo antes do final da corrida. No entanto, maximizar o alcance não é o único uso correto do 'Provocar'-Flash. Você pode realizar um E-Flash instantâneo usando o Flash imediatamente após seu E. Isso pode ser usado para pegar inimigos de surpresa a curta distância e é especialmente útil contra um Campeão como a Fiora, que está sempre procurando 'aparar' seu E. Eu recomendo praticar o 'Provocar'-Flash na Ferramenta de Treino antes de fazê-lo no jogo. Apenas brinque com o combo colocando vários bonecos de treino e tentando acertá-los de todas as formas criativas.",
    "descricao6": "Uma mecânica menos conhecida, mas igualmente importante, é o Q-Flash. Este truque foi documentado pela primeira vez por mim em 2017, mas ainda hoje permanece nas sombras e é ofuscado pelo popular 'Provocar'-Flash. O dano do Shen é bastante aumentado se você fortalecer seus Q-AAs arrastando sua Lâmina Espiritual através de um inimigo. Conseguir ou não o arrasto é frequentemente o fator decisivo para finalizar um inimigo. Puxar a Lâmina Espiritual através de um inimigo também reduz o tempo de recarga de sua Barreira de Ki e, portanto, pode, em combinação com outra habilidade, salvá-lo de dano que seria letal. O Q-Flash é o método mais rápido e confiável de garantir o arrasto. Para realizar o Q-Flash, use Ataque do Crepúsculo (Q) e Flash por cima do campeão inimigo antes que a Lâmina Espiritual chegue à sua localização. Se você Flashar tarde demais, a Lâmina Espiritual permanecerá no ponto inicial de onde você Flashou. Quando dominada, esta técnica se mostrará valiosa em todas as partidas que você jogar com Shen.",
    "descricao7": "Shen tem um dos melhores 'leashs' de caçador no nível 1 do jogo por causa do dano do Ataque do Crepúsculo (Q). A maioria dos jogadores de Shen simplesmente usa Q em 1:29 enquanto 'leasha' e depois acerta 3 Q-AAs no monstro. Isso está errado. Primeiro, descobrimos o 'Double-Q Leash'. Para realizar o 'Double-Q Leash', use seu primeiro Q em 1:25 e use Q novamente quando tiver usado os primeiros 3 Q-AAs. O princípio é o mesmo que na Troca Estendida. Agora, uma inferência apressada pode levá-lo a pensar que este é o melhor 'leash' possível que você pode dar. Você estaria errado. Shending Help foi o primeiro a documentar a técnica de 'leash' ideal para Shen, o 'Triple-Q Leash'. O 'Triple-Q Leash' adiciona um escudo passivo ao 'leash' e, portanto, supera o 'Double-Q Leash'. Manipulamos o tempo de recarga da Barreira de Ki usando Q antes do primeiro Q de dano em 1:25. Para realizar o 'Triple-Q Leash', use o primeiro Q em 1:17, o segundo Q em 1:25 e o terceiro Q em 1:34 (após 3 Q-AAs). Use seu escudo passivo para 'tankar' 1 ou 2 ataques para seu caçador. Ao fazer isso corretamente, você deixa seu caçador muito feliz e chega à rota a tempo para a morte do primeiro minion.",
    "descricao8": "A maioria dos jogadores de Shen usa sua Barreira de Espírito (W) em si mesmos, como se estivessem jogando de Jax e usando seu Contra-Ataque (E). Durante a fase de rotas, isso está correto porque você de fato está sozinho na rota superior. No entanto, quando se trata de lutas em equipe e pequenas escaramuças, a Barreira de Espírito de Shen deve ser usada para proteger seus companheiros de equipe. Barreira de Espírito é uma habilidade incrivelmente poderosa quando usada corretamente. Dar a um atirador uma imunidade de dois segundos a ataques básicos pode significar a diferença entre vencer e perder uma luta em equipe. A maneira mais fácil de aplicar Barreira de Espírito em um carregador é simplesmente ficar ao lado dele, usar Q para puxar a Lâmina Espiritual para lá e, em seguida, usar W. Além deste método básico, existe uma maneira avançada de bloquear ataques básicos em seus companheiros de equipe. A Proteção Avançada com Q-W, como eu gosto de chamá-la, é provavelmente a mecânica mais difícil de Shen de ser executada corretamente. É uma técnica situacional que exige que seu aliado esteja entre você e sua Lâmina Espiritual. Se você pressionar Q e W ao mesmo tempo, sua Lâmina Espiritual será preparada enquanto se move em sua direção. Quando preparada, ela ativará se passar por um campeão aliado, o que significa que também pode bloquear ataques básicos enquanto se move. Uma Barreira de Espírito ativada e em movimento também terá uma área de efeito instantânea maior do que uma Barreira de Espírito parada. Isso é causado pela frequência de verificação da Barreira de Espírito. Os detalhes dessa interação são omitidos aqui por enquanto, pois estão fora do escopo deste guia. Veja o vídeo abaixo para um exemplo de Proteção com Q-W e a área de efeito maior."
  },
  "skins": {
    "original": "<h2> <p> Original </p> </h2> Dentre os sigilosos guerreiros Ionianos conhecidos como Kinkou, Shen serve como seu líder, o Olho do Crepúsculo. Ele anseia por se manter livre da confusão das emoções, preconceitos e egos, e trilha o caminho invisível do julgamento imparcial entre o reino espiritual e o mundo físico. Com a tarefa de impor o equilíbrio entre eles, Shen empunha lâminas de aço e energia arcana contra qualquer um que ouse ameaçá-lo.",
    "frozen": "<h2> <p> Congelado </p> </h2> Enfrentando o frio amargo, Shen vagueia pelas calotas de gelo com suas lâminas gêmeas, caçando o aterrorizante demônio escondido nas profundezas.",
    "YellowJacket": "<h2> <p> Jaqueta Amarela </p> </h2>",
    "Surgeon": "<h2> <p> Cirurgião </p> </h2> Fique tranquilo, a anestesia não fará parte da operação.",
    "BloodMoon": "<h2> <p> Lua Sangrenta </p> </h2> O discípulo mais indomável, em mente e corpo, a lealdade de Shen ao culto da Lua Sangrenta jamais pode ser abalada. Ele serve como o guarda-costas pessoal das figuras mais importantes do grupo, executando intrusos com uma fria imparcialidade, sugerindo que parte de sua humanidade já foi consumida.",
    "WarlordSkin": "<h2> <p> Senhor da Guerra </p> </h2>",
    "tpa": "<h2> <p> TPA </p> </h2> Em homenagem ao desempenho vitorioso de Stanley como Shen durante o Campeonato Mundial de 2012.",
    "Pulsefire": "<h2> <p> Pulsefire </p> </h2> Ao longo dos milênios, Shen foi chamado de muitos nomes: senhor da guerra, invasor, conquistador. Mesmo assim, sua missão de construir um exército para todas as eras parece não ter fim. Buscando apenas os mais inteligentes e mais fortes para se juntarem às suas fileiras, ele permanece imperturbável pela emoção, lançando seu olhar atemporal sobre aqueles com potencial oculto.",
    "Infernal": "<h2> <p> Infernal </p> </h2> Um guerreiro Infernal vindo das profundezas furiosas do submundo, Shen aparece nos campos de batalha num piscar de olhos, protegendo seus companheiros titãs mesmo da resistência mais bem organizada.",
    "PsyOps": "<h2> <p> PsyOps </p> </h2> Um soldado psíquico e tenente de campo da PsyOps, o poder de Shen está conectado a uma criança fantasma que o segue aonde quer que ele vá - concedendo-lhe visões dos limites entre os vivos e os mortos. Apenas o Alto Comando sabe de onde o garoto veio, e eles não estão falando.",
    "Shockblade": "<h2> <p> Lâmina do Choque </p> </h2> Uma vez metade de uma dupla de elite da ordem Lâmina do Choque, Shen se afastou do combate após cometer um erro que quase custou a vida de seu parceiro, Zed. Agora, Shen treina jovens shinobi que se preparam para se juntar às suas fileiras - mas seu novo pupilo pode inspirá-lo a pegar sua espada e se juntar à luta mais uma vez.",
    "AshenGuardian": "<h2> <p> Guardião Cinéreo </p> </h2> Um devoto dos princípios de seu líder agora morto, Shen ainda caminha pelos terrenos do castelo, empunhando a lâmina de seu mestre junto com a sua. Talvez uma pequena parte dele reconheça, a cada golpe em sua armadura dado por viajantes em busca de antigas riquezas, que sua guarda é sem sentido. Mas a vida deve ter um significado. Até mesmo uma vida tão infinita como esta.",
    "ThreeHonors": "<h2> <p> Treis Honras </p> </h2> Shen é o último fundador sobrevivente da Ordem do Consolo. Ele fechou todos os templos quando o mundo caiu na apatia e no descaso, desaparecendo na obscuridade até que Malzahar reviveu a Ordem. Agora de volta das sombras, Shen serve como seu professor mais experiente, um líder estoico de integridade e graça em quem todos podem confiar."
  },
  "MapAwareness": {
    "title0": "Consciência de Mapa por xPetu",
    "title": "Consciência de Mapa",
    "title1": "Gerenciamento de Rotas",
    "title2": "Tempo de Habilidade",
    "title3": "Split-pushing",
    "title4": "Objetivo Atual",
    "title5": "Espelhando Pressão",
    "title6": "Visão",
    "title7": "Proteger Aliado",
    "fingers": "Como Shen, você precisa estar ciente do que está acontecendo no mapa. Primeiro, você precisa olhar para o minimapa constantemente, pelo menos uma vez a cada 5 segundos. Esta é uma dica geral e não específica para o Shen, pois irá melhorar sua jogabilidade com qualquer campeão. A segunda coisa importante é mover sua câmera pelo mapa. O minimapa fornece muitas informações, mas não todas. Para ver as barras de recursos do inimigo, a vida dos minions e as habilidades sendo usadas, você tem que olhar ao redor do mapa. Não há desculpas para manter sua câmera centrada em seu campeão o tempo todo. Você precisa saber o que todos em sua equipe estão fazendo, quem está em perigo e quem está seguro. Isso é vital para sua ultimate, pois você está dando a si mesmo mais tempo para pensar e tomar as melhores decisões. Você pode clicar no mapa para olhar ao redor ou usar as teclas F para ver seus companheiros de equipe. Eu pessoalmente reconfigurei minhas teclas F para Espaço (caçador), V (meio), C (atirador) e X (suporte). Isso me permite verificar rapidamente cada companheiro de equipe apenas com o polegar, mantendo o resto dos dedos no QWER.",
    "WaveManagement": "O estado das rotas de minions tem um impacto profundo no valor presente líquido da ultimate de Shen. Raramente é uma boa ideia usar Proteger Aliado se houver uma onda gigante de minions prestes a bater em sua torre. No melhor cenário, você teria empurrado sua rota de minions para a torre inimiga antes de ultar, minimizando assim a quantidade de minions perdidos durante sua ausência. Ter Teleporte para voltar à rota também é ideal. Na realidade, há situações em que você terá que ultar e a rota não estará em um estado perfeito. Mas podemos minimizar nossas perdas planejando com antecedência. Se você puder ler o estado do jogo e prever o que provavelmente acontecerá nos próximos minutos, poderá preparar as rotas de minions de acordo. Ultimates proativas são ótimas, pois podem (por definição) ser executadas enquanto sua rota está avançada.",
    "CastTiming": "O escudo de Proteger Aliado escala com a porcentagem de vida perdida do alvo, chegando a um máximo de 60% de vida perdida. A runa Revitalizar aumenta o escudo em alvos com menos de 40% de sua vida máxima, o que significa que o momento teoricamente ideal para usar sua ultimate é quando o aliado alvo está com menos de 40% de vida. É bom lembrar disso. No entanto, isso não significa que você deve usar sua ultimate apenas em aliados com pouca vida. Ao cronometrar sua ultimate, o fator decisivo deve ser as ações dos campeões inimigos. Você quer ultar no momento em que o oponente se compromete com seu aliado alvo. Usar Proteger Aliado é como pescar: você não quer ultar muito cedo e assustar o peixe, mas também não quer ultar muito tarde, quando a isca já foi comida.",
    "Split-pushing": "Após a fase de rotas, você vai querer começar a fazer split-push. Shen se destaca no split-push porque tem duas maneiras de se juntar ao seu time: Teleporte e Proteger Aliado. Ao contrário do que a maioria das pessoas pensa, o principal objetivo do split-push com Shen NÃO é derrubar torres, é tirar a pressão do seu time. Antes de começarmos o split-push, precisamos que Teleporte ou Proteger Aliado estejam fora do tempo de recarga, para que possamos nos juntar ao nosso time, se necessário. Agora, explicarei brevemente os três princípios essenciais do split-push. Dominar esses princípios melhorará exponencialmente sua jogabilidade com o Shen e, inevitavelmente, sua classificação também.",
    "CurrentObjective": "Você precisa reconhecer qual é o objetivo atual e começar a empurrar o lado oposto do mapa. Se for um objetivo neutro como o Barão, você faz split-push na rota inferior. Se seu time está se agrupando para pegar o inibidor inferior, você faz split-push na rota superior. Você está tentando forçar os inimigos a tirarem membros de sua equipe do objetivo atual, para que seu time obtenha o objetivo sem contestação ou vença uma luta em equipe vantajosa. Entender o objetivo atual e, por fim, a condição de vitória de sua equipe é uma das habilidades mais importantes no League.",
    "MirroringPressure": "Todos nós já vimos isso acontecer: um top laner feedado começa a fazer split-push, morre em um 1v3 e reclama que seu time não faz nada. Esse top laner não entende o conceito de espelhar a pressão. Como um split-pusher, é essencial saber quando seu time tem pressão e quando não tem. Quando 4 membros de sua equipe estão cercando uma torre, eles têm pressão e você pode espelhar isso aplicando pressão no lado oposto do mapa, forçando o inimigo a uma situação de perda. Quando sua equipe está recuando ou apenas espalhada aleatoriamente pela selva, eles não têm pressão, o que significa que você também não deve tentar aplicar pressão. Se você morrer quando seu time não tem pressão, o inimigo não perde nada. Em geral, quanto mais agressivo seu time for, mais agressivo você pode ser.",
    "Vision": "Como Shen, a pior coisa que você pode fazer é morrer de graça em uma rota lateral. Porque quando você está morto, você não pode ultar. E quando você não pode ultar, seu time vai 'intar'. Para evitar que isso aconteça, você vai querer ter cobertura de sentinelas ao redor de sua rota. Sempre compre 1 ou 2 Sentinelas de Controle ao fazer split-push. ISSO É EXTREMAMENTE IMPORTANTE. Se você não tiver espaço para uma Sentinela de Controle, venda seu Escudo de Doran. Use sua Sentinela Invisível e Sentinela de Controle para criar uma linha de visão na selva. Você não deve avançar além desta linha de visão a menos que tenha conhecimento da posição dos inimigos. Apenas lembre-se que morrer é a última coisa que você quer fazer. Se atacar a torre o coloca em risco, não a ataque.",
    "StandUnited": "Esta seção abordará os princípios do uso eficiente da ultimate como Shen. Proteger Aliado é uma habilidade que muda o jogo e, portanto, também tem um tempo de recarga monumental. Saber quando ultar e quando não ultar é uma chave importante para subir de elo nas ranqueadas com Shen. Uma distinção importante a ser feita é a diferença entre ultimates reativas e proativas. Ultimates reativas são realizadas para neutralizar a ação do inimigo e virar o rumo de uma luta (geralmente) ultando em um carregador em perigo. Ultimates proativas são feitas em colaboração com um aliado que inicia a luta para começar um confronto em nossos termos, ou seja, ultar em um Kha'Zix camuflado para assassinar a retaguarda inimiga ou ultar no Jarvan IV que em seguida usa seu combo E-Q no time inimigo."
  },
  "Glossary": {
    "title": "Glossário",
    "S": "<strong>S:</strong> Itens que são muito bons.",
    "A": "<strong>A:</strong> Itens que são bons.",
    "B": "<strong>B:</strong> Itens que dependem da composição do time inimigo.",
    "C": "<strong>C:</strong> Itens completamente situacionais.",
    "D": "<strong>D:</strong> Itens que normalmente não são feitos porque são ruins para o Shen.",
    "F": "<strong>F:</strong> Itens que não funcionam.",
    "???": "<strong>???:</strong> Itens sobre os quais não tenho ideia e não encontrei informações.",
    "descricao0": "O Kinkou Jitte e Twilight's Edge só estão ai por conta do nome, já que ambas fazerem referencia de certa forma a Ordem Kinkou e ao Shen que é o olho do crepusculo. <p>Alguns itens estão errados de propósito, descubram quais.</p>"
  },
  "matchupstop": {
    "title": "Guia de matchups de Shen por Shending Help",
    "descricao0": "Este guia de matchups se concentra principalmente em como jogar a <b>fase inicial da rota</b> em cada matchup específica. Na maioria dos confrontos, você pode conseguir uma vantagem de uma forma ou de outra, e então a questão é como usar essa vantagem para 'nevar' sua rota e transferir seu avanço pessoal para outras rotas. Basicamente, todos os campeões da rota superior superam você em escala de jogo, especialmente nas rotas laterais, e os níveis de dificuldade descrevem apenas o quão difícil é conseguir essa vantagem inicial. <p> <b>Mentalidade de 'slow-push' no nível 1 (Quando avançar e quando não):</b> Quando a rota começa, você deve <b>sempre</b> (se o matchup permitir) tentar fazer com que a rota <b>avance lentamente</b> em direção ao inimigo. A principal forma de fazer isso não é bater muito nos minions, mas sim posicionar a lâmina à frente na rota e estar pronto para punir o HP do inimigo na primeira vez que ele tentar atingir um minion. Continue fazendo boas trocas e o inimigo perderá o acesso à sua onda, o que permitirá que você chegue ao nível 2 primeiro. Você deve usar isso para dar 'taunt' para a frente no momento em que atingir o nível 2 em todos os jogos. Eu anotei quais matchups você sempre deve conseguir o 'slow-push' no nível 1 ao adicionar um <b>“Push lvl 1”</b> abaixo do nome deles. Quando você está jogando contra um campeão sem esta anotação, isso não significa que você não possa tentar avançar. Se o inimigo não estiver jogando de forma ideal e você conseguir avançar sem levar muito dano em troca, ótimo (Dica: Tente chegar à rota mais cedo do que o oponente e bater 3-5 vezes nos minions com ataques normais antes que ele apareça). Assim, você ainda pode dar 'all-in' no nível 2 nesses matchups e ficar feliz, mas esteja pronto para desistir da ideia de 'slow-push' se o inimigo te punir. </p> <p> <b>Teleporte vs Incendiar:</b> As vezes que eu pego Incendiar são em matchups nos quais me sinto confiante em vencer as trocas iniciais e, portanto, ter total controle sobre a onda. Se você perder (ou mesmo ficar no empate) durante as primeiras ondas da rota ao pegar Incendiar, você ficará preso na rota por um longo tempo sem conseguir forçar um tempo natural de recuo. Eu listei abaixo em cada matchup se eu pego Incendiar ou TP, mas se você sabe que geralmente tem dificuldade em um matchup específico que eu não tenho, sinta-se à vontade para pegar TP mesmo que eu liste Incendiar como minha runa recomendada (ou o contrário, se você sempre vence uma partida que eu listei como difícil). ",
    "free": {
      "Zac": "Consiga o 'slow-push' no nível 1, faça trocas duras sempre que ele chegar perto, não o deixe farmar de jeito nenhum. 'All-in' no nível 2. Pune-o constantemente. E depois de deixá-lo com metade da vida, NÃO o deixe se curar novamente com a passiva. Mantenha a pressão e pise em suas bolhas. A única maneira de você perder esta rota é se morrer para um 'gank', então lembre-se de 'wardar' e respeitar o caçador inimigo quando ele estiver na parte superior do mapa. Depois de esmagar um Zac na rota, eles tendem a apenas 'roamar' (vagar pelo mapa) o tempo todo e esperar que dê certo. Nesses casos (se for antes do nível 8), você deve apenas 'freezar' (congelar) a rota para que o time dele perca onda após onda de ouro+XP e 'spampingar' (pingar repetidamente) seu time para ter cuidado e avisar que Zac está 'roamando'. Mesmo que morram uma ou duas vezes, ainda está tudo bem, e se não morrerem, o time inimigo está condenado.",
      "Zed": "Se algum jogador 'autofill' da rota do meio ousar pegar Zed contra seu Shen, certifique-se de que ele nunca mais faça isso. Deixe-o farmar apenas com o Q, procurando puni-lo toda vez que ele avança para dar ataques básicos e pegar o 'CS'. Você vence facilmente as trocas nos níveis 1-5, mesmo que ele acerte tudo, mas ele provavelmente não acertará se você for bom em desviar dos Qs dele ou ficar atrás de seus minions."
    },
    "veryeasy": {
      "Diana": "Tente fazer um 'slow-push' cedo para atingir o pico de nível 2/3 primeiro. Se ela usar o Q ou W para disputar o avanço, você pode fazer trocas livremente. E se ela não usar, você conseguirá chegar ao nível 2 antes dela e pode dar 'taunt' instantaneamente (o mesmo no pico de nível 3). Se você estiver pensando em quando começar a troca, o momento em que ela acabou de usar o terceiro ataque empoderado da passiva nos minions é uma boa hora (ou se ela usar o Q para farmar). Além disso, lembre-se de posicionar a lâmina à frente na rota, pois ela não tem força para pará-lo.",
      "Hecarim": "Contanto que você não entre em trocas muito longas, onde ele consiga usar seu Q com acúmulo (e Conquistador) repetidamente, você deve vencer todas as trocas neste confronto. Faça trocas bem curtas ou moderadamente curtas (posicionando a lâmina à frente e guardando o 'taunt') até que ele esteja com cerca de metade da vida, então você pode dar 'taunt' de forma agressiva e pegar o 'dragthrough'.",
      "Kaynwithoutsmite": "Ele é um 'laner' fraco, apenas faça o que você faz em todos os matchups corpo a corpo. Consiga o 'slow-push', posicione sua lâmina à frente na rota. Puna-o com 'dragthroughs' quando ele se aproximar para 'CS' e vá para o 'all-in' no nível 2.",
      "Lissandra": "Comece com o E e faça trocas agressivas toda vez que estiver disponível, ou comece com o Q e dispute o avanço dela, usando o arbusto do meio entre os ataques nos minions, a menos que ela o 'wade'. O ponto chave é chegar ao nível 2 primeiro e procurar por um 'taunt' instantâneo no nível 2. Você vence as trocas facilmente nos níveis 2-5 toda vez que acerta um 'taunt', então, contanto que você não seja empurrado para a torre, este confronto deve ser fácil.",
      "Malphite": "Os padrões de troca de Malphite são muito previsíveis, apenas jogue da forma padrão de posicionar sua lâmina e usar o 'dragthrough' sempre que ele se aproximar para pegar seu 'CS'. Certifique-se de não ir para o 'all-in' enquanto ele ainda estiver saudável, já que a redução de velocidade de ataque dele + o dano do W é forte se ele puder se manter e lutar com você (mas geralmente está tudo bem dar 'taunt', bater 3 vezes e sair). Se você tiver uma boa lâmina, precisa garantir uma troca de 'dragthrough' de bom valor, então não a estrague usando o Q apenas para bloquear um Q de Malphite nesses casos. Se sua lâmina já estiver em uma posição ruim, então tudo bem.",
      "Maokai": "Posicione sua lâmina, faça 1-2 ataques com o Q empoderado e aplique seu Agarre do Imortal sempre que estiver disponível, recuando e repetindo. Você é simplesmente muito mais forte em todos os níveis iniciais do que ele, abuse disso ao máximo com trocas curtas. A única coisa com a qual você deve ter cuidado é fazer trocas mais longas dentro de uma onda de minions, já que ele pode te prender por um longo tempo com W + Q, enquanto se cura com a passiva. Então, continue fazendo trocas curtas com ele a cada 'CS' que ele for pegar até que ele esteja com pouca vida o suficiente para você dar 'all-in'. Um padrão de troca normal será algo como: 1) posicionar a lâmina. 2) esperar pelo tempo de recarga do Q+passiva. 3) Usar o 'dragthrough' e dar um golpe, e então ser empurrado pelo Q dele. 4) Esperar alguns segundos, então dar 'taunt' nele, atingi-lo com seus 2 Qs restantes, e então usar o Q novamente e continuar batendo enquanto se posiciona atrás dele para que ele não possa usar o Q em você para desengajar.",
      "Nasus": "Nasus é o matchup mais fraco da rota superior nos primeiros níveis. Combinado com o quão forte Shen é no início, você não deve deixá-lo pegar (ou bater) NENHUM 'cs' de graça (exceto com o E de longe). Posicione sua lâmina à frente na rota constantemente enquanto a arrasta através dele e faça trocas toda vez que ele for dar o último golpe. Ele deve ser forçado a pegar o último golpe apenas com o E se você jogar corretamente. Por ele ser tão fraco, você pode até deixar a rota avançar em sua direção, ao contrário de outros confrontos, e armar um 'freeze' inicial, mas se você acabar avançando (o que muitas vezes acontecerá automaticamente se você forçar trocas), então é possível usar o 'taunt na torre' de forma muito eficaz contra Nasus para dar dano nele sob a torre sem levar muito dano em retorno. Tente 'nevar' (crescer) agressivamente, a ponto de você estar no nível 7 para o nível 4 dele se você fizer cada passo do início de jogo corretamente, e impedi-lo completamente de escalar.<br>O erro mais comum neste confronto é bater nos minions nos primeiros níveis sem motivo. Você quer ter a maior janela de tempo possível para forçar trocas em Nasus antes que sua onda de minions atinja a torre inimiga, onde ele pode escalar com segurança. Então, nunca bata em minions inimigos, exceto para o último golpe no último momento antes de eles morrerem. E também certifique-se de não pegar o 'aggro' de uma nova onda de minions inimigos antes que ela tenha 'aggro' completamente em seus minions.<br>Para o E dele: Lembre-se que é uma habilidade de área de efeito que também atingirá os minions que estão perto de você, então pense ativamente se você quer que ele os danifique para fazer com que a rota avance em sua direção (se você estiver em posição de 'freezar'), ou se você quer ficar longe deles para não deixá-lo avançar (se você não for forte/saudável o suficiente para 'freezar' naquele momento).<br>Para depois que ele estiver no nível 6: Continue posicionando a lâmina de forma agressiva para fazer trocas com Qs empoderados, mas certifique-se de nunca dar 'taunt', pois ele pode usar o R e matá-lo com a Murchar. Se você guardar o 'taunt' até que ele seja 'killável', a ameaça de 'all-in' dele é muito menor.",
      "Pyke": "Posicione a lâmina e force trocas com seu escudo + Qs empoderados quando ele se aproximar para 'cs'. Certifique-se de manter as trocas curtas e doces, e não o persiga em sua onda para usar todos os 3 Qs empoderados, isso fará com que você leve mais dano do que gostaria em troca, o que será ainda pior quando ele se curar nos arbustos após as trocas. Se você jogar corretamente, não deve perder muito do seu próprio HP em troca do dele, então ele se curar um pouco está tudo bem. Dispute o avanço forçando-o a sair e certifique-se de atingir o nível 2 e 3 antes dele e explore isso. Apenas tome cuidado com 'ganks' do caçador, já que Pyke tem uma ótima preparação. Para trocas quando Pyke estiver no nível 2+, lembre-se que você não pode dar 'taunt' de longo alcance, já que ele reagirá com o E, então comece as trocas com um 'dragthrough' (depois de ter posicionado a lâmina à frente), ou dê 'taunt' quando estiver perto o suficiente para ter certeza de que ele não pode reagir com o E dele.",
      "Skarner": "Posicione a lâmina, faça trocas com 'dragthrough' no nível 1 e termine a troca antes que ele consiga usar seu 3º ataque com Q em você de perto (o lançamento da pedra está bem, mas de perto dói). Garanta o 'slow-push' e não avance demais a ponto de mover a área de troca muito perto da torre dele muito rapidamente, pois é aí que o E dele se torna uma ameaça no nível 2+. Se você estiver perto da torre inimiga, certifique-se de respeitar o E+Flash dele, e fique longe de paredes enquanto a onda de minions atinge a torre o mais rápido possível para sair daquele local. Fora o E+Flash para a torre, as trocas curtas dele são muito piores que as suas, então continue abusando dele no início e aumente sua vantagem normalmente.",
      "Swain": "Ele é lento, imóvel e frágil. Tente encontrá-lo antes que os minions nasçam (de 1:05 a 1:20 é o ideal) e dê 'all-in' nele começando com o E. Se você não conseguir encontrá-lo, você pode tanto jogar na rota normalmente com o Q e aguentar alguns ataques básicos para disputar o nível 2 com o Q e usar os arbustos entre os ataques, ou começar com o E de qualquer maneira e jogar de forma agressiva, ambos podem funcionar. Vá para o 'all-in' no nível 2, se possível. Depois que ambos estiverem no nível 2+, você ainda pode procurar por 'taunts', mas tente cronometrá-los para quando ele estiver parado para usar o E em você, para que você fique atrás dele e ele não tenha nenhum controle de grupo para prolongar a troca depois dos seus 3 Qs empoderados quando você desengajar. Continue fazendo trocas ativamente e não o deixe escalar para o nível 6 de graça. Ele também é muito suscetível a 'ganks'.",
      "Sylas": "Posicione a lâmina no nível 1. A maioria dos Sylas começa com o E no nível 1, então apenas fique atrás de seus minions enquanto faz trocas com os Qs empoderados de alcance extra, e force-o a avançar e levar o 'aggro' total dos minions da sua onda se ele quiser te atingir com a corrente. Apenas mantenha-se em trocas com bom custo-benefício de HP e reposicione a lâmina como de costume, e vá para o 'all-in' no nível 2 depois de você atingir o nível 2 primeiro. Apenas dê 'taunt' quando ele estiver com muita vida perdida ou você estiver um nível acima. O erro mais comum é avançar demais sem um bom motivo, já que então ele pode farmar sob a torre e escalar livremente. Mantenha-o na rota fazendo 'slow-push' o mais lentamente possível e faça boas trocas.",
      "Wukong": "A única vez que você precisa ser um pouco respeitoso é no nível 1 por causa da passiva dele e da aceleração de velocidade de ataque no E. Você ainda pode fazer trocas curtas com o alcance extra para tentar chegar ao nível 2 primeiro para o 'all-in', mas não é absolutamente necessário. Você vence muito facilmente nos níveis 2-5 usando Qs empoderados + W no início + mantendo o E pronto para desengajar (mas use-o de forma agressiva se você estiver com muito HP a mais ou um nível acima, ou se Wukong desperdiçar habilidades na onda de minions). Você tem uma enorme ameaça de abate nesta rota se jogar as trocas bem."
    },
    "Moderatelyeasy": {
      "Akali": "Posicione a lâmina no nível 1, depois faça trocas com o Q empoderado se ela tentar dar um ataque básico em algum 'CS'. Tente usar a passiva para bloquear o primeiro Q dela, se puder, mas não é necessário para vencer. Você deve ser capaz de acertar o 'taunt' no nível 2 ou afastá-la para que ela perca um pouco de XP antes que a terceira onda de minions chegue. A partir do nível 3, lembre-se que o W dela tem um tempo de recarga 2 segundos maior que o seu E. Então, se você forçá-lo em uma troca, tente se posicionar para dar 'taunt' no instante em que ele voltar do tempo de recarga para uma troca com vitória garantida. Tente se mover para atrair o E dela e desvie se puder, então faça trocas agressivas enquanto ele estiver em tempo de recarga. Respeite o 'all-in' do nível 6 se você ainda não tiver uma grande vantagem nesse ponto.",
      "Ambessa": "Posicione a lâmina e jogue por prioridade no nível 1. Como ela sempre vai avançar para longe depois do seu primeiro Q empoderado, não adianta persegui-la para usar 2 Qs empoderados logo de cara como você faria contra outros campeões corpo a corpo. Em vez disso, use 1, depois guarde os 2 restantes para impedi-la de bater na sua onda de minions (e se ela ainda o fizer, esteja pronto para puni-la por isso). Então, quando o Q estiver pronto novamente, reposicione a lâmina e repita. Para usar o 'taunt' neste confronto, é muito importante não sinalizar o momento exato em que você vai usá-lo, já que ela poderá avançar para longe e revidar. Mas se você ficar no limite do alcance do 'taunt' por um tempo maior, e então recuar um pouco antes de usá-lo, ela não conseguirá prever. E mesmo que ela tenha boas reações, há sempre um atraso antes que o avanço dela aconteça depois que ela usa uma habilidade, então ela conseguirá usar o Q, mas não o avanço, e você pode fazer uma boa troca curta e recuar. Certifique-se de usar os 2 primeiros Qs empoderados instantaneamente enquanto ela estiver com o 'taunt', para então apenas se afastar quando ela sair do controle de grupo, já que você não quer usar o último Q empoderado no escudo dela (que ela quase com certeza estará usando enquanto sai do controle de grupo do 'taunt'). Continue fazendo trocas curtas assim repetidamente até que ela esteja com pouca vida demais para revidar, então finalize-a.",
      "Camille": "Contra Camille, você precisa fazer trocas de uma maneira específica. Primeiro, você tem que fazê-la usar tanto a sua **Placa Óssea** quanto a sua passiva, trocando 1 ataque básico por 1 ataque básico (de preferência, posicionando sua lâmina à frente na rota ao mesmo tempo). Então, enquanto essas ferramentas defensivas dela estiverem em tempo de recarga, você pode simplesmente usar o 'taunt' + 'dragthrough' (passar a lâmina através), e você vai esmagar cada troca se tudo estiver disponível. Depois, repita (lembre-se de nunca trocar quando ela tiver **Placa Óssea** ou a passiva!). Além disso, se ela usar o E em uma parede para fazer uma troca agressiva, use Q+W preventivamente para que os primeiros ataques básicos dela sejam bloqueados enquanto você está atordoado pelo E dela. Nunca fique perto o suficiente dela e da parede para não conseguir reagir com Q+W a tempo.",
      "ChoGath": "Respeite-o quando ele usar o E (para os 3 ataques básicos de espinhos), fora isso, não o respeite de forma alguma. Vá para o 'all-in' no nível 2. Depois de ter tirado uma boa parte da vida dele, você precisa mantê-lo com pouca vida. Se ele conseguir bater nos minions livremente, ele ficará bem, mas se ele for impedido de farmar e só conseguir fazê-lo com o Q, a cura não será tão ruim. Depois de acertar um 'taunt' nele, desvie no momento em que o 'taunt' terminar, e ele quase garantidamente errará o Q, porque todo Cho'Gath estará apertando o botão do Q durante o tempo em que está com 'taunt'.",
      "Mundo": "Se ele se aproximar dos minions para o último golpe, você deve ser capaz de forçar trocas vitoriosas logo no início, ficando atrás dos seus minions corpo a corpo com o seu alcance extra no nível 1, evitando assim os Qs dele. Quando ele estiver no nível 2+, também tome cuidado com o E dele quando o seu minion estiver com pouca vida. Se ele constantemente fica recuado e farma com o Q, então seja um gênio do mal e use o seu corpo para bloquear os minions de cerco e alguns minions corpo a corpo com o seu escudo passivo sempre que ele estiver disponível, até que ele fique bravo e se aproxime para o último golpe (e você força as trocas novamente).",
      "Garen": "Posicione a lâmina antes do início da rota. A troca mais importante é a primeira. Se você usar seu alcance extra e 'kitar' bem se ele tentar começar a girar com o E para trocar com você, você deve vencer a troca e então conseguir reposicionar a lâmina antes que o E dele volte, e jogar para o nível 2 primeiro e dar 'taunt'. Se ele começar com o Q, a troca fica ainda mais fácil, já que sua passiva pode bloquear o dano. <br> Ao longo da rota, posicione a lâmina constantemente, tente forçar trocas curtas onde você usa W (ou o escudo passivo) no dano do Q dele e o ataca algumas vezes com seus Qs empoderados. Então, depois de usar seus 3 Qs empoderados, você pode usar o 'taunt' para sair através dele enquanto ele ainda está usando o E (ou apenas ficar na luta para a finalização se ele estiver com pouca vida o suficiente). Depois, reposicione a lâmina / espere pelos tempos de recarga. Repita até que ele fique com pouca vida e o force a sair da rota ou o mate.",
      "Jax": "Você precisa punir Jax de forma extremamente agressiva no início para impedi-lo de escalar. Assim como no confronto contra Irelia, um ponto chave é forçar trocas antes que a passiva dele acumule. Posicione a lâmina, então apenas arraste o Q através dele e comece a atacá-lo, e no momento em que ele usar o E, você quer ficar dentro dele e dar 'taunt' para trás para que ele não consiga o atordoamento em você. Quando o E dele estiver em tempo de recarga, você pode continuar trocando. Dessa forma, ele não obtém nenhum valor de seu E, que é sua ferramenta de troca principal. Use o W no início da troca. Para o nível 1, a questão é forçar o E dele sem levar muito dano, fugindo e fazendo com que ele o persiga para o atordoamento, e então retomar o controle da onda de minions quando o E dele estiver em tempo de recarga, já que você tem um tempo de recarga do Q mais curto.",
      "Kayle": "Posicione a lâmina e ameace trocas no nível 1 se ela se aproximar para 'CS'. Se você conseguir bloquear o Q dele com a passiva e trocar ao mesmo tempo, é o ideal, mas não desperdice a posição da sua lâmina para bloqueá-lo a menos que você esteja em uma posição para trocar também. Procure pelo 'all-in' padrão no nível 2. Este é um confronto muito direto. Se você aplicar os conceitos padrão sobre como trocar contra campeões corpo a corpo e como manter o 'slow-push' e, mais tarde, se necessário, punir a Kayle com pouca vida sob a torre, então você deve ser capaz de criar uma vantagem grande o suficiente para que possa 'freezar' a rota após o primeiro retorno à base. Se você tiver uma vantagem, ainda pode vencer trocas após o nível 6, mas quase nunca após o nível 11.",
      "Kled": "Dispute o avanço no nível 1. Durante toda a fase inicial da rota, você quer tentar atrair o Q dele (montado) e desviar. Se você desviar, terá uma janela onde pode vencer as trocas livremente com seus Qs empoderados. Se for atingido, apenas ande para trás para negar a segunda ativação e não será tão ruim. Você vencerá trocas curtas com seus Qs e Ws enquanto guarda seu 'Taunt' para desengajar se ele avançar em você. Mas NUNCA vá para um 'all-in' contra ele a menos que você já o tenha desmontado duas vezes ou ele esteja com pouca vida o suficiente para você ter 100% de certeza de que pode matá-lo antes que ele remonte.",
      "KSante": "Posicione a lâmina no nível 1. Troque com o 'dragthrough' quando ele tentar tocar na sua onda de minions. Não tenha medo de levar um Q aqui ou ali se você vir uma chance para uma boa troca curta, mas também tente atrair Qs sempre que possível e use a pressão do tempo de recarga para manter o controle sobre a onda (sem exagerar sem motivo). Faça 1-2 boas trocas curtas no nível 1 (enquanto reposiciona a lâmina entre elas) para se preparar para o 'all-in' no nível 2 no momento em que o atingir. <br> Para o W dele, tente atraí-lo sempre que possível, já que ele tem que escolher uma única direção, e assim que você o vir sendo usado, mova-se completamente para o lado com base para onde você o viu apontando (use o escudo dele como o indicador visual). Você só precisa dar um pouco de dano nele com algumas boas trocas curtas antes de começar a procurar por 'taunts' agressivos (mesmo se você estiver no mesmo nível). Muitas vezes, é até bom dar 'taunt' nele quando ele tem seu Q empoderado carregado, já que a maioria dos K'Santes não esperará que você seja agressivo durante essa janela, permitindo que você encontre um começo incrível para a troca, e então, quando a duração do seu 'taunt' acabar, dê um passo para o lado, já que ele provavelmente estará apertando o Q repetidamente ao sair do controle de grupo do 'taunt'.",
      "Lillia": "A única força real dela é a velocidade, e a velocidade dela é mais útil quando você a está ativamente perseguindo enquanto troca. Se você apenas posicionar sua lâmina, e esperar que ela se aproxime para trocar (OU para dar o último golpe) e então conseguir um 'dragthrough' garantido, a velocidade dela não é tão valiosa. Certifique-se de trocar com ela apenas até o momento em que ela começar a sair do alcance, e então você guarda os Qs restantes que você não usou, e potencialmente dá 'taunt' nela de forma agressiva quando eles estiverem prestes a expirar (se você tiver certeza de que vai acertar). Mas se você não vir nenhum 'taunt' fácil, então apenas reposicione a lâmina novamente e repita este processo lento repetidamente.",
      "Mordekaiser": "Posicione a lâmina antes da rota. Então puna-o no momento em que ele tentar tocar na sua onda de minions. Não tem problema deixá-lo usar o Q em você uma vez, contanto que não seja isolado e você o bloqueie com sua passiva, então acerte-o 2 vezes e recue (não o persiga para dentro da onda de minions dele e o deixe fazer uma troca longa com você). Se você acabar com um Q sobrando, não use-o nos minions, mas guarde-o para pressioná-lo para longe da onda ou acertá-lo na cara se ele estiver tentando avançar (+75 de alcance é muito bom). Então apenas reposicione sua lâmina atrás dos minions corpo a corpo inimigos e acerte-o com talvez 1 ativação de Agarre do Imortal (mas não o deixe estender a troca, já que seus Qs não estarão empoderados). Então faça 1 última troca antes do nível 2, assim que seu Q estiver pronto novamente (com a passiva). E então ele estará com pouca vida o suficiente para você matá-lo no nível 2 se ele estiver te desrespeitando. Se ele estiver te respeitando e deixando você pegar o nível 2 primeiro, a prioridade número 1 é não avançar demais. Tente conseguir o 'all-in' no nível 2, mas SÓ acerte os minions no último momento em que eles estiverem prestes a morrer, e não antes. Porque se você mantiver o avanço indo MUITO lentamente, ele será forçado a se aproximar para trocas ruins e possivelmente morrer, ou desistir de último golpe após último golpe após último golpe. Quanto mais lento o avanço, mais ele perderá. Mas assim que já estiver avançando agressivamente (sua onda de minions tem tipo 4+ minions a mais), apenas faça-a atingir a torre o mais rápido possível e puna-o sob a torre se ele estiver com pouca vida ou volte para a base se não estiver. Então puna-o dando 'taunt' se você estiver à frente em itens/níveis assim que voltar para a rota, com a ideia de eventualmente impedi-lo de se aproximar da onda e 'freezar'. <br> Dica de mecânica para as trocas: Tente atrair o Q dele entrando levemente no alcance máximo dele e saindo o máximo de vezes possível durante a rota, e se você der 'taunt' e ele tiver o E disponível, ele geralmente estará apertando-o repetidamente para quando a duração do 'taunt' terminar. 'Juke' (drible) com isso em mente e você frequentemente o fará errar e ESMAGAR a troca.",
      "Nocturne": "Posicione a lâmina no nível 1. Comece a troca de trás do seu minion com o 'dragthrough' no momento em que ele tentar acertar qualquer um dos seus minions no nível 1, depois 'kite' para trás após 1-2 Qs empoderados. É importante não deixá-lo fazer uma troca estendida, a menos que ele esteja levando o 'aggro' de toda a sua onda e você não esteja levando nenhum 'aggro' (porque você recuou). Então reposicione a lâmina em uma área aberta (para o lado se necessário, mas lá em cima), e troque mais uma vez com 'dragthrough'+passiva antes que o nível 2 chegue. Então 'all-in' no nível 2 se você o pegar primeiro, ou apenas jogue as trocas mais lentamente, reposicionando a lâmina e usando-a (guardando o 'taunt' para desengajar) se você não pegou o nível 2 primeiro. Continue trocando dessa forma durante toda a rota, e só dê 'taunt' se você tiver certeza de que vence o 'all-in' (se ele estiver com pouca vida ou você estiver um nível acima e você estiver muito perto para ele reagir de forma confiável com o escudo de feitiço dele ao seu 'taunt'). Use seu W no início das trocas e impeça-o de se curar demais com a passiva dele trocando frequentemente (mas por pouco tempo).",
      "Ornn": "Posicione a lâmina. Puna com uma troca de 'dragthrough' (2-3 Qs empoderados) se ele tentar tocar na onda (para avançar ou para dar o último golpe) e então saia do 'aggro'. É importante não avançar demais e tirar uma parte considerável do HP dele (por não muito do seu) toda vez que você decidir trocar, já que trocar significa que você pegará 'aggro' de minion e avançará mais rápido automaticamente. Vá para o 'all-in' no nível 2, e se ele respeitar e você ainda não estiver avançando demais, tente ver se você pode tirar um pouco de XP dele enquanto ele ainda está no nível 1 (assumindo que a 2ª onda já deu 'aggro' corretamente na sua onda, já que você não quer pegar o 'aggro' dela).<br>Tente desviar dos Qs dele, e se ele tiver W, ou desvie, ou tenha o W pronto para bloquear o golpe de **Fragilidade** depois que ele te atingir. Se ele estiver no nível 3+ e usar um Q, sempre considere se ele tem um ângulo para fazer uma troca com E-arremesso ao ar, e respeite isso ficando um pouco longe do pilar, se for o caso. Só dê 'taunt' no nível 6+ se você tiver um motivo sólido para ele não poder dar 'all-in' em você com o R (como ele estar com pouca vida, ou você estar recebendo um 'gank', ou você estar muito à frente).",
      "Poppy": "Posicione a lâmina antes da rota. Não estrague sua lâmina para usar o Q na passiva dela, a menos que você esteja perto o suficiente dela para ter certeza de que pode conseguir no mínimo 1 Q empoderado nela por isso. Então continue reposicionando a lâmina e trocando com ela com Qs empoderados toda vez que ela tentar dar um ataque básico normal na sua onda (você não pode impedi-la de pegar alguns últimos golpes com a passiva dela de vez em quando). Se ela estiver desistindo da prioridade, apenas certifique-se de que você chegará ao nível 2 um pouco antes dela, e vá para o 'taunt' no momento em que você atingir o nível 2 primeiro. Se ambos estiverem no nível 2, ainda pode ser bom dar 'taunt' desde que você tenha certeza de que ela não terá o W e não reagirá a tempo (se você estiver perto dela, ela não consegue). A mesma lógica se aplica a todos os seus 'taunts' posteriores na rota, não tenha medo de usá-lo se você estiver perto dela, você não precisa esperar que ela desperdice o W dela. Não fique perto de paredes quando ela tiver o E, e tente constantemente atrair os Qs dela e trocar quando eles estiverem em tempo de recarga.",
      "Qiyana": "Posicione a lâmina, faça trocas curtas com o Q empoderado se ela tentar bater nos minions, e esteja pronto para avançar quando você estiver prestes a atingir o nível 2 primeiro. Para quando ela estiver no nível 2+, lembre-se que se você der 'taunt' nela do alcance máximo, ela conseguirá ficar invisível antes que o 'taunt' a atinja e então ela será impedida de dar ataques básicos (enquanto invisível!) durante o seu 'taunt', o que estraga todo o seu padrão de troca. Então, só dê 'taunt' quando estiver perto o suficiente para ela não reagir, e você deve vencer. Tenha cuidado ao ficar perto de paredes no nível 6+.",
      "Singled": "Posicione a lâmina e impeça-o de fazer 'proxy' no nível 1. Então puna-o com Qs empoderados se ele tentar envenenar a onda, e garanta o avanço. Continue fazendo 'slow-push' (não 'hard-push') e dando dano nele até ele morrer. 'Neve' (cresça) normalmente, mas preste atenção extra para não perder o PRIMEIRO bom retorno à base que você conseguir, para que você não o deixe ganhar 'tempo', limpar uma onda e começar a fazer 'proxy' enquanto você está a caminho da rota. Se você fizer isso, é um bom confronto, mas se ele conseguir uma posição de 'proxy' e seu caçador não estiver por perto para te ajudar, é terrível.",
      "Sion": "Posicione a lâmina no nível 1. Os Sions geralmente começam no arbusto da rota e carregam o Q nos seus primeiros 3 minions corpo a corpo, não o deixe atingir você também vindo da névoa. Se ele começar com W; apenas pegue o 'dragthrough' para aplicar sua passiva e comece a atacá-lo. Se ele não conseguir o dano da explosão porque você matou o escudo, isso é bom para o seu controle da onda. Então reposicione a lâmina e jogue para trocas curtas quando o Q/passiva estiverem de volta. Tente atrair os Qs dele durante a rota e desvie deles. Se você o fizer, o tempo de recarga é muito mais longo do que se você os cancelar com seu 'taunt'. Mas se você acabar em uma posição onde não pode fugir dele, então é melhor dar 'taunt' para a frente para cancelá-lo, e instantaneamente correr de volta e respeitar após 2 Qs empoderados (antes que ele o tenha de volta). Certifique-se de matá-lo em uma posição onde você tenha uma saída e não morra para a passiva dele. <br> Isso é verdade em qualquer confronto, mas especialmente para Sion, NÃO faça trocas mais ou menos equilibradas e prepare uma finalização onde você vai escapar com a vida super baixa após o abate se ele tiver TP. Então é uma morte que valeu a pena para ele, já que você ficará preso na rota com pouca vida para sempre e ele escalará livremente, ou você fará um retorno à base terrível que resulta no mesmo. É melhor deixá-lo viver por um minuto extra enquanto você se mantém saudável, e então conseguir uma finalização mais tarde onde você está saudável o suficiente para continuar na rota depois que ele voltar com o TP.",
      "Viktor": "Tente encontrá-lo por volta de 1:05-1:25 em algum arbusto da rota superior e comece com o E se você o encontrar e tirar uma boa parte da vida dele. Se você não o encontrar, comece com o Q e tente avançar a onda e negar o 'poke' de Q+ataque básico dele com sua passiva. Use os arbustos para entrar e sair da visão entre os ataques nos minions. Se você estiver prestes a pegar o nível 2 primeiro, posicione-se no alcance para ir para o 'taunt' no momento em que atingir o nível 2. Mas mesmo quando vocês estiverem nos mesmos níveis (2-5), você pode vencer trocas contanto que acerte o 'taunt' e não fique para ser atordoado no W dele. Ele também é um alvo fácil para 'ganks'. Pegue **Velocidade de Aproximação** nas runas se você quiser ter ainda mais pressão de abate 1v1.",
      "Volibear": "Troque no nível 1 com Qs empoderados enquanto monitora o quão perto ele está de ter a passiva totalmente acumulada. Se ele levar 3 Qs empoderados na cara sem revidar, já que ele está tentando acumular a passiva na onda, então você pode temporariamente dar a ele o avanço em troca desse HP. Se ele tentar trocar de volta com você, você ainda deve vencer a troca (não tão facilmente) enquanto também é capaz de lutar para pegar o nível 2 primeiro. Se você pegar o nível 2 primeiro, então vá para o 'taunt' no momento em que o atingir. No nível 3+, você pode facilmente vencer trocas curtas usando Qs empoderados + bloqueando o Q dele com seu W e guardando seu 'taunt' para desengajar, se for necessário.",
      "Yasuo": "Posicione a lâmina e use seu alcance para atacá-lo com 1-2 Qs empoderados quando ele for dar o último golpe e tente pegar o nível 2 primeiro para o 'all-in'. Assim que você atingir o nível 3, você pode começar a vencer trocas um pouco mais longas (mas não 'all-ins' completos) usando seu W para negar dano até que você tenha usado todos os 3 Qs empoderados enquanto guarda seu E para desengajar, se precisar. Quando ele estiver com pouca vida e você quiser finalizá-lo, mas ele estiver avançando com o E para todos os lados, uma dica para acertar seu 'taunt' é olhar para qual minion é o 'alvo óbvio' para o avanço com o E, e assim que ele começar esse E, você pode dar 'taunt' instantaneamente no local onde ele vai chegar.",
      "Yone": "Faça 'slow-push' no nível 1. Comece uma troca com ele se ele usar o Q para 'CS' antes que ele volte. Outra opção é primeiro posicionar a lâmina atrás dele, e então usar o 'dragthrough' no momento em que você se aproximar para deixá-lo usar o Q em você. Então você pode bloquear o dano dele com sua passiva + trocar de volta bem. 'All-in' no nível 2 se você conseguir pegar o nível 2 primeiro. Os únicos Qs de Yone neste confronto que você não pode permitir que o atinjam são os terceiros Qs, então aprenda qual é o alcance exato e fique fora dele quando ele estiver disponível. Após o nível 3, você pode simplesmente dar 'taunt' nele toda vez que o terceiro Q dele for usado, usar W e atacá-lo 3 vezes com Qs empoderados e então desengajar (ele vai te dar um pouco de 'poke' na saída, mas não o suficiente para fazer a troca valer a pena para ele). Repita este processo até que você possa se comprometer com um abate.",
      "Yorick": "Posicione a lâmina à frente e consiga o 'slow-push'. Certifique-se de não avançar demais se Yorick estiver jogando recuado, já que ele só quer farmar sob a torre e você quer forçar trocas. Puna-o agressivamente toda vez que ele tentar se aproximar, ele só tem permissão para farmar com a habilidade de alcance dele. Tente ficar no alcance para dar 'taunt' no momento em que você alcançar o nível 2. Se você conseguir deixá-lo com pouca vida, mas não matá-lo, quando o seu avanço atingir a torre, lembre-se que Yorick é um dos campeões mais fáceis de fazer o 'taunt da torre' (onde você se aproxima, pega o 'dragthrough', então dá um ataque básico e instantaneamente dá 'taunt' para fora da torre e então volta para um último Q empoderado. Ele também levará dano de minion.). Ele é um alvo fácil para 'ganks' se o seu caçador vier."
    },
    "Okay": {
      "Cassio": "Comece com o E e, a menos que ela esteja no meio da própria onda de minions, use o 'taunt' para uma troca estendida. Depois, quando ela estiver com menos vida, você deve ter um bom acesso à onda para forçar o nível 2 primeiro e procurar por um 'all-in'. Para trocas após o nível 2, procure atrair os Qs dela entrando e saindo do alcance, e se aproxime para ver se consegue usar o 'taunt' enquanto a habilidade estiver em tempo de recarga. Lembre-se que, no nível 3+, se você acertar um 'taunt', ela provavelmente vai apertar o W repetidamente quando sair do controle de grupo, então se afaste no momento em que o 'taunt' terminar para não ficar preso. Ela é um alvo fácil para 'ganks', então avise o seu caçador que seu flash está pronto se ele estiver por perto e a situação parecer promissora.",
      "Gragas": "Você deve ser capaz de simplesmente forçar trocas neste confronto em todos os primeiros níveis (1-5). Como ele pode interromper seu 'taunt' com o E, você deve apenas trocar com Qs até que ele use a habilidade, ou se você estiver perto o suficiente para saber que ele não conseguirá reagir ao 'taunt'. Uma coisa especial a se ter em mente é que se ele usar o E em você a partir do nível 3, tente pressionar Q-W instantaneamente, para negar o auto-ataque com o W enquanto você estiver com o controle de grupo, e então continue 'kitando'/'trocando' com ele. Quando ele pegar o **Capítulo Perdido**, a rota passa de fácil a instantaneamente difícil, então você precisa jogar com confiança no início, mas também não de forma muito agressiva, já que uma morte ruim torna impossível trocar com ele pelo resto do jogo.",
      "Gwen": "Posicione a lâmina. Durante o nível 1, você deve trocar com ela uma vez antes que ela se aproxime de 4 acúmulos. Contanto que você cronometre bem sua passiva e o Q dela não seja o empoderado, você pode tranquilamente levar o dano total com sua passiva e atacá-la 2-3 vezes com Qs empoderados. Em seguida, reposicione a lâmina e ataque talvez uma vez enquanto faz isso. Se ela começar com o E em vez do Q, ainda troque agressivamente, mas certifique-se de começar a troca de 75 de alcance e recuar para que ela não consiga um 'all-in' completo sem levar muito dano dos minions. Em geral, tente começar as trocas em seus próprios termos, usando o 'taunt' se ela não estiver com os acúmulos completos. Se ela estiver totalmente acumulada, tente atrair o uso de suas habilidades ou cronometre o 'taunt' para passar através dela e desviar do dano total. Você quer começar as trocas de forma consistente em seus termos, ou ela eventualmente vai te dar 'poke' quando você tentar farmar. Após o nível 6, quando ela tiver o R, nunca use o 'taunt' a menos que ela esteja com pouca vida o suficiente para você a 'oneshotar' durante o 'taunt', mas você ainda pode fazer trocas curtas e usar o 'taunt' para trás se estiver meio perto da sua torre.",
      "Illaoi": "Troque no Nível 1 com Qs empoderados, depois consiga o 'slow-push' e procure por um 'all-in' no nível 2. Quando ela pegar a habilidade E, certifique-se de se esconder atrás da sua onda de minions e comece as trocas através dos minions enquanto ela farma. Você vence as trocas cedo, contanto que seja você quem a está empurrando, mas se você for empurrado para debaixo da sua torre, não há como vencer as trocas a menos que você desvie literalmente de cada E, o que é irrealista. Tenha como objetivo matá-la no nível 3 e criar um 'freeze' após o seu primeiro retorno à base.",
      "Irelia": "Posicione sua lâmina à frente na rota no nível 1 e esteja pronto para punir com um 'dragthrough' se ela usar o Q em um minion seu com pouca vida. Com a passiva acumulada, ela pode simplesmente te fatiar e te matar, mas se você constantemente se certificar de puni-la assim que ela começar a acumular, isso custará muito do HP dela para chegar a esse ponto de acúmulo total. 'All-in' no nível 2 como sempre. Se você jogar os primeiros 2 níveis corretamente, não importará se você falhar em desviar de um dos atordoamentos dela, já que ela não será capaz de dar 'all-in' em você de qualquer forma por causa da sua vantagem de XP (você já estará no nível 3 ou prestes a estar). Lembre-se que o E dela é meio estranho e difícil de acertar se você se mover para frente e para trás em padrões aleatórios. Se você desviar de um E, esteja pronto para punir. Tenha cuidado com o 'all-in' instantâneo do nível 6 dela, então monitore como a situação de XP entre vocês dois deve estar quando ambos estiverem no nível 5.",
      "Jayce": "Comece com o Q no nível 1 e veja como ele joga. Ataque a onda de minions inimiga o máximo que ele permitir. Se ele não estiver pronto para punir você, você pode conseguir o avanço antes que ele perceba o que está acontecendo, e então você pode mantê-lo, dando mais ataques básicos nos minions enquanto ele está ocupado tentando recuperar o avanço. Então você vai para o 'all-in' com 'taunt' no momento em que atingir o nível 2. Se Jayce estiver pronto para impedi-lo de bater na onda no nível 1, então apenas economize HP, não perca XP e pegue o 'CS' que você achar que pode enquanto se mantém com a vida quase cheia. Em seguida, procure por 'taunts' quando ambos estiverem no nível 2 ou 3 (no nível 3 você vence facilmente se acertar, no nível 2 você ainda deve vencer, mas não tão facilmente). Certifique-se de usar constantemente seus minions como uma parede contra o Q ou o Q-E dele na rota, e muitas vezes fique na borda do alcance do seu 'taunt' para não telegrafar para ele quando você realmente for usá-lo. Depois de acertar um 'taunt', lembre-se que ele logo usará o empurrão do martelo, então se você estiver MUITO mais saudável e ele não puder te matar nem em um 'all-in', 'kite' e posicione-se entre ele e a torre dele para que ele não possa desengajar com isso. E se ele estiver saudável o suficiente para você não querer estender mais a troca, 'kite' em direção à sua própria torre para que ele te empurre para a segurança se ele usar a habilidade. Ele também é muito vulnerável a 'ganks'.",
      "Karma": "Se você a encontrar por volta de 1:00-1:30 não perto dos minions, comece com o E e vá para uma troca longa. Se você não conseguir um 'taunt' cedo, comece com o Q e dispute o avanço enquanto tenta desviar do dano do Q dela. Você quer evitar ser empurrado para debaixo da torre. É possível dar 'taunt' na Karma para alguns ataques básicos empoderados, mas ela revidará pesadamente em você quando você fugir. Mas mesmo que pareça inútil quando ela continua se curando, vale a pena fazer trocas equilibradas para que ambos fiquem com pouca vida por volta do mesmo HP, porque então seu 'all-in' será capaz de 'burstá-la' instantaneamente com um 'taunt' + flash antes que ela consiga se curar, assim que ela estiver com pouca vida o suficiente. Se você estiver perdendo as trocas iniciais, então tente economizar HP para um R no nível 6.",
      "Kaynwithsmite": "A versão mais assustadora de Kayn no topo é aquela que vai para o modo 'full cheese' e pega 'smite' para atrapalhar seu caçador 24 horas por dia, 7 dias por semana. Então você só precisa perceber em quais momentos você pode segui-lo com base na leitura do estado da sua onda de minions. Se ela estiver avançando lentamente para longe de você quando ele 'roamar', você precisa ajeitar sua onda antes de seguir. Se ela estiver avançando lentamente em sua direção, você geralmente tem uma janela para seguir, contanto que você volte para a rota superior a tempo de pegar a onda antes que a torre a mate.",
      "LeeSin": "O nível 1 é um pouco assustador com o 'slow' do E + passiva + Conquistador, então nunca o deixe fazer uma troca estendida no nível 1. Tente conseguir o 'slow-push' mesmo assim, enquanto faz apenas trocas de 1 ataque básico usando seu alcance extra. O nível 3 é quando você começa a vencer as trocas curtas de forma muito fácil se você pegar um 'dragthrough' e usar o W cedo (guardando o E para 'taunt' para fora), mas o nível 2 também é viável. Nunca dê 'taunt' para a frente a menos que você tenha vantagem de nível (ou ele já esteja com pouca vida). Fique atrás dos seus minions durante as trocas o máximo possível para negar Qs fáceis para ele. Seja paciente, mas não tenha medo, se você forçar demais, isso vai dar errado, mas você também quer aumentar sua vantagem nos níveis 3-5.",
      "Lucian": "Você pode tentar conseguir o nível 2 primeiro, dando ataques básicos nos minions no nível 1, mas se ele for apropriadamente agressivo, então apenas fique recuado (usando arbustos) e deixe-o avançar enquanto você economiza HP. Nunca perca XP e se mantenha com 80% de vida ou mais. Então podemos trocar dando 'taunt' no nível 3+ se ele avançar para dar 'poke'. Evite se aproximar dele toda vez que o ataque duplo dele estiver disponível. Ele só terá um dano realmente assustador se ele usar o E para persegui-lo, mas é aí também que você tem a chance de acertar um 'taunt' livre. Se ele nunca usar o E em você, então apenas farme e negue 'poke' com a passiva + W quando necessário. Ele também é extremamente suscetível a 'ganks', e se ele morrer para 1 'gank', ele morrerá para os próximos 2 'ganks' também.",
      "Renekton": "Posicione a lâmina no nível 1. Não o deixe acumular fúria de graça quando ele chegar na rota, e comece a puni-lo com Qs empoderados, você deve vencer as trocas de forma razoavelmente fácil no nível 1. Então reposicione a lâmina e espere pelos tempos de recarga, e tente fazer mais 1 troca antes que ele pegue o nível 2. Por causa da limpeza de onda muito forte dele com o Q, você pode não conseguir deixá-lo com pouca vida rápido o suficiente para retomar o avanço e pegar o nível 2 primeiro. Se for esse o caso, então respeite-o no nível 2 para que ele não possa dar 'all-in' em você durante essa janela. Se ambos estiverem no nível 2 e ele estiver com menos vida, tente pegar o 'dragthrough' da melhor forma possível SEM usar o E, para que você possa desengajar (ou persegui-lo se for claro que ele vai morrer) depois de ter usado seus 3 Qs empoderados. <br> Para trocas mais tarde (quando ambos estiverem no nível 3+), não tente guardar seu W para um 'momento perfeito' mais tarde na troca, isso muitas vezes apenas levará a você sendo atordoado por acidente no início da troca. Em vez disso, apenas use-o como a primeira coisa que você faz (sem sobrepô-lo com a passiva) e desengaje antes que ele consiga sequer usar o W dele. Mantenha as trocas curtas dessa forma até que ele possa ser finalizado.",
      "Rengar": "Como ele fica no arbusto, exceto quando dá o último golpe em um minion ou pula em você, sua única janela para fazer boas trocas é quando você sabe que ele vai pular para um último golpe. Até então, apenas posicione-se no lado da rota em direção ao rio (longe dos arbustos), e então fique logo fora do alcance do arbusto, mas perto o suficiente do seu minion morrendo para usar o 'dragthrough' assim que ele pular. Comece acertando-o com pelo menos 2 Qs empoderados e depois recue para fora do alcance dele se ele tentar voltar para o arbusto. Tenha cuidado com ele quando ele tiver acúmulos de Fúria completos ou quase completos, e troque mais quando a barra dele estiver baixa ou vazia. No nível 3+, você deve negar os Qs dele com seu W e usar o 'taunt' para sair (através dele, se possível) se ele tentar estender a troca. Uma vez que ele estiver com muito menos vida que você, você pode simplesmente dar 'taunt' para o abate (especialmente se você tiver **Incendiar**).",
      "Riven": "Posicione a lâmina no nível 1 antes da rota. Então, quando os minions chegarem, você deve tentar usar o 'dragthrough' e acertá-la assim que ela tentar conseguir o avanço, mas esteja pronto para 'kitar' para trás instantaneamente depois de acertá-la com 75 de alcance extra, para que ela tenha que usar 1-2 Qs para te alcançar e não ser capaz de dar o dano máximo com ataques básicos entrelaçados (sua posição quando você começa esta primeira troca é fundamental, fique logo atrás dos seus minions corpo a corpo, não na frente deles, ou ela será muito mais assustadora). Se você a forçar a trocar dentro da sua onda de minions assim, ela não tem o dano para te levar de 100 a 0, então ela será forçada a desengajar enquanto a troca ainda é favorável a você. Este padrão de troca é verdadeiro durante toda a rota mais tarde também. 'Kite' para trás após 1 Q empoderado e apenas quando ela estiver com um pouco de dano você pode pensar em dar 'taunt' agressivamente (geralmente na situação em que ela está com dano E você tem 1-2 Qs empoderados restantes para fazer uma troca de 4-5 Qs empoderados seguidos). Use o W cedo nas trocas para que, se ela usar o W dela, você estará protegido, para que ela não possa encontrar uma boa troca curta e sair com o E.<br> Nunca dê 'taunt' para a frente a menos que você tenha um bom motivo para isso não dar errado em uma troca estendida depois que seus Qs acabarem.",
      "Rumble": "Posicione a lâmina no nível 1 antes da rota. Se ele começar com o Q, assim que ele usá-lo, use seu 'dragthrough' e ande em direção a ele e comece a atacar. Se ele continuar te acertando com todo o Q, ele vai perder, já que você tem a passiva para bloquear parte disso, e mais dano em uma troca curta, enquanto se ele se virar, o dano do Q dele em você é reduzido. Se ele começar com o E, então se esconda atrás dos seus minions, e deixe-o dar o último golpe em o que ele quiser com os Es dele, mas esteja pronto para puni-lo com um 'dragthrough' no momento em que ele tentar bater ou dar o último golpe em seus minions com um ataque básico normal. Lute pelo nível 2 dessa forma, seja dando dano no HP dele e eventualmente forçando-o a sair da onda, ou apenas o ameaçando para fora da onda a ponto de você pegar o nível 2 automaticamente. Esteja pronto para 'all-in' no momento em que você atingir o nível 2, e quando ficar claro que a onda já está avançando lentamente em direção ao Rumble, então não avance demais, já que você quer maximizar sua janela de troca antes que sua onda atinja a torre dele. Apenas dê 'taunt' de forma agressiva se você tiver uma vantagem de nível ou se Rumble já estiver com muito menos vida que você. Não subestime o dano de superaquecimento dele, então seja muito respeitoso, a menos que você tenha o W pronto ou possa 'oneshotá-lo' antes que ele comece a explodir de dano.",
      "Smolder": "Tente encontrá-lo por volta de 1:05-1:25 em um arbusto da rota superior, se você o fizer, comece com o E e faça uma troca estendida até que ele esteja com pouca vida. Se você encontrar essa troca, você pode facilmente controlar a onda para pegar o nível 2 primeiro, quando ele ainda não tiver a habilidade 'Flap-Flap', e matá-lo. Se você não encontrar a jogada 'cheese' no nível 1 em um arbusto, comece com o Q e tente igualar o avanço da melhor forma possível, enquanto bloqueia o 'poke' dele com a passiva e entra e sai dos arbustos muitas vezes. Se ele se concentrar demais em te dar 'poke', você pode pegar o nível 2 primeiro para dar 'taunt' (mesmo se você estiver com um pouco de dano nesse ponto, você ainda vence facilmente se ele ainda estiver no nível 1). Se ele se concentrar em igualar o avanço sem te dar 'poke', continue avançando o máximo que puder e procure por 'taunts' quando tiver certeza de que os acertará nos níveis 2-3. Se você pegar a runa **Velocidade de Aproximação**, não tem problema errar o 'taunt', já que você posiciona a lâmina bem à frente em preparação para o aumento de velocidade de aproximação para o próximo Q. Se você estiver perto dele quando aplicar o aumento de velocidade de **Velocidade de Aproximação**, então você pode acertar o 'taunt' quando ele estiver no meio do 'Flap', mas também é bom forçar o 'Flap-Flap' dele com a aproximação, para então se mover para frente e para trás e procurar por um 'taunt' quando estiver em tempo de recarga.",
      "TahmKench": "Este confronto é todo baseado em você tentar dar 'poke' nele com Qs empoderados usando seu alcance extra enquanto fica logo atrás dos seus minions corpo a corpo para que ele não possa usar o Q em você. Dê 'poke' nele aos poucos, e procure reposicionar sua lâmina, e não o persiga para usar todos os 3 Qs empoderados. Se você der a ele apenas chances limitadas de usar o Q em você, então também é mais fácil desviar deles. Toda vez que você desvia de um Q, isso te dá total liberdade para reposicionar a sua lâmina para a próxima troca. Quando ele pegar 2 acúmulos em você, certifique-se de não prolongar a troca, a menos que você tenha 100% de certeza de que pode se esconder atrás dos seus minions para que ele não possa usar o Q em você com acúmulos completos para o atordoamento. Dê 'taunt' apenas quando ele estiver com 50-60% de HP por causa de trocas curtas (ou você tiver uma vantagem de nível).",
      "Trundle": "Posicione a lâmina e faça trocas curtas usando seu alcance extra sem deixá-lo estender para um 'all-in' no nível 1 ('kite' para trás entre os ataques básicos se ele tentar persegui-lo para dentro da sua onda de minions). Se você conseguir vencer algumas trocas iniciais, então tente afastá-lo da onda para que você possa pegar o nível 2 primeiro e ir para o clássico 'all-in'. A forma como Trundle troca é muito distinta e fácil de prever e de jogar contra. Ele vai começar com o Q em você, então apenas certifique-se de bloqueá-lo com seu escudo passivo ou seu W. Nunca dê 'taunt' primeiro a menos que você esteja um nível acima ou a diferença de HP seja grande o suficiente para que você saiba que pode facilmente matá-lo se ele tentar lutar. Após o nível 6, continuamos a manter o padrão de trocas curtas, e lembre-se que, a menos que ele esteja com um HP que possa ser 'oneshotado', a cura do R dele fará com que ele vença a luta se você usar o 'taunt' para a frente.",
      "Vayne": "Tente encontrá-la nos arbustos da rota superior antes dos minions, por volta de 1:05-1:25, e comece com o E e lute com ela se você a encontrar. Se você não a encontrar cedo e ela for para a rota protegendo a onda de minions dela, então você pode: <br>-jogar de forma segura e começar com o Q e pegar o 'CS' que puder sem perder muito HP (foque em pegar todo o XP e se manter com mais de 80% de vida até o nível 3). <br>-Começar com o E mesmo assim e tentar acertar um 'taunt' e 'kitar' para dentro dos arbustos depois de acertá-la 2-3 vezes. <br>Então, após o nível 3, tente encontrar ângulos de 'taunt' usando bons 'mindgames' e movimento. Se você não deixar óbvio quando está tentando dar 'taunt', na verdade é bastante difícil para as Vaynes reagirem corretamente com o E para cancelar seu 'taunt'. E se elas usarem o E em você depois que a duração do 'taunt' acabar, você já causou dano suficiente para valer a pena, e você pode apenas desengajar (ou se ela estiver com pouca vida e você estiver saudável, apenas fique entre ela e a torre dela para que ela ainda esteja em perigo mesmo se ela usar o E). Muitas Vaynes usarão seus Qs o tempo todo para dar 'poke' melhor, o que as torna mais vulneráveis a mais 'taunts'. Se você estiver jogando contra uma Vayne que sempre fica em uma distância segura com o Q ainda disponível, então apenas economize HP, e o 'poke' dela não será super assustador. Ela também é super frágil a 'ganks'."
    },
    "Hard": {
      "Aatrox": "Posicione a lâmina no nível 1, depois faça trocas com o Q empoderado se ele tentar dar um ataque básico em algum 'CS'. Tente usar a passiva para bloquear o primeiro Q dele se puder, mas não é necessário para vencer. Você deve ser capaz de acertar o 'taunt' no nível 2 ou afastá-lo para que ele perca um pouco de XP antes que a terceira onda de minions chegue. A partir do nível 3, lembre-se que o W dele tem um tempo de recarga 2 segundos maior que o seu E. Então, se você forçá-lo em uma troca, tente se posicionar para dar 'taunt' no instante em que ele voltar do tempo de recarga para uma troca com vitória garantida. Tente se mover para atrair o E dele e desvie se puder, então faça trocas agressivas enquanto ele estiver em tempo de recarga. Respeite o 'all-in' do nível 6 se você ainda não tiver uma grande vantagem nesse ponto.",
      "Aurora": "-Desviar <br>-4 segundos de diferença entre o seu 'taunt' e o W dela <br> -Com o **Escudo de Doran** e a **Segunda Pelaa** você pode se regenerar se ambos ficarem com pouca vida <br> -Nível 1-2 jogue de forma segura, nível 3+ faça trocas se você não estiver com muito dano de 'poke' até então (ou nível 2 se você desviar de um Q) <br> -Prepare para 'ganks' <br> -Pequeno tempo de conjuração para o E dela",
      "Fiora": "Baseie seu movimento em onde a **Vital** atual está em você. Sua melhor maneira de começar uma troca é ser capaz de conseguir um 'dragthrough' ao mesmo tempo em que ela avança para uma **Vital** e bloquear o dano dela com a sua passiva que irá ativar, e então revidar com pelo menos 1, e de preferência 2, Qs empoderados (use seus Qs restantes se a oportunidade surgir). As 2 vezes em que você pode usar o 'taunt' de forma agressiva neste confronto é se Fiora já usou o W dela OU ela está perto o suficiente de você para que você tenha certeza de que ela não conseguirá reagir com o W dela a tempo. Eu recomendo jogar este confronto de forma agressiva e testar os limites do 'taunt', mesmo quando ela tem o Q pronto, para aprender quando as Fiora's são capazes de reagir ou não. Se você não deixar óbvio que está procurando por um 'taunt' com seus movimentos, você pode frequentemente vencer o jogo mental, o que pode ser uma virada de jogo.",
      "Gangplank": "Gangplanks gostam de se esconder com um barril no arbusto da rota no início, então se mova em direção ao rio se ele ainda não estiver visível e comece a avançar. Se ele estiver visível, tente conseguir o avanço enquanto descobre se ele começou com o Q ou o E. Se ele começou com o Q, tente bloquear os Qs dele com seu escudo passivo e avance para o nível 2 primeiro. Se ele começou com o E, tente trocar de forma agressiva para impedi-lo de limpar a onda livremente. Se você conseguir o nível 2 primeiro, vá em frente com o 'taunt'. Caso contrário, apenas bloqueie os Qs dele com sua passiva ou W, e mantenha seu HP alto. Nível 3-5, se ele estiver em um barril com 1 de vida, tente acertar um 'taunt' e acertar o barril primeiro enquanto ele usa o W, depois troque com o W e então saia. Se você estiver sendo empurrado e sentir que não pode dar 'taunt', então apenas o deixe usar o Q em você quando sua passiva ou W estiverem prontos, e de outra forma, fique apenas fora do alcance do Q dele.",
      "Graves": "Graves é tanque para um campeão de longo alcance e o dano em área dele torna difícil controlar a onda. Use sua passiva e W para se manter com a vida cheia. Ele geralmente não pode te punir muito se seu 'taunt' estiver disponível, então use o 'taunt' apenas se você tiver certeza de que a troca é vitoriosa (porque ele desperdiçou algumas habilidades chave ou ele entrou na sua onda de minions completa ou você está preparando para um 'gank'). Basicamente, jogue de forma passiva e espere por erros inimigos.",
      "Heimerdinger": "Você não pode disputar o avanço nem dar 'taunt' nos minions dele, então apenas fique recuado e conserve seu HP até que ele se afaste de todas as torres (e você esteja no mesmo nível), então podemos dar 'taunt'. A outra opção é dar 'taunt' nele debaixo da sua torre ou esperar por um 'gank'. A única coisa que o salva é que seu W bloqueia os ataques básicos das torres dele, o que pode ser útil para sobreviver. A principal coisa a tentar desviar é o E dele. Se você for forçado a se aproximar dele para farmar debaixo da sua torre ou por algum outro motivo, concentre-se em prever quando ele tentará te atordoar com o E, e desvie. Se você conseguir isso, o dano dele não é tão alto. Se você sobreviver à rota até o nível 6 sem ficar com pouca vida ou ter que usar o TP para a rota (difícil, mas às vezes é possível), então você tem um R livre para a rota inferior, onde você pode voltar para a base e usar o TP de volta para a rota depois.",
      "Kennen": "Se você o encontrar na janela em que ele não tem mais tempo para voltar para a base (1:10-1:30) e ele parecer suscetível a 'taunt', comece com o E e tire metade da vida dele, espere o E novamente e jogue de forma agressiva. Se você não o encontrar, você *ainda pode* começar com o E e jogar para ter um posicionamento melhor que ele, mas se você errar, você está meio que ferrado. Você também pode começar com o Q, mas então é muito difícil vencer a rota no início, e você apenas aceita ser empurrado e mantém seu HP alto. Este confronto se resume a se você pode pegar Kennen desprevenido com seus 'taunts' ou não, já que se você for previsível, ele sempre pode usar a velocidade de movimento do E para fugir do 'taunt'. Mas se você conseguir um 'taunt' nele, você vence a troca facilmente, especialmente porque eles frequentemente usarão o E logo antes de serem atingidos e o colocarão em tempo de recarga para quando o 'taunt' terminar. Se o seu caçador estiver no topo, avise que seu flash está pronto e esteja pronto para ir com 'taunt' + flash no momento em que seu caçador estiver no alcance para seguir. Kennen é muito frágil a 'ganks'.",
      "Olaf": "Chegue cedo na rota para posicionar a lâmina. Então, se ele não vier para a rota com os minions dele, comece a atacar os minions corpo a corpo no momento em que eles chegarem para colidir com sua onda. Na maioria dos confrontos, isso seria um avanço excessivo, mas contra coisas como Olaf que têm uma tonelada de limpeza de onda e potencial de 'all-in' no nível 1, isso facilita as coisas. Se ele chegar a tempo de proteger os minions dele, então fique atrás dos seus minions corpo a corpo e tente um ataque básico com 'dragthrough' quando ele tentar bater nos seus minions. Mas esteja SUPER pronto para recuar após o primeiro ataque básico antes que ele possa começar um 'all-in' favorável em você. Se ele tiver que persegui-lo para dentro da sua onda completa, e ele já estiver com 'poke' do seu primeiro ataque básico, ele terá dificuldade em 'oneshotar' você (especialmente se você estiver usando **Incendiar**). Também tente ver se você pode desviar/prever o lançamento do Q dele, então é uma vitória garantida. <br> Jogar dessa forma é um pouco arriscado, mas se der certo e você tirar um bom pedaço ou 2 da vida dele de graça, então você pode garantir o nível 2 primeiro e esmagar o confronto a partir daí. Se você não se sentir confiante em seu movimento, você também pode apenas desistir do avanço no nível 1-2 e pegar todo o XP e o farm que puder enquanto evita o 'all-in' dele, e começar a trocar no nível 3+ com 'dragthrough'+W e guardando o E para desengajar. A coisa mais assustadora neste confronto é se ele conseguir 'freezar' a onda na frente da torre dele no nível 4+ e puder dar 'all-in' em você a qualquer momento que você for pegar um minion. Então valorize seu HP MUITO altamente se houver a possibilidade de um estado de rota como esse em um futuro próximo, e avise o seu caçador para te ajudar se não houver outra maneira. Não dê 'taunt' para a frente neste confronto a menos que você tenha absoluta certeza de que pode 'oneshotá-lo' (ou você está basicamente na sua torre), já que a combinação de roubo de vida/escudo dele é louca quando ele fica com pouca vida e você está sem habilidades.",
      "Quinn": "Tente sobreviver e se manter saudável da melhor forma possível nos níveis 1-2, usando seu escudo para farmar. No nível 3+, você pode tentar pegá-la desprevenida com um 'taunt' e esperar que ela não o cancele a tempo. Se você conseguir, isso é uma grande vitória em termos de troca, e se ela reagir a tempo, você geralmente sai bem se você tiver a passiva+W e apenas fugir (só tome cuidado para fazer isso no lado dela da rota, já que sua torre está muito longe nesse caso). E se ela for uma jogadora que usa o E de forma agressiva para dar 'poke' em vez de esperar você dar 'taunt', então é claro que você a pune dando 'taunt' enquanto o E dela estiver em tempo de recarga. Se ela continuar empurrando você para debaixo da torre, você pode tentar dar 'taunt' + flash nela quando ela estiver no alcance da torre E sua torre estiver prestes a atacar. Se você se mantiver posicionado atrás dela, ela terá que eventualmente usar o flash no E para escapar enquanto está com pouca vida (porque se ela usar o E em você, ela voará para dentro da sua torre). Ela também é muito vulnerável a 'ganks' se você tiver o flash disponível. Ela escala muito mal a menos que consiga se 'nevar'. Lembre-se de alertar seu midlaner se ela estiver no nível 6+ e desaparecer. Ela é muito rápida.",
      "Teemo": "Tente ver se você pode encontrá-lo no nível 1 antes que os minions cheguem, por volta de 1:05-1:20 (difícil, já que ele provavelmente está invisível em algum lugar, mas você pode tentar). Se você o encontrar, então comece com o E e dê 'all-in' nele. Se você não o encontrar, então comece com o Q e veja se ele está atrasado para a rota. Se estiver, então ataque os minions constantemente para ter mais facilidade em pegar o nível 2 primeiro. Se ele começar na rota, você não pode fazer isso, então apenas conserve HP e o deixe empurrar você, e espere pelos níveis. <br> A parte difícil de trocar com Teemo é o tempo de recarga baixo do Q dele, já que ele pode conseguir 2 Qs em um único 'all-in'. Então você só pode dar 'taunt' quando você está: <br>-Um nível acima <br>-Debaixo da torre <br>-Ele está meio perto de arbustos para que você possa recuar para lá depois e sair da visão <br>-Recebendo um 'gank' <br>-Ele está usando o Q para te dar 'poke' <br>-Ele já está com dano (para 60% de HP ou menos) <br>Se nenhuma dessas coisas for verdade, você apenas vai perder mesmo se acertar o 'taunt', então apenas espere por 'ganks' de outra forma.",
      "Udyr": "Tenha uma mentalidade semelhante a quando você está jogando contra um Warwick no topo, no sentido de que você pode vencer todas as trocas curtas se você tiver sua lâmina posicionada e suas habilidades defensivas prontas, mas você nunca pode criar e realmente manter uma vantagem a menos que o inimigo cometa um erro, e isso vai dar errado se você der 'taunt' (a menos que você esteja um nível acima). <br> Para o nível 1, depois de ter posicionado sua lâmina, tente bater na onda dele 4-6 vezes assim que ela sair do alcance da torre dele se ele não estiver lá para te punir. Se você for permitido a fazer isso, então você pode fazer trocas bem agressivas no nível 1, mesmo que elas acabem sendo bem equilibradas (o que geralmente é ruim), já que você terá o nível 2 primeiro. Se ele vier com a onda no nível 1, então apenas esteja pronto para desistir do avanço e fazer trocas muito curtas sem realmente se comprometer, já que a nevasca dele (R-R) irá persegui-lo depois que você pensar que a troca acabou. Continue jogando os primeiros níveis com trocas super curtas apenas quando você tiver a passiva/W para negar qualquer tipo de revide, já que não adianta fazer trocas onde você está com 60% e o Udyr com 20%, já que a cura dele é meio louca (e ele é incrível em se manter vivo com pouco HP através do seu dano 'burst' com o W empoderado dele). Ele é bastante suscetível a 'ganks' no início se você fizer algumas boas trocas curtas (sem dar 'taunt'), então troque com base em quão perto/longe seu caçador está, mais do que em outros confrontos.",
      "Vladimir": "EU ESTOU AQUI<br>Tente encontrá-lo nos arbustos da rota superior (rio, triângulo, rota) por volta de 1:05-1:25 e comece com o E se você o encontrar e tire uma boa parte da vida dele. Se você conseguir isso, você pode continuar usando o E nele em tempo de recarga na onda de minions até que ele morra ou seja forçado a voltar para a base. Se você não o encontrar, comece com o Q e iguale o avanço dele e tente pegar o nível 2 primeiro enquanto leva o mínimo de 'poke' usando arbustos/passiva. Se você conseguir, dê 'taunt' no momento em que você atingir o nível 2. Tente encontrar chances de dar 'taunt' durante a rota onde ele não tenha a barra de Q totalmente acumulada, e se ele usar a **Poça de Sangue**, então tente abusar da janela de 10 segundos onde seu E (18s de tempo de recarga) está de volta, mas a poça dele (28s de tempo de recarga) não está. <br> Tente avançar com o Q no início para que ele avance lentamente em direção a ele enquanto você bloqueia os Qs dele com seu escudo passivo. Se você conseguiu avançar mais rápido, então ande em direção a ele logo antes de você atingir o nível 2 e instantaneamente dê 'taunt' quando você atingir o nível 2 para uma troca. Se ele escolher o E no nível 2, continue punindo-o. Uma vez que ele tiver a poça dele, tudo se resume a forçá-lo a usá-la dando 'taunt' para uma troca, e então usar o longo tempo de recarga da poça de 28 segundos para dar 'taunt' novamente quando o seu 'taunt' estiver de volta. Posicione a lâmina à frente na rota entre os 'taunts', para que você possa conseguir o 'slow' inicial com o Q.",
      "Warwick": "Warwick no topo gira completamente em torno de ficar com pouca vida e então atrair o inimigo para dar 'all-in' nele e ser surpreendido com o quanto ele pode se curar. Portanto, apenas posicione sua lâmina atrás da onda de minions inimiga e procure por trocas curtas com 'dragthrough' e dê 'poke' nele ao longo do tempo. E então, quando você contra qualquer outro campeão daria 'taunt' para o abate, contra WW você apenas continua jogando da mesma forma que faria se ele tivesse vida cheia ATÉ que ele esteja com pouca vida o suficiente para você 'oneshotá-lo' dentro do 'taunt', então apenas use 'taunt' + flash em cima dele antes que ele consiga se curar de alguma forma. Lembre-se de respeitar a **Barreira** e contabilizá-la em seus cálculos antes de decidir usar o flash de forma agressiva (se ele a tiver)."
    },
    "VeryHard": {
      "Akshan": "Na maioria dos confrontos contra campeões de longo alcance, você pode começar com o E e tentar encontrá-los em um arbusto antes que os minions cheguem. Não faça isso contra o Akshan. O ataque básico duplo dele é muito forte no início. Comece com o Q e deixe-o controlar a onda e empurrar você. Pegue os últimos golpes que puder usando a passiva/arbustos para reduzir o 'poke' dele, mas também esteja disposto a abrir mão de muitos últimos golpes para se manter saudável. Apenas use o 'taunt' quando: <br> -Você estiver recebendo um 'gank' do seu caçador <br> -Akshan usar o E para a frente e você ainda estiver saudável <br> -Você estiver no nível 3+ e ele estiver perto ou debaixo da sua torre (para que você possa manter a troca curta e se colocar em segurança) <br> Akshan geralmente depende muito de conseguir abates cedo e 'nevar', então mantenha a calma e lembre-se que seu objetivo principal é sobreviver e estar pronto para puni-lo quando ele ficar impaciente ou errar.",
      "Kalista": "Kalista no nível 1 é completamente inútil. Se ela estiver jogando na sua cara, você pode ter que até abrir mão de XP inicialmente, mas tente pegar o XP que puder enquanto se mantém saudável. Se você conseguir se manter em XP e não ficar com pouca vida, então no nível 3+, você pode vencer 'all-ins' se acertar o 'taunt'. Mas se você estiver atrás em XP ou com pouca vida, a única coisa que você pode fazer é esperar pelo seu caçador. A principal razão pela qual Kalista não é muito escolhida no topo é porque ela morre para cada 'gank' e estará fora do jogo assim que morrer para 2+ 'ganks'.",
      "Neeko": "Eu realmente não sei como lidar com este confronto. O W e o E dela são muito bons para te impedir de dar 'taunt' para trocas, e o 'poke' dela é muito forte. E ela foge de 'ganks' com o W super rápido e enraíza o caçador com o E. Eu acho que a melhor coisa que você pode fazer é apenas tentar o seu melhor para farmar enquanto se mantém o mais saudável possível (boa sorte) e torcer para que ela cometa um erro debaixo da torre e se abra para um 'taunt'. Se não, apenas aceite a rota perdida e tente ajudar outras rotas com o R. Se você conseguir acertar um 'taunt' enquanto ela estiver usando o E, essa é a única janela onde pode ser possível vencer uma troca, mas se você errar o 'taunt', você será punido severamente por isso, então prossiga com cautela. <br><b>Jogadas que você pode tentar:<b> <br>-Comece com o E no nível 1 e tente dar 'taunt' nela no momento em que ela parar para usar o Q/E. (idealmente onde ela não está no meio da onda completa de minions para que você possa rapidamente sair do 'aggro' depois de 3-4 ataques básicos) <br>-Durante toda a rota, tente atrair o uso do E dela com movimentos agressivos e desvios para o lado, e então use o tempo em que a habilidade estiver em tempo de recarga para tentar 'taunts'.",
      "Sett": "Posicione a lâmina antes da rota, e também tente ver se ele não está protegendo a onda de minions dele enquanto ela sai do alcance da torre inimiga. Se for o caso, consiga o avanço no nível 1, batendo nela 4-5 vezes com ataques básicos normais (guarde seu Q). Se você conseguir o avanço, você pode procurar por trocas como em qualquer outro confronto corpo a corpo e eventualmente procurar pelo 'all-in' no nível 2. Se ele começar na rota e você não conseguir o avanço a seu favor, então apenas aceite que ele vai te empurrar e pegue o 'CS' que puder e conserve seu HP e jogue pelos Rs no nível 6. O W dele tem um tempo de recarga muito longo no início, tenha isso em mente e abuse disso se ele o desperdiçar. A passiva dele não só o ajuda a avançar, mas é muito forte para trocar se a troca for estendida, então certifique-se de que você tem uma maneira de desengajar ou de estar em uma posição para matá-lo o tempo todo quando for fazer trocas."
    },
    "Challenging": {
      "Darius": "No início do jogo, posicione a lâmina na rota sem se aproximar de nenhum arbusto, ele pode tentar usar o fantasma+W para dar 'all-in' em você, então não a posicione muito à frente. Quando a onda de minions chegar, faça uma troca curta quando ele atingir sua onda com um Q empoderado, mas foque em descobrir se ele começou com W ou Q. Se ele começou com Q, tente se aproximar dele para negar a cura e dar 3 ataques básicos e recuar. O potencial de 'all-in' dele é realmente fraco no nível 1 com Q, então não precisa ter medo disso. Se ele começar com W, a troca curta dele é ruim, mas o 'all-in' é forte, então não vá muito para a frente para a troca, mas fique dentro da sua onda de minions quando você começar a troca curta. Se a primeira troca for bem em termos de HP para você, tente disputar o avanço. Caso contrário, deixe-o avançar e espere pelo nível 3 enquanto o respeita. Sua prioridade #1 neste confronto é nunca ser atingido pela **Lâmina Exterior** do Q dele. Ou certifique-se de que você está fora do alcance total do Q dele, ou certifique-se de se mover para perto dele para que ele não consiga a parte da cura. Tente sneakymente conseguir o avanço no nível 1 a seu favor, mas se ele não permitir (como deveria), então deixe-o empurrar você e espere pelo nível 3 enquanto conserva o HP. Sempre use W no W dele. Procure por boas trocas curtas, e uma vez que ele estiver com 60% de HP ou menos (e você estiver mais saudável), espere ele usar o Q, então use o 'taunt' nele para que ele não consiga a parte da cura e use o 'dragthrough' e dê 'all-in', você vence.",
      "Gnar": "Comece com E, e tente encontrá-lo por volta de 1 minuto ou mais tarde, mas antes que os minions tenham chegado, e tente acertar um 'taunt' e dar um bom dano nele. Você vence o 'all-in' e deve ser capaz de levá-lo a 40% e então recuar assim que ele chegar à torre dele (sempre use arbustos para impedi-lo de persegui-lo, ele só tem 1 sentinela). Se ele começar com E no nível 1 e pular o 'taunt', não vai te punir muito, e seu E tem alguns segundos a menos de tempo de recarga que o E dele, então tente dar 'taunt' no momento em que ele voltar se ele permitir. Se ele não permitir que você o 'taunte' antes dos minions, você ainda pode procurar por isso se ele se aproximar para dar 'poke', mas se não, apenas acerte os minions e tente disputar o nível 2 e veja como ele joga. Mais tarde, comece as lutas ou quando a barra de fúria dele estiver baixa ou, idealmente, logo quando ele mudar da forma grande para a pequena. Se você lutar com ele enquanto ele está na forma grande, tente atrair o W dele e desviar (a maioria dos Gnars estará apertando W repetidamente se eles forem 'tauntados', então você pode cronometrar um desvio de forma bastante previsível), então você pode trocar mais livremente depois disso (a menos que ele tenha o R e você esteja perto de uma parede).",
      "Pantheon": "Este é um dos campeões que são fortes o suficiente no nível 1 para que você não consiga o nível 2 primeiro, a menos que ele erre de alguma forma. Mas tente consegui-lo mesmo assim, chegando cedo na rota, posicione a lâmina e verifique se você tem permissão para bater na onda de minions inimiga quando ela chegar 3-5 vezes se ele estiver atrasado para a rota. Se for esse o caso, você pode jogar normalmente e trocar 'dragthrough' por alguns Qs em você e então jogar para o 'all-in' no nível 2. Se você não tiver permissão para bater na onda de graça, então apenas priorize manter seu HP alto, e deixe-o ter o avanço e respeite o 'all-in' dele no nível 2. Quando você estiver no nível 3 eventualmente, ENTÃO você pode procurar por trocas curtas (potencialmente dando 'taunt' se você estiver perto o suficiente da sua torre para desengajar relativamente rápido). <br> Mecanicamente: Assuma que ele estará apertando o E repetidamente quando ele sair de um 'taunt', então até mesmo preveja isso e corra para o lado quando o 'taunt' terminar para passar por ele (ou para longe se essa for uma opção). Além disso, se ele estiver procurando usar o W em você (enquanto ele não tiver uma vantagem de nível), então você pode deixar acontecer, mas pressione Q+W enquanto ele está no ar (viável se você estiver preparado para isso). Após o nível 6, geralmente não tem problema se ele for 'roamar' com o R se você tiver o seu para responder, já que seu R é melhor e mais adaptável em uma luta.",
      "Ryze": "Vá furtivamente e tente encontrá-lo em um arbusto de 1:05 a 1:25, se você o encontrar, comece com o E e dê 'all-in' nele, o que deve levá-lo a 30-50% de HP antes que ele escape para a torre. Se você não o encontrar e ele entrar na rota com a onda de minions dele, comece com o Q em vez disso e tente uma jogada 'cheese' no avanço, batendo bastante se ele não estiver te batendo a cada vez que você bater nos minions dele. Se ele o fizer, então seja um pouco mais conservador com o seu avanço e use principalmente sua passiva para bater e se manter saudável. No nível 2 (de preferência enquanto ele ainda está no nível 1, mas também não tem problema se ele estiver no nível 2, contanto que você esteja com a vida quase cheia), apenas tente acertar um 'taunt' nele e pegar o 'dragthrough', trocar e então correr para sair do 'aggro' para um arbusto (se ele wardar, apenas corra para o próximo arbusto). Continue tentando durante a fase inicial da rota (antes do primeiro retorno à base) acertar 'taunts' e ver se você pode matá-lo sozinho. Se você conseguir uma vantagem inicial e um bom primeiro retorno à base, então continue jogando de forma agressiva e dando 'taunt' frequentemente (enquanto você warda para o caçador), enquanto se você não conseguir uma vantagem inicial, então mude para um jogo de se manter com o HP alto e jogue para os Rs, a menos que seu caçador esteja vindo para o topo.",
      "Tryndamere": "NOTA: Precisa ser atualizado um pouco, sinceramente não tenho certeza de como o nível 1 funciona, já que não joguei o confronto o suficiente desde que ficou muito mais difícil. Aqui você deve abusar dele toda vez que ele ainda não tiver acumulado a barra de fúria, começando no nível 1. Posicione sua lâmina na rota e o ataque com Qs empoderados quando ele for pegar um 'CS' abusando do seu alcance superior. Não o deixe começar a te atacar bastante sem nem precisar usar o E, então ele pode usar o fantasma e persegui-lo no nível 1, já que você ainda não tem 'taunt'. Então o nível 1 é a parte mais assustadora deste confronto. No nível 2, deve ser impossível morrer para ele, já que você tem 'taunt' para desengajar, se necessário, apenas continue fazendo trocas curtas (ou vá para o 'all-in' se ele ainda estiver no nível 1). Os níveis 3-5 são onde você vence as trocas curtas mais facilmente. Apenas posicione a lâmina, sente-se em seus minions e troque com Qs empoderados a qualquer momento que ele se aproximar para tocar em seus minions e use seu W cedo se ele tentar te acertar. Se ele tentar estender a troca usando o E em você, então apenas o negue com um 'taunt' de desengajamento. Ele perderá as trocas tão facilmente que não conseguirá nem se aproximar para se curar de volta. Mais uma vez, nunca dê 'taunt' primeiro a menos que ele esteja com um HP que possa ser 'oneshotado'.",
      "Urgot": "O nível 1 de Urgot é super assustador, se ele te acertar com o E, você perderá 60% do seu HP ou mais, então apenas jogue de forma defensiva e pegue o 'CS' que puder. Se Urgot jogar de forma passiva no nível 1, podemos tentar usar isso, furtivamente dando alguns ataques básicos nos minions e pegando o nível 2 primeiro e dando 'taunt', mas se Urgot jogar corretamente, você terá que deixá-lo empurrar você no início enquanto espera pelo nível 3. Urgot realmente não pode forçar em você a menos que você cometa um erro, mas você também não pode realmente forçar nenhuma boa troca a menos que você consiga desviar do E dele. Uma maneira de potencialmente vencer as trocas é acertar um 'taunt' + 'dragthrough', começar a bater nele, e então no momento em que seu 'taunt' estiver terminando, você se desvia preventivamente. A maioria dos Urgots estará apertando o E repetidamente enquanto está sob controle de grupo e seu desvio o esquivará, já que ele tem um tempo de conjuração bastante considerável. Mas se ele vencer o jogo mental, isso vai dar errado para você, então tenha isso em mente. (se você não quiser correr nenhum risco, então apenas pegue TP e farme de forma segura até o nível 6) <br><b>MANEIRA ALTERNATIVA DE JOGAR:</b> <br>Assuma que você é o melhor jogador, e se mova com a ideia de atrair o E dele e desviar, mesmo a partir do nível 1. Se você conseguir desviar do primeiro E, você pode 'nevar' muito bem a partir daí. Mas se você for pego, é meio que 'RIP', depende de você quanta confiança (ou excesso de confiança?) você tem, soldado."
    }
  },
  "navbar": {
    "title": "Estratégias para o Shen",
    "language": "Linguagem:"
  },
  "about": {
    "text": "This is a simplsdasdafasfe single-page website."
  },
  "footer": {
    "copyright": "©"
  }
}