{
  "title": "Estratégias para o Shen",
  "statisticshen": "Estatísticas",
  "formula_dano": "Dano Reduzido (%) = (Resistência / (Resistência + 100)) * 100",
  "formuladescricao": "Então como em alguns outros jogos existe um softcap em 200 e o hardcap em 350. Esse é o intervalo que você que quer ficar, mais que isso é disperdicio. Pois o HP será mais valioso.",
  "formuladescricao2": "Lembre-se, caso o time inimigo errar e compor o time feito totalmente de um unico tipo de dano, então sinta-se livre para fazer qualquer coisa diferente ao atingir o hardcap, pois mas que ele será disperdicio de status",
  "header": {
    "title": "Welcome to Estratégias para o Shen",
    "subtitle": "Bem-vindo ao guia definitivo para dominar Shen, o Olho do Crepúsculo. Se você busca transcender o papel de tanque e se tornar uma verdadeira força no Rift, este é o seu lugar. Aqui, exploramos as nuances do campeão, revelando estratégias de jogo, builds ideais e a mentalidade correta para proteger seus aliados, dividir a pressão no mapa e impactar as lutas globais. Prepare-se para elevar sua maestria com Shen a um novo nível."
  },
  "Pros": {
    "1": "Teleporte Global",
    "2": "Fase de rotas forte",
    "3": "Mecânica de lâmina fluida",
    "4": "Ensina consciência de mapa",
    "5": "Teto de habilidade alto",
    "6": "Ninja que usa duas espadas"
  },
  "Cons": {
    "1": "Limpeza de onda limitada",
    "2": "Fraco contra campeões de longo alcance",
    "3": "Difícil de acertar controle de grupo",
    "4": "Ensina consciência de mapa",
    "5": "Dano em área baixo",
    "6": "Não é um dos favoritos da Riot."
  },
  "summary": {
    "title": "Sumário",
    "statistics": "Estatísticas",
    "basic": "Basico",
    "Abilities": "Habilidades e Estatísticas",
    "Mechanics": "Mecanicas"
  },
  "ShenSkills": {
    "KiBarrier": "Barreira de Ki",
    "TwilightAssault": "Ataque do Crepúsculo",
    "SpiritRefuge": "Refúgio do Espírito",
    "ShandowDash": "Investida das Sombras",
    "StandUnited": "Manter a União"
  },
  "KiBarrier": {
    "title": "Barreira de Ki",
    "Innate": "Inato:",
    "descricao1": "Após concluir os efeitos de uma habilidade, Shen concede a si mesmo um escudo por 47 - 120 (baseado no nível) (+ 13% de vida bônus) por 2.5 segundos. Se Shen atingir pelo menos um outro campeão com uma habilidade, o tempo de recarga de Barreira de Ki é reduzido em 4 - 8 segundos (baseado no nível).",
    "descricao2": "Shen manifesta uma Lâmina Espiritual que ele pode controlar com Ataque do Crepúsculo e Refúgio do Espírito.",
    "detalhes": "<p>A Lâmina Espiritual surge com Shen, se teletransporta para mais perto dele caso ele se afaste demais e instantaneamente se move para ele se ele usar qualquer teletransporte global, Teleporte, Retorno ou Manter a União. Ela também desaparecerá se Shen morrer e reaparecerá ao ressurgir.</p><p>Inimigos veem uma seta apontando de Shen para a localização de sua Lâmina Espiritual, mesmo que ela não esteja visível.</p><p>O Ataque do Crepúsculo concederá o escudo se a Lâmina Espiritual alcançar Shen. Se ela for parada, nenhum escudo é concedido. Ele concederá a redução de tempo de recarga ao atingir um campeão inimigo.</p><p>O Refúgio do Espírito concederá o escudo e/ou a redução de tempo de recarga depois que a zona protetora desaparecer. Não é preciso bloquear ataques para acionar a redução de tempo de recarga, apenas tocar um campeão aliado em qualquer ponto da duração.</p><p>A Investida das Sombras concederá o escudo quando a investida terminar. Ela concederá a redução de tempo de recarga ao atingir um campeão inimigo. Se a investida for um ícone representando o termo Interrompido, o escudo será recebido no momento em que a fonte de controle de grupo for aplicada, antes de qualquer cálculo de dano (se houver).</p><p>O Manter a União dará o escudo e/ou a redução de tempo de recarga ao completar o canal.</p>"
  },
  "TwilightAssault": {
    "title": "Twilight Assault",
    "descricao1": "Ativo: Shen invoca a sua Lâmina Espiritual de volta para a sua localização. Campeões inimigos atingidos são Lentos por 2 segundos enquanto se movem para longe de Shen.<br><br>Quando a lâmina chega, Shen fortalece os seus próximos 3 ataques básicos dentro de 8 segundos para ganharem 75 de alcance bônus e causarem dano mágico adicional. Contra estruturas, apenas a parte do dano base é aplicada.<br><br>Se a Lâmina Espiritual atingir pelo menos um campeão inimigo durante o trajeto, os ataques são aprimorados ainda mais para causarem dano mágico adicional aumentado e, de forma adicional, concederem a Shen 50% de Velocidade de Ataque bônus.<br><br>Ataques fortalecidos contra monstros causam 100% de dano bônus, mas o dano total é limitado.",
    "descricao2": "<p>Lentidão: 25 / 30 / 35 / 40 / 45%</p> <p>Dano Mágico Adicional: 10 - 40 (baseado no nível) (+ 2 / 2.5 / 3 / 3.5 / 4% (+ 1.5% por 100 de Poder de Habilidade) da vida máxima do alvo)</p> <p>Dano Mágico Total: 30 - 120 (baseado no nível) (+ 6 / 7.5 / 9 / 10.5 / 12% (+ 4.5% por 100 de Poder de Habilidade) da vida máxima do alvo)</p> <p>Dano Adicional Aumentado: 10 - 40 (baseado no nível) (+ 5 / 5.5 / 6 / 6.5 / 7% (+ 2% por 100 de Poder de Habilidade) da vida máxima do alvo)</p> <p>Dano Total Aumentado: 30 - 120 (baseado no nível) (+ 15 / 16.5 / 18 / 19.5 / 21% (+ 6% por 100 de Poder de Habilidade) da vida máxima do alvo)</p> <p>Dano Máximo em Monstros: 120 / 140 / 160 / 180 / 200</p>",
    "detalhes": "A Lâmina Espiritual irá parar no lugar ao colidir com o Muro de Vento ou o Inquebrável ou a Refutação ou o Giro da Lâmina. Se isso ocorrer, Shen não receberá os ataques fortalecidos.</p><p>Quando ela é invocada, a Lâmina Espiritual também verifica se o raio de jogo das unidades se sobrepõe ao seu (igual a uma verificação de raio de alcance 0), antes de partir, permitindo que ela atinja inimigos cujo centro está atrás da origem do projétil.</p><p>O ataque fortalecido não será ativado contra sentinelas.</p>",
    "interacao0": "Itens como: Jak'Sho, The Protean, Unending Despair e Eclipse. E as runas: Electrocute, Phase Rush, Approach Velocity, Font of Life e Cheap Shot aplicam seus efeitos quando o a espada espirutal é recalls. No caso precisando seguir como funciona as runas e itens, como o Electrocute que precisa de 3 ataque, o recall conta como 1 quaso acerte."
  },
  "SpiritRefuge": {
    "title": "Twilight Assault",
    "descricao0": "Ativo: Shen prepara sua Lâmina Espiritual, criando uma área ao redor dela. Após 2 segundos, ou quando Shen ou um campeão aliado entrarem na área, a Lâmina Espiritual gera uma zona protetora por 1.75 segundos, bloqueando todos os ataques básicos (exceto de torres) que atingirem Shen ou campeões aliados na área.",
    "detalhes": "<p>A zona protetora do Refúgio do Espírito pode ser movida enquanto ativa se Shen usar Ataque do Crepúsculo.</p><p>Refúgio do Espírito não pode ser aprimorado no Nível 1.</p><p>Refúgio do Espírito também bloqueará o dano de todas as habilidades que usam dano de ataque básico Investida, Disparo Místico, Tempestade de Aço, Ferro Mortal.</p><p>Clones aliados também são considerados campeões para esta habilidade.</p>"
  },
  "ShandowDash": {
    "title": "Shandow Dash",
    "descricao1": "<p>Passiva: Causar dano com Ataque do Crepúsculo ou Investida das Sombras restaura 30 / 40 / 50 (baseado no nível) de energia.</p> <p>Ativo: Shen avança para o local alvo, causando dano físico a campeões e monstros inimigos que ele atravessa e provocando-os por 1.5 segundos.</p> <p>Ataque do Crepúsculo e Refúgio do Espírito podem ser conjurados durante a investida.</p>",
    "detalhes": "Conjurar Flash durante a Investida das Sombras irá encerrar a investida prematuramente, mas a verificação de colisão do final da investida ainda atingirá os inimigos na localização do teleporte. <p>Isso ainda não pode afetar o mesmo inimigo mais de uma vez.</p> <p>A restauração de energia da Investida das Sombras pode ocorrer apenas uma vez.</p>"
  },
  "StandUnited": {
    "title": "Stand United",
    "descricao1": "Ativo: Shen concentra sua vontade, canalizando por 3 segundos e concedendo ao campeão aliado-alvo um escudo por 5 segundos no momento da conjuração, aumentado em 0% - 60% (com base na vida perdida do alvo). <p>Ao completar o canalização, Shen e sua Lâmina Espiritual se teletransportam para a localização do aliado-alvo, posicionando-se entre ele e o campeão inimigo mais próximo. Shen também destrói quaisquer projéteis que o estejam visando no momento da conclusão. </p>",
    "detalhes": "Manter a União pode ser usado em aliados via minimapa ou em seus retratos, ou usando as teclas F2 a F5. Nada disso pode ser feito se Shen for afetado por visão reduzida ou se o seu alvo estiver impossível de ser alvejado. <p>Shen se virará para encarar o aliado-alvo no início da canalização. Se o alvo estiver furtivo, os inimigos podem, em teoria, usar isso para estimar sua localização.</p> <p>Shen irá canalizar enquanto o seu alvo estiver vivo (mesmo se o escudo concedido for quebrado). Se o seu alvo morrer, a canalização é cancelada e Manter a União entra em tempo de recarga total.</p> <p>Interromper a canalização de Manter a União não removerá o escudo prematuramente.</p> <p>A tela do alvo brilhará em roxo para sinalizar que Shen o alvejou com Manter a União.</p> <p>Isso voltará ao normal quando a canalização terminar.</p> <p>Shen encontra o campeão inimigo visível mais próximo dentro de 2000 de alcance do aliado ou o campeão invisível mais próximo dentro de 600 de alcance para se posicionar a 175 unidades de seu aliado em direção a esse inimigo.</p> <p>Manter a União tem um raio de tolerância de 100 unidades.</p>",
    "interacao0": "Você pode usá-lo como alvo através do ícone acima do mapa.",
    "interacao01": "Funcionará como se você o usasse diretamente. Em lutas caóticas, esta é a maneira mais simples de evitar errar o alvo.",
    "interacao02": "O item Zeke's Convergence funciona ao final, quando você é teleportado ou interrompido o item é ativo automaticamente, de certa forma o item funciona."
  },
  "Mechanics": {
    "title": "Mecânicas por xPetu",
    "title1": "Padrão de Troca",
    "title2": "Troca Estendida",
    "title3": "Golpe de 'Grasp'",
    "title4": "O 'Provocar' da Torre",
    "title5": "E-Flash",
    "title6": "Q-Flash",
    "title7": "Triple-Q Leash",
    "title9": "Proteção com Q-W",
    "descricao1": "Na academia, é possível analisar as capacidades de uma pessoa através de uma metáfora de 'caixa de ferramentas'. Vamos pegar o meu caso como exemplo: toda vez que faço um curso na minha universidade e aprendo um novo ramo da matemática, estou adicionando uma nova ferramenta matemática à minha caixa de ferramentas matemática existente. Eu sou então capaz de combinar e usar as ferramentas disponíveis na minha caixa de ferramentas para resolver diferentes problemas. Em League of Legends, podemos adotar uma abordagem semelhante. O uso das ferramentas de troca de dano disponíveis para você compõe seu padrão de troca na fase de rotas. Depois de ler esta seção, você terá adquirido três (3) novas ferramentas para sua caixa de ferramentas de trocas com Shen. Ao combinar e usar essas ferramentas recém-obtidas no jogo, sua jogabilidade com o Shen subirá para outro nível.",
    "descricao2": "Esta é uma ferramenta de troca extremamente poderosa que pode ser aplicada notavelmente bem na maioria dos confrontos corpo a corpo. Para preparar a Troca Estendida, você precisa usar Ataque do Crepúsculo (Q) para arrastar sua Lâmina Espiritual para uma posição ofensiva antes da troca. Em geral, consideramos que a Lâmina Espiritual está em uma posição ofensiva quando está avançada no lado do inimigo na rota. Uma posição defensiva da Lâmina Espiritual significa que sua lâmina está perto de sua torre ou atrás de você em geral. Ao jogar de forma agressiva, sempre procure oportunidades para arrastar sua Lâmina Espiritual para uma posição ofensiva. Para realizar a Troca Estendida, comece simplesmente usando Q para puxar a Lâmina Espiritual através do seu oponente.",
    "descricao21": " Agora, você deve esperar por alguns segundos para deixar seu Q esfriar. As 3 cargas de Q fortalecidas duram 8 segundos, então você não precisa ter pressa. Se o inimigo não o respeitar, você pode simplesmente se aproximar e começar a atacá-lo. Após 3 ataques básicos, você deve se posicionar dentro do modelo do campeão inimigo para garantir um segundo arrasto com seu Q. Você quase certamente vencerá a troca se conseguir acertar todos os 6 ataques básicos fortalecidos. Você pode usar sua Corrida das Sombras (E) para diminuir a distância inicial, para perseguir para um abate ou para desengajar após seus Qs, dependendo do confronto e de como o inimigo joga. Você deve usar sua Barreira de Espírito (W) para bloquear as tentativas de retaliação do inimigo durante a troca. Esta ferramenta de troca está no seu melhor durante as fases iniciais da rota (níveis 2-5). Naturalmente, há espaço para variação, ou seja, a Troca Estendida pode ser realizada a partir de uma posição defensiva da Lâmina Espiritual ou com qualquer número de cargas iniciais de Q. Sempre tente adaptar as ferramentas para se adequar à situação apresentada a você.",
    "descricao3": "Em contraste com a Troca Estendida mencionada acima, que requer alguma preparação e comprometimento, o Golpe de 'Grasp' é uma ferramenta de troca que pode ser usada em quase todas as posições e é, por definição, muito menos arriscada. O Golpe de 'Grasp' é simplesmente um Q e um ataque básico que ativam a runa Aperto dos Mortos-Vivos. Quando realizado corretamente a partir de uma posição ofensiva da Lâmina Espiritual, o Golpe de 'Grasp' ativará as seguintes runas: Aperto dos Mortos-Vivos (permanecendo em combate com minions), Golpe de Escudo (ativando sua passiva com Q) e Golpe Baixo (o Q que desacelera o alvo). Isso é muito dano vindo de um (1) único ataque básico! Realizar o Golpe de 'Grasp' de forma consistente criará uma vantagem de vida para você, o que inevitavelmente levará a oportunidades de abate com a Troca Estendida. O segredo por trás do sucesso do Golpe de 'Grasp' é a Barreira de Ki. Não há como o oponente vencer trocas curtas contra um Shen que usa o 'Grasp-chop' perfeitamente, porque você sempre terá escudo ao entrar na troca curta.",
    "descricao4": "Esta ferramenta de troca é a mais situacional das três. Ela exige que você tenha uma rota de minions se acumulando, que está prestes a bater na torre inimiga. Para realizar o 'Provocar' da Torre, comece caminhando em direção ao oponente sob a torre e arrastando sua lâmina através dele, ativando assim seu escudo passivo. Em vez de atacar o campeão inimigo, simplesmente comece a atacar a torre dele. Nosso objetivo é permanecer em combate para preparar a runa Aperto dos Mortos-Vivos. O inimigo provavelmente irá atacá-lo e é nesse momento que você ataca: Acerte-o uma vez com um Q-ataque básico fortalecido e, em seguida, use E para recuar, passando através dele e se afastando da torre. Se feito corretamente, você estará fora do alcance da torre antes de levar um ataque dela.",
    "descricao5": "O 'Provocar'-Flash. Este é o truque mecânico mais conhecido de Shen e uma parte icônica de seu kit. Para realizar o E-Flash, use a Corrida das Sombras (E) e use o Flash antes que a corrida termine. É um combo muito simples, mas pode ser usado de maneiras infinitamente criativas. Para maximizar o alcance e a área coberta pela 'hitbox' de sua Corrida das Sombras, você deve usar E no alcance máximo e Flashar logo antes do final da corrida. No entanto, maximizar o alcance não é o único uso correto do 'Provocar'-Flash. Você pode realizar um E-Flash instantâneo usando o Flash imediatamente após seu E. Isso pode ser usado para pegar inimigos de surpresa a curta distância e é especialmente útil contra um Campeão como a Fiora, que está sempre procurando 'aparar' seu E. Eu recomendo praticar o 'Provocar'-Flash na Ferramenta de Treino antes de fazê-lo no jogo. Apenas brinque com o combo colocando vários bonecos de treino e tentando acertá-los de todas as formas criativas.",
    "descricao6": "Uma mecânica menos conhecida, mas igualmente importante, é o Q-Flash. Este truque foi documentado pela primeira vez por mim em 2017, mas ainda hoje permanece nas sombras e é ofuscado pelo popular 'Provocar'-Flash. O dano do Shen é bastante aumentado se você fortalecer seus Q-AAs arrastando sua Lâmina Espiritual através de um inimigo. Conseguir ou não o arrasto é frequentemente o fator decisivo para finalizar um inimigo. Puxar a Lâmina Espiritual através de um inimigo também reduz o tempo de recarga de sua Barreira de Ki e, portanto, pode, em combinação com outra habilidade, salvá-lo de dano que seria letal. O Q-Flash é o método mais rápido e confiável de garantir o arrasto. Para realizar o Q-Flash, use Ataque do Crepúsculo (Q) e Flash por cima do campeão inimigo antes que a Lâmina Espiritual chegue à sua localização. Se você Flashar tarde demais, a Lâmina Espiritual permanecerá no ponto inicial de onde você Flashou. Quando dominada, esta técnica se mostrará valiosa em todas as partidas que você jogar com Shen.",
    "descricao7": "Shen tem um dos melhores 'leashs' de caçador no nível 1 do jogo por causa do dano do Ataque do Crepúsculo (Q). A maioria dos jogadores de Shen simplesmente usa Q em 1:29 enquanto 'leasha' e depois acerta 3 Q-AAs no monstro. Isso está errado. Primeiro, descobrimos o 'Double-Q Leash'. Para realizar o 'Double-Q Leash', use seu primeiro Q em 1:25 e use Q novamente quando tiver usado os primeiros 3 Q-AAs. O princípio é o mesmo que na Troca Estendida. Agora, uma inferência apressada pode levá-lo a pensar que este é o melhor 'leash' possível que você pode dar. Você estaria errado. Shending Help foi o primeiro a documentar a técnica de 'leash' ideal para Shen, o 'Triple-Q Leash'. O 'Triple-Q Leash' adiciona um escudo passivo ao 'leash' e, portanto, supera o 'Double-Q Leash'. Manipulamos o tempo de recarga da Barreira de Ki usando Q antes do primeiro Q de dano em 1:25. Para realizar o 'Triple-Q Leash', use o primeiro Q em 1:17, o segundo Q em 1:25 e o terceiro Q em 1:34 (após 3 Q-AAs). Use seu escudo passivo para 'tankar' 1 ou 2 ataques para seu caçador. Ao fazer isso corretamente, você deixa seu caçador muito feliz e chega à rota a tempo para a morte do primeiro minion.",
    "descricao8": "A maioria dos jogadores de Shen usa sua Barreira de Espírito (W) em si mesmos, como se estivessem jogando de Jax e usando seu Contra-Ataque (E). Durante a fase de rotas, isso está correto porque você de fato está sozinho na rota superior. No entanto, quando se trata de lutas em equipe e pequenas escaramuças, a Barreira de Espírito de Shen deve ser usada para proteger seus companheiros de equipe. Barreira de Espírito é uma habilidade incrivelmente poderosa quando usada corretamente. Dar a um atirador uma imunidade de dois segundos a ataques básicos pode significar a diferença entre vencer e perder uma luta em equipe. A maneira mais fácil de aplicar Barreira de Espírito em um carregador é simplesmente ficar ao lado dele, usar Q para puxar a Lâmina Espiritual para lá e, em seguida, usar W. Além deste método básico, existe uma maneira avançada de bloquear ataques básicos em seus companheiros de equipe. A Proteção Avançada com Q-W, como eu gosto de chamá-la, é provavelmente a mecânica mais difícil de Shen de ser executada corretamente. É uma técnica situacional que exige que seu aliado esteja entre você e sua Lâmina Espiritual. Se você pressionar Q e W ao mesmo tempo, sua Lâmina Espiritual será preparada enquanto se move em sua direção. Quando preparada, ela ativará se passar por um campeão aliado, o que significa que também pode bloquear ataques básicos enquanto se move. Uma Barreira de Espírito ativada e em movimento também terá uma área de efeito instantânea maior do que uma Barreira de Espírito parada. Isso é causado pela frequência de verificação da Barreira de Espírito. Os detalhes dessa interação são omitidos aqui por enquanto, pois estão fora do escopo deste guia. Veja o vídeo abaixo para um exemplo de Proteção com Q-W e a área de efeito maior."
  },
  "skins": {
    "original": "<h2> <p> Original </p> </h2> Dentre os sigilosos guerreiros Ionianos conhecidos como Kinkou, Shen serve como seu líder, o Olho do Crepúsculo. Ele anseia por se manter livre da confusão das emoções, preconceitos e egos, e trilha o caminho invisível do julgamento imparcial entre o reino espiritual e o mundo físico. Com a tarefa de impor o equilíbrio entre eles, Shen empunha lâminas de aço e energia arcana contra qualquer um que ouse ameaçá-lo.",
    "frozen": "<h2> <p> Congelado </p> </h2> Enfrentando o frio amargo, Shen vagueia pelas calotas de gelo com suas lâminas gêmeas, caçando o aterrorizante demônio escondido nas profundezas.",
    "YellowJacket": "<h2> <p> Jaqueta Amarela </p> </h2>",
    "Surgeon": "<h2> <p> Cirurgião </p> </h2> Fique tranquilo, a anestesia não fará parte da operação.",
    "BloodMoon": "<h2> <p> Lua Sangrenta </p> </h2> O discípulo mais indomável, em mente e corpo, a lealdade de Shen ao culto da Lua Sangrenta jamais pode ser abalada. Ele serve como o guarda-costas pessoal das figuras mais importantes do grupo, executando intrusos com uma fria imparcialidade, sugerindo que parte de sua humanidade já foi consumida.",
    "WarlordSkin": "<h2> <p> Senhor da Guerra </p> </h2>",
    "tpa": "<h2> <p> TPA </p> </h2> Em homenagem ao desempenho vitorioso de Stanley como Shen durante o Campeonato Mundial de 2012.",
    "Pulsefire": "<h2> <p> Pulsefire </p> </h2> Ao longo dos milênios, Shen foi chamado de muitos nomes: senhor da guerra, invasor, conquistador. Mesmo assim, sua missão de construir um exército para todas as eras parece não ter fim. Buscando apenas os mais inteligentes e mais fortes para se juntarem às suas fileiras, ele permanece imperturbável pela emoção, lançando seu olhar atemporal sobre aqueles com potencial oculto.",
    "Infernal": "<h2> <p> Infernal </p> </h2> Um guerreiro Infernal vindo das profundezas furiosas do submundo, Shen aparece nos campos de batalha num piscar de olhos, protegendo seus companheiros titãs mesmo da resistência mais bem organizada.",
    "PsyOps": "<h2> <p> PsyOps </p> </h2> Um soldado psíquico e tenente de campo da PsyOps, o poder de Shen está conectado a uma criança fantasma que o segue aonde quer que ele vá - concedendo-lhe visões dos limites entre os vivos e os mortos. Apenas o Alto Comando sabe de onde o garoto veio, e eles não estão falando.",
    "Shockblade": "<h2> <p> Lâmina do Choque </p> </h2> Uma vez metade de uma dupla de elite da ordem Lâmina do Choque, Shen se afastou do combate após cometer um erro que quase custou a vida de seu parceiro, Zed. Agora, Shen treina jovens shinobi que se preparam para se juntar às suas fileiras - mas seu novo pupilo pode inspirá-lo a pegar sua espada e se juntar à luta mais uma vez.",
    "AshenGuardian": "<h2> <p> Guardião Cinéreo </p> </h2> Um devoto dos princípios de seu líder agora morto, Shen ainda caminha pelos terrenos do castelo, empunhando a lâmina de seu mestre junto com a sua. Talvez uma pequena parte dele reconheça, a cada golpe em sua armadura dado por viajantes em busca de antigas riquezas, que sua guarda é sem sentido. Mas a vida deve ter um significado. Até mesmo uma vida tão infinita como esta.",
    "ThreeHonors": "<h2> <p> Treis Honras </p> </h2> Shen é o último fundador sobrevivente da Ordem do Consolo. Ele fechou todos os templos quando o mundo caiu na apatia e no descaso, desaparecendo na obscuridade até que Malzahar reviveu a Ordem. Agora de volta das sombras, Shen serve como seu professor mais experiente, um líder estoico de integridade e graça em quem todos podem confiar."
  },
  "MapAwareness": {
    "title0": "Consciência de Mapa por xPetu",
    "title": "Consciência de Mapa",
    "title1": "Gerenciamento de Rotas",
    "title2": "Tempo de Habilidade",
    "title3": "Split-pushing",
    "title4": "Objetivo Atual",
    "title5": "Espelhando Pressão",
    "title6": "Visão",
    "title7": "Proteger Aliado",
    "fingers": "Como Shen, você precisa estar ciente do que está acontecendo no mapa. Primeiro, você precisa olhar para o minimapa constantemente, pelo menos uma vez a cada 5 segundos. Esta é uma dica geral e não específica para o Shen, pois irá melhorar sua jogabilidade com qualquer campeão. A segunda coisa importante é mover sua câmera pelo mapa. O minimapa fornece muitas informações, mas não todas. Para ver as barras de recursos do inimigo, a vida dos minions e as habilidades sendo usadas, você tem que olhar ao redor do mapa. Não há desculpas para manter sua câmera centrada em seu campeão o tempo todo. Você precisa saber o que todos em sua equipe estão fazendo, quem está em perigo e quem está seguro. Isso é vital para sua ultimate, pois você está dando a si mesmo mais tempo para pensar e tomar as melhores decisões. Você pode clicar no mapa para olhar ao redor ou usar as teclas F para ver seus companheiros de equipe. Eu pessoalmente reconfigurei minhas teclas F para Espaço (caçador), V (meio), C (atirador) e X (suporte). Isso me permite verificar rapidamente cada companheiro de equipe apenas com o polegar, mantendo o resto dos dedos no QWER.",
    "WaveManagement": "O estado das rotas de minions tem um impacto profundo no valor presente líquido da ultimate de Shen. Raramente é uma boa ideia usar Proteger Aliado se houver uma onda gigante de minions prestes a bater em sua torre. No melhor cenário, você teria empurrado sua rota de minions para a torre inimiga antes de ultar, minimizando assim a quantidade de minions perdidos durante sua ausência. Ter Teleporte para voltar à rota também é ideal. Na realidade, há situações em que você terá que ultar e a rota não estará em um estado perfeito. Mas podemos minimizar nossas perdas planejando com antecedência. Se você puder ler o estado do jogo e prever o que provavelmente acontecerá nos próximos minutos, poderá preparar as rotas de minions de acordo. Ultimates proativas são ótimas, pois podem (por definição) ser executadas enquanto sua rota está avançada.",
    "CastTiming": "O escudo de Proteger Aliado escala com a porcentagem de vida perdida do alvo, chegando a um máximo de 60% de vida perdida. A runa Revitalizar aumenta o escudo em alvos com menos de 40% de sua vida máxima, o que significa que o momento teoricamente ideal para usar sua ultimate é quando o aliado alvo está com menos de 40% de vida. É bom lembrar disso. No entanto, isso não significa que você deve usar sua ultimate apenas em aliados com pouca vida. Ao cronometrar sua ultimate, o fator decisivo deve ser as ações dos campeões inimigos. Você quer ultar no momento em que o oponente se compromete com seu aliado alvo. Usar Proteger Aliado é como pescar: você não quer ultar muito cedo e assustar o peixe, mas também não quer ultar muito tarde, quando a isca já foi comida.",
    "Split-pushing": "Após a fase de rotas, você vai querer começar a fazer split-push. Shen se destaca no split-push porque tem duas maneiras de se juntar ao seu time: Teleporte e Proteger Aliado. Ao contrário do que a maioria das pessoas pensa, o principal objetivo do split-push com Shen NÃO é derrubar torres, é tirar a pressão do seu time. Antes de começarmos o split-push, precisamos que Teleporte ou Proteger Aliado estejam fora do tempo de recarga, para que possamos nos juntar ao nosso time, se necessário. Agora, explicarei brevemente os três princípios essenciais do split-push. Dominar esses princípios melhorará exponencialmente sua jogabilidade com o Shen e, inevitavelmente, sua classificação também.",
    "CurrentObjective": "Você precisa reconhecer qual é o objetivo atual e começar a empurrar o lado oposto do mapa. Se for um objetivo neutro como o Barão, você faz split-push na rota inferior. Se seu time está se agrupando para pegar o inibidor inferior, você faz split-push na rota superior. Você está tentando forçar os inimigos a tirarem membros de sua equipe do objetivo atual, para que seu time obtenha o objetivo sem contestação ou vença uma luta em equipe vantajosa. Entender o objetivo atual e, por fim, a condição de vitória de sua equipe é uma das habilidades mais importantes no League.",
    "MirroringPressure": "Todos nós já vimos isso acontecer: um top laner feedado começa a fazer split-push, morre em um 1v3 e reclama que seu time não faz nada. Esse top laner não entende o conceito de espelhar a pressão. Como um split-pusher, é essencial saber quando seu time tem pressão e quando não tem. Quando 4 membros de sua equipe estão cercando uma torre, eles têm pressão e você pode espelhar isso aplicando pressão no lado oposto do mapa, forçando o inimigo a uma situação de perda. Quando sua equipe está recuando ou apenas espalhada aleatoriamente pela selva, eles não têm pressão, o que significa que você também não deve tentar aplicar pressão. Se você morrer quando seu time não tem pressão, o inimigo não perde nada. Em geral, quanto mais agressivo seu time for, mais agressivo você pode ser.",
    "Vision": "Como Shen, a pior coisa que você pode fazer é morrer de graça em uma rota lateral. Porque quando você está morto, você não pode ultar. E quando você não pode ultar, seu time vai 'intar'. Para evitar que isso aconteça, você vai querer ter cobertura de sentinelas ao redor de sua rota. Sempre compre 1 ou 2 Sentinelas de Controle ao fazer split-push. ISSO É EXTREMAMENTE IMPORTANTE. Se você não tiver espaço para uma Sentinela de Controle, venda seu Escudo de Doran. Use sua Sentinela Invisível e Sentinela de Controle para criar uma linha de visão na selva. Você não deve avançar além desta linha de visão a menos que tenha conhecimento da posição dos inimigos. Apenas lembre-se que morrer é a última coisa que você quer fazer. Se atacar a torre o coloca em risco, não a ataque.",
    "StandUnited": "Esta seção abordará os princípios do uso eficiente da ultimate como Shen. Proteger Aliado é uma habilidade que muda o jogo e, portanto, também tem um tempo de recarga monumental. Saber quando ultar e quando não ultar é uma chave importante para subir de elo nas ranqueadas com Shen. Uma distinção importante a ser feita é a diferença entre ultimates reativas e proativas. Ultimates reativas são realizadas para neutralizar a ação do inimigo e virar o rumo de uma luta (geralmente) ultando em um carregador em perigo. Ultimates proativas são feitas em colaboração com um aliado que inicia a luta para começar um confronto em nossos termos, ou seja, ultar em um Kha'Zix camuflado para assassinar a retaguarda inimiga ou ultar no Jarvan IV que em seguida usa seu combo E-Q no time inimigo."
  },
  "Glossary": {
    "title": "Glossário",
    "S": "<strong>S:</strong> Itens que são muito bons.",
    "A": "<strong>A:</strong> Itens que são bons.",
    "B": "<strong>B:</strong> Itens que dependem da composição do time inimigo.",
    "C": "<strong>C:</strong> Itens completamente situacionais.",
    "D": "<strong>D:</strong> Itens que normalmente não são feitos porque são ruins para o Shen.",
    "F": "<strong>F:</strong> Itens que não funcionam.",
    "???": "<strong>???:</strong> Itens sobre os quais não tenho ideia e não encontrei informações.",
    "descricao0": "O Kinkou Jitte e Twilight's Edge só estão ai por conta do nome, já que ambas fazerem referencia de certa forma a Ordem Kinkou e ao Shen que é o olho do crepusculo. <p>Alguns itens estão errados de propósito, descubram quais.</p>"
  },
  "navbar": {
    "title": "Estratégias para o Shen",
    "language": "Linguagem:"
  },
  "about": {
    "text": "This is a simplsdasdafasfe single-page website."
  },
  "footer": {
    "copyright": "©"
  }
}